{
  "total": 105,
  "jobs": [
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://www.linkedin.com/in/tatyankahrsukhovaya",
      "created_at": "Sat, 27 Sep 2025 20:23:36 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/Carbox_20250812125713.webp",
      "salary": "~ от 215 900 ₽",
      "title": "qa engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Carbox создает сервисы для более чем 15 миллионов водителей. Компания работает динамично, как стартап, но уже имеет более 10 лет опыта на рынке и развивается за счет собственных средств. В ближайшие 5 лет цель компании — стать одним из ведущих сервисов для автомобилистов в России.<\/p><p>Вы будете заниматься тестированием, включая автоматизацию, и работать с Golang, тестовыми фреймворками, Swagger и REST. Вам нужно будет писать сложные SQL-запросы с использованием JOIN, подзапросов и агрегатных функций.<\/p>",
      "company": "Carbox",
      "location": "",
      "id": 9477,
      "category": "qa",
      "conditions_details": "<ul><li>Удалённая работа<\/li><li>Работа по всему миру<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт тестирования от 2 лет, включая автоматизацию<\/li><li>Знаете Golang и тестовые фреймворки<\/li><li>Имеете опыт работы со Swagger<\/li><li>Имеете опыт работы с REST<\/li><li>Знаете SQL: умеете писать сложные запросы (JOIN, подзапросы, агрегатные функции)<\/li><\/ul>",
      "views": 12
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125851462",
      "created_at": "Sat, 27 Sep 2025 06:30:03 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon2.webp",
      "salary": "~ от 230 000 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания DevTeamGroup ищет опытного специалиста для работы над проектом Gem Space. Gem Space – это приложение, где можно решать любые задачи: читать, смотреть, общаться и зарабатывать, открывая неограниченные возможности для развлечений, бизнеса и повседневных дел.<\/p><p>Вы будете проводить ручное и автоматизированное тестирование мобильных и веб-приложений. Вам предстоит заниматься автоматизацией тестирования с использованием Java, Selenide, RestAssured, Appium, а также тестировать API и микросервисы. Кроме того, вы будете проводить функциональное и нефункциональное тестирование, включая анализ и тестирование требований, писать тестовую документацию и тестовые сценарии. Вам нужно будет разрабатывать фреймворк для тестирования, выявлять и приоритизировать ошибки, участвовать в командных митингах и сопровождать фичи на всех этапах разработки. Также вы будете проводить регрессионное и интеграционное тестирование, а также отчитываться о качестве продукта и предоставлять статус тестирования.<\/p>",
      "company": "ДэвТим-Групп",
      "location": "",
      "id": 9453,
      "category": "qa",
      "conditions_details": "<ul><li>Официальное трудоустройство<\/li><li>Конкурентоспособная заработная плата<\/li><li>Удаленный формат работы или работа в офисе (Минск)<\/li><li>Возможность обучения и развития<\/li><li>Компенсация больничных<\/li><li>Компенсация медицинского обслуживания и стоматологии<\/li><li>Компенсация спорта<\/li><li>Различные материальные бонусы по результатам работы<\/li><li>Работа в команде профессионалов<\/li><li>Подарки к праздникам, корпоративы, days off<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в тестировании iOS, Android, Web, Backend от 2 лет<\/li><li>Имеете опыт в автоматизации тестирования от 1 года с использованием Java, Selenide, RestAssured<\/li><li>Имеете опыт тестирования систем на микросервисной архитектуре<\/li><li>Имеете опыт работы с базами данных<\/li><li>Практически применяете практики тест-дизайна<\/li><li>Умеете проектировать тест-кейсы и подготавливать тестовые данные<\/li><li>Имеете опыт тестирования REST API (ручное и автоматизированное)<\/li><li>Имеете опыт работы с системой версионного контроля GIT (бранчи, пулл-реквесты и т.д.)<\/li><li>Имеете опыт работы с системами CI<\/li><li>Умеете использовать тестовые инструменты (Swagger, Postman, Fiddler/Charles, DevTools)<\/li><li>Умеете читать и анализировать логи<\/li><li>Имеете опыт тестирования аналитики (Appsflyer, Amplitude, Firebase, AppMetrica)<\/li><li>Будет плюсом: имеете практический опыт нагрузочного тестирования, практический опыт автоматизации с Appium, опыт написания эмуляторов, заглушек, опыт написания генераторов тестовых данных, опыт внедрения автотестов в CI/CD, опыт работы с ИИ<\/li><li>Умеете работать в команде, коммуникабельны<\/li><li>Проявляете проактивный подход к рабочим обязанностям<\/li><li>Обладаете развитыми аналитическими способностями, хорошей памятью, стрессоустойчивостью, ответственностью<\/li><li>Умеете управлять временем (способны эффективно планировать своё время и приоритизировать задачи для соблюдения сроков)<\/li><li>Владеете английским уровня intermediate и выше<\/li><\/ul>",
      "views": 55
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125843194",
      "created_at": "Fri, 26 Sep 2025 22:02:28 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon2.webp",
      "salary": "от 70 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания \"Юхелп\" — это доска объявлений, которая помогает людям находить работу или услуги в сфере домашнего персонала напрямую, без посредников. Она работает с прямыми работодателями по всей России, чтобы люди могли находить друг друга и строить доверительные отношения.<\/p><p>Вы будете разрабатывать и проводить тесты, чтобы убедиться в качестве веб-приложений. Вам нужно будет автоматизировать тестирование с помощью современных инструментов и фреймворков, а также анализировать и записывать результаты тестирования. Вы будете общаться с командой разработчиков, чтобы находить и исправлять ошибки, а также участвовать в улучшении процессов тестирования и качества продукта.<\/p>",
      "company": "Юхелп",
      "location": "",
      "id": 9442,
      "category": "qa",
      "conditions_details": "<ul><li>Полная занятость с графиком 5/2<\/li><li>Удалённая работа с гибким началом рабочего дня<\/li><li>Возможности для профессионального роста и развития<\/li><li>Работа в динамичной и дружной команде<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы от 1 до 3 лет в тестировании веб-приложений<\/li><li>Знаете Node.js и React на уровне, достаточном для понимания архитектуры приложения<\/li><li>Имеете опыт автоматизации тестирования и работы с инструментами<\/li><li>Умеете работать в команде и эффективно общаться с разработчиками<\/li><li>Обладаете вниманием к деталям и аналитическим складом ума<\/li><\/ul>",
      "views": 25
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125843649",
      "created_at": "Fri, 26 Sep 2025 13:37:29 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon1.webp",
      "salary": "~ от 169 900 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания NOVARDIS — это IT-компания, которая занимается внедрением систем управления клиентским опытом. Она работает с передовыми IT-продуктами и помогает своим клиентам развиваться.<\/p><p>Вы будете заниматься разработкой и поддержкой автоматизированных тестов для UI и API на Java с использованием Selenium WebDriver. Вам нужно будет создавать автоматические тестовые сценарии по требованиям, запускать тесты и анализировать результаты с помощью Allure. Также предстоит отлаживать и исправлять ошибки в тестах, оптимизировать процессы автоматического тестирования и поддерживать инфраструктуру. Вы будете работать с Git и Jira, настраивать Jenkins для запуска автотестов на разных ОС и писать тесты для мобильных приложений с помощью Appium и JUnit.<\/p>",
      "company": "NOVARDIS",
      "location": "",
      "id": 9400,
      "category": "qa",
      "conditions_details": "<ul><li>Занятость на проектной основе<\/li><li>Оформление по договору ГПХ или ИП<\/li><li>Сложные и интересные задачи в проектах внедрения систем управления клиентским опытом<\/li><li>Возможность работать в международных проектах для специалистов со знанием английского языка<\/li><li>Современное оборудование для гибридной и удалённой работы<\/li><li>Неограниченные возможности для карьерного и профессионального развития<\/li><li>Доступ к электронной библиотеке внутренних курсов компании и инвестиции в переобучение<\/li><li>Участие в профессиональных и отраслевых форумах и конференциях<\/li><li>ДМС со стоматологией<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы с Java<\/li><li>Умеете работать с Selenium WebDriver<\/li><li>Знаете Appium и JUnit<\/li><li>Владеете Rest assured<\/li><li>Имеете опыт работы с базами данных MSSQL или MySQL<\/li><li>Имеете опыт работы с Gitlab<\/li><li>Имеете базовые знания Zabbix для настройки мониторинга и дашбордов<\/li><li>Умеете настраивать Pipeline Jenkins и коннекты<\/li><li>Имеете опыт работы с базами данных MongoDB, PostgreSQL<\/li><li>Умеете оформлять кейсы, дефекты и тестовую документацию в Jira и Confluence<\/li><li>Будет плюсом опыт работы с Grafana, Docker, Influxdb, JMeter, Linux<\/li><li>Умеете готовить тест-кейсы на основании критериев принятия<\/li><\/ul>",
      "views": 43
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125838119",
      "created_at": "Fri, 26 Sep 2025 10:59:20 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon3.webp",
      "salary": "~ от 253 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания Индид — российский разработчик программного обеспечения в сфере информационной безопасности. Компания создает корпоративные продукты для защиты айдентити, которые обеспечивают многофакторную аутентификацию пользователей, контроль доступа к ресурсам и управление цифровыми сертификатами. Инновационные решения компании помогают выявлять и предотвращать атаки на айдентити, а также эффективно расследовать инциденты ИБ.<\/p><p>Вы будете проводить автоматизированное и ручное тестирование продукта в сфере безопасности. Вам предстоит развивать тестовый фреймворк и тестовые среды, активно разрабатывать системные и компонентные тесты, а также участвовать в нефункциональном тестировании продукта.<\/p>",
      "company": "Индид",
      "location": "",
      "id": 9384,
      "category": "qa",
      "conditions_details": "<ul><li>Официальное трудоустройство по ТК РФ с первого дня<\/li><li>ДМС со стоматологией после испытательного срока<\/li><li>Работа удаленно или гибридно, гибкий график<\/li><li>Образовательная программа, включающая курсы английского языка, приобретение литературы, участие во внутренних и внешних обучающих мероприятиях<\/li><li>Программа внутренней мобильности (переходы и развитие внутри компании)<\/li><li>Программы премирования за рекомендации новых сотрудников и внедрение идей<\/li><li>Преимущества работы в аккредитованной ИТ-компании<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете системное мышление<\/li><li>Обладаете продвинутыми аналитическими навыками<\/li><li>Имеете опыт автоматизации с помощью python + pytest + Allure ТестОпс<\/li><li>Имеете опыт тестирования клиент-серверных приложений<\/li><li>Имеете опыт проведения функционального и нефункционального тестирования<\/li><li>Имеете опыт менторинга других тестировщиков<\/li><li>Имеете базовые знания в администрировании операционных систем Linux и/или Windows<\/li><li>Имеете опыт работы с системами контроля версий (Git)<\/li><li>Будет плюсом опыт работы с Docker и/или системами виртуализации, понимание основ информационной безопасности, опыт работы с Active Directory, знание сетей и сетевых протоколов, опыт работы с протоколами LDAP/Kerberos/SMB/NTLM<\/li><\/ul>",
      "views": 22
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://t.me/V_recruiting",
      "created_at": "Fri, 26 Sep 2025 07:28:01 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/NDA_20250908093037.webp",
      "salary": "~ от 173 800 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания занимается разработкой собственной архитектуры для поддержки проектов европейских брендов. Вы будете планировать и проводить ручные и автоматизированные тесты для мобильных приложений на iOS и Android. Вам нужно будет писать и поддерживать скрипты автоматизации, а также взаимодействовать с командами разработки и продуктов, чтобы находить проблемы на ранних этапах. Перед каждым релизом вы будете проводить регрессионное тестирование, документировать результаты и отслеживать ошибки. Также вам предстоит участвовать в разработке стратегии QA для мобильных проектов и следить за новыми тенденциями в области мобильного QA.<\/p>",
      "company": "NDA",
      "location": "",
      "id": 9356,
      "category": "qa",
      "conditions_details": "<ul><li>Удалённая работа<\/li><li>Полная занятость (fulltime)<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы mobile QA (iOS и/или Android) от 2 лет<\/li><li>Имеете практический опыт тестирования на реальных устройствах и эмуляторах<\/li><li>Владеете инструментами автоматизации мобильного тестирования, такими как Appium, Espresso, XCUITest или аналогичными<\/li><li>Понимаете регрессионное, исследовательское, UI/UX и функциональное тестирование<\/li><li>Знакомы с жизненным циклом мобильных приложений, контролем версий и процессами выпуска<\/li><li>Умеете создавать и поддерживать тестовые случаи и отчёты об ошибках<\/li><li>Хорошо знаете SQL или похожий язык для проверки данных<\/li><li>Имеете опыт работы в Agile/Scrum-средах<\/li><li>Умеете выполнять тесты с использованием облачной мобильной платформы<\/li><li>Имеете базовое понимание Jetpack Compose, SwiftUI<\/li><li>Хорошо владеете английским языком, как письменно, так и устно<\/li><li>Будет плюсом: опыт работы с инструментами автоматизации мобильного тестирования (Appium, Espresso, XCUITest и аналогичными), хорошее знание SQL или аналогичного языка для базовой валидации данных, опыт работы в Agile/Scrum-средах, выполнение тестов с использованием облачной мобильной платформы, базовое понимание Jetpack Compose, SwiftUI, хорошее владение английским языком (письменным и устным)<\/li><\/ul>",
      "views": 36
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125822391",
      "created_at": "Fri, 26 Sep 2025 07:21:54 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/Koronatech_20250605190608.webp",
      "salary": "~ от 229 700 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Korona — это сервис для денежных переводов и смарт-займов, которым пользуются люди в разных странах. Приложение помогает быстро и безопасно решать финансовые задачи. Команда занимается разработкой внутренней платформы для программистов, чтобы они могли меньше времени тратить на рутину и больше — на создание крутых продуктов. Платформа помогает создавать микросервисы, настраивать интеграции, управлять секретами и выводить сервисы в продакшн. Сейчас активно работают над системой для легкого масштабирования технологий.<\/p><p>Вы будете заниматься разработкой и выполнением планов тестирования. Вам нужно будет тестировать новые функции на всех этапах, от анализа требований до написания автотестов. Также предстоит настраивать процессы тестирования в команде, тестировать REST API и бизнес-логику платформы, разрабатывать и поддерживать автотесты на Go. Вам нужно будет анализировать требования вместе с командой и вести техническую документацию по сервисам. По мере погружения в проект, вы будете участвовать в code review, писать автотесты, smoke-тесты и улучшать существующий фреймворк, а также улучшать процессы тестирования в подразделении.<\/p>",
      "company": "Koronatech",
      "location": "",
      "id": 9347,
      "category": "qa",
      "conditions_details": "<ul><li>Продуктовая разработка в сильной команде<\/li><li>Понятная траектория роста (performance review, карьерные консультации, индивидуальная карта развития и т.д.)<\/li><li>Обучение и развитие за счёт ресурсов компании (Учебный центр, корпоративная библиотека, оплата внешнего обучения)<\/li><li>Социальный пакет (ДМС с первого рабочего дня, скидки от партнёров, детская программа и т.д.)<\/li><li>Насыщенная корпоративная жизнь (радио, подкасты, кибертурнир, собственные мероприятия и участие в крупных событиях отрасли)<\/li><li>Возможность быть наставником, автором корпоративного блога, спикером – каждый выбирает то, что подходит именно ему<\/li><li>Официальное трудоустройство с первого дня, полностью белая зарплата<\/li><li>Удобный формат работы (гибрид или удаленная работа)<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете фундаментальные знания в тест-дизайне, понимаете типы, методологии и техники тестирования<\/li><li>Имеете опыт работы с тестовой документацией: тест-кейсами, чек-листами, тест-планами и TMS, системами багтрекинга / ALM<\/li><li>Понимаете и разделяете культуру поставки и поддержки артефактов тестирования<\/li><li>Умеете вести и читать техническую документацию, предъявлять требования к качеству технического задания<\/li><li>Имеете опыт ручного функционального, smoke-тестирования, регрессионного и исследовательского тестирования<\/li><li>Умеете читать и анализировать интеграционные логи для локализации дефектов<\/li><li>Имеете опыт работы с интеграционным тестированием (тестирование backend приложений через API, http-запросы, REST API /SOAP / JSON)<\/li><li>Знаете SQL на уровне простых запросов<\/li><li>Имеете опыт настройки или развёртывания тестовых окружений<\/li><li>Владеете инструментами контроля версий<\/li><li>Понимаете, какие проверки стоит автоматизировать, а какие нет (учитывая риски, уменьшение ручного труда и т.д.)<\/li><li>Будет плюсом: знаете языки программирования Go/Java, скриптовые ЯП; владеете CLI, bash; умеете писать автотесты с использованием go, httptest, testify, Wiremock, Docker, Cucumber+Java, RestAssured; имеете навыки работы с тулингом: curl, jmeter, Postman и пр.; понимаете работу Docker/Kubernetes, CI/CD, так как QA участвует в DevOps-процессах CI/CD<\/li><\/ul>",
      "views": 27
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125817998",
      "created_at": "Thu, 25 Sep 2025 21:29:00 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/_20250922190350.webp",
      "salary": "~ от 229 600 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания \"М.ТЕХ\" входит в группу \"М.ВИДЕО-ЭЛЬДОРАДО\" и занимается разработкой более 100 ИТ-продуктов. Используются современные технологии, такие как микросервисы, облачная инфраструктура, большие данные, биометрия, ИИ и машинное обучение. Продукты компании улучшают жизнь сотрудников и миллионов покупателей по всей России.<\/p><p>Вы будете работать в команде кластера \"Коммерция\" над продуктом \"Биллинг\". Этот продукт важен для автоматизации расчетов с поставщиками, работающими по модели \"Маркетплейс\", которая является стратегическим направлением компании. Вам предстоит разрабатывать и выполнять тесты для всех уровней приложения, от пользовательского интерфейса до API. Также вы будете проводить тестирование после завершения разработки, интеграционное, регрессионное и smoke-тестирование. Нужно будет писать и поддерживать автоматизированные тесты, создавать и обновлять тестовые данные. Для отслеживания и анализа ошибок вы будете работать с системами логирования и мониторинга. Вам также предстоит разрабатывать новые и поддерживать существующие тестовые сценарии, а также тестировать документацию.<\/p>",
      "company": "Мвидео",
      "location": "",
      "id": 9340,
      "category": "qa",
      "conditions_details": "<ul><li>Продукты, признанные на рынке и имеющие амбициозные планы на развитие<\/li><li>Конструктивный диалог и возможность внедрять свои идеи<\/li><li>Команда увлеченных профессионалов, открытая к новому<\/li><li>Конкурентная заработная плата<\/li><li>Гибкое отношение к рабочему месту: можно посещать офис в Москве (Сколково, БЦ Орбион) на гибриде или работать удаленно из любой точки<\/li><li>Приятные скидки в магазинах М.Видео-Эльдорадо<\/li><li>ДМС со стоматологией<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в роли Fullstack QA-инженера от 2-3 лет в коммерческой разработке<\/li><li>Знаете принципы тестирования программного обеспечения: функциональное, регрессионное, интеграционное, нагрузочное<\/li><li>Имеете опыт тестирования фуллстек приложений (UI + API), обязательно написание автотестов на Java<\/li><li>Имеете опыт работы с системами контроля версий (Git, GitHub, GitLab или аналогичные)<\/li><li>Знаете методологию Scrum и имеете опыт работы в Agile среде<\/li><li>Проявляете внимание к деталям, ответственность и желание развиваться в области тестирования<\/li><li>Будет плюсом: имеете опыт работы с продуктами в сфере электронной коммерции или маркетплейсах<\/li><\/ul>",
      "views": 35
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125817110",
      "created_at": "Thu, 25 Sep 2025 20:00:04 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon3.webp",
      "salary": "от 160 000 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания Кибернетика занимается разработкой продукта в сфере здравоохранения. Этот продукт используют тысячи клиентов и он состоит из множества сервисов, которые собирают информацию из разных источников, чтобы потом представлять её в удобном виде. В компании есть несколько команд разработки, каждая из которых отвечает за свои части продукта. Разработка ведется итеративно, и каждой команде нужны специалисты по тестированию.<\/p><p>Вы будете тестировать интеграционные проекты, работать с SOAP-сервисами и REST API. Вам нужно будет проверять взаимодействие с базами данных PostgreSQL и ElasticSearch. Также предстоит разрабатывать и выполнять автотесты для обеспечения качества продукта, писать тест-кейсы по требованиям и спецификациям, документировать результаты тестирования и отчеты о найденных дефектах. Вы будете взаимодействовать с разработчиками и другими участниками проекта, чтобы уточнять требования и решать возникающие проблемы.<\/p>",
      "company": "Кибернетика",
      "location": "",
      "id": 9337,
      "category": "qa",
      "conditions_details": "<ul><li>Возможность работать над интересными и сложными проектами в области интеграции<\/li><li>Перспективы профессионального роста и развития<\/li><li>Конкурентоспособная заработная плата и социальные гарантии<\/li><li>Работа в дружном и профессиональном коллективе<\/li><li>График работы 5/2, рабочие часы 8 часов<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в тестировании интеграционных проектов<\/li><li>Знаете и имеете практический опыт работы с SOAP-сервисами и REST API<\/li><li>Владеете навыками работы с базами данных PostgreSQL и ElasticSearch<\/li><li>Имеете опыт написания автотестов и знаете инструменты для их реализации<\/li><li>Знаете инструменты автоматизации тестирования, такие как Selenium, Jenkins, Appium<\/li><li>Умеете составлять тест-кейсы и документировать результаты тестирования<\/li><li>Имеете навыки работы в команде и хорошие коммуникативные способности<\/li><li>Проявляете внимание к деталям и умеете выявлять потенциальные проблемы<\/li><li>Будет плюсом: опыт работы от 3 до 6 лет<\/li><\/ul>",
      "views": 53
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125717891",
      "created_at": "Thu, 25 Sep 2025 19:59:16 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon2.webp",
      "salary": "~ от 174 900 ₽",
      "title": "Тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания ITFB Group занимается разработкой и внедрением программного обеспечения, создавая инновационные продукты. Она помогает ускорять ИТ-разработку и повышать надежность информационных систем для более чем 100 клиентов, включая крупные компании в своих отраслях. Работа компании не всегда заметна, но она способствует развитию бизнеса, заводов и городов.<\/p><p>Вы будете заниматься автоматизацией тестирования API, UI и бизнес-логики веб-приложений, а также проводить ручное тестирование. Вам нужно будет разрабатывать дизайн автотестов и стратегии автоматизированного тестирования, а также поддерживать инфраструктуру автотестов, включая Allure, Jenkins и GitLab. Также предстоит определять подходы к автоматизации тестирования систем, оценивать трудозатраты и риски внедрения автоматизированного тестирования, и предоставлять отчетность о проделанной работе.<\/p>",
      "company": "ITFB Group",
      "location": "",
      "id": 9336,
      "category": "qa",
      "conditions_details": "<ul><li>Работа на интересных проектах с возможностью ротации<\/li><li>Бонусы от государства как сотруднику аккредитованной IT компании<\/li><li>Оформление по ТК и полностью белая заработная плата, выплачиваемая два раза в месяц<\/li><li>Социальный пакет с ДМС, стоматологией, оплачиваемыми больничными и отпусками<\/li><li>Возможность карьерного развития, наставничество и постановка карьерных целей<\/li><li>Возможность работать удаленно<\/li><li>Предоставление оборудования<\/li><li>Участие в спортивных мероприятиях, корпоративах, тимбилдингах, подарки и скидки от партнеров<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт в QA от 2 лет с навыками как в ручном, так и в автоматизированном тестировании<\/li><li>Имеете практический опыт разработки автотестов на C# от 1 года<\/li><li>Умеете тестировать API (REST, SOAP) и писать SQL-запросы<\/li><li>Применяете системный подход к тестированию, используя техники тест-дизайна<\/li><li>Умеете создавать качественную тестовую документацию и подготавливать тестовые данные<\/li><li>Понимаете основы клиент-серверного взаимодействия<\/li><li>Знакомство с другими языками программирования, помимо C#, будет плюсом<\/li><li>Понимание принципов построения фронтенда будет плюсом<\/li><li>Понимание принципов построения клиент-серверных приложений будет плюсом<\/li><li>Знакомство с GitLab CI/CD, Jenkins будет плюсом<\/li><li>Опыт использования Allure framework, Selenoid, Selenium Grid, Docker будет плюсом<\/li><\/ul>",
      "views": 38
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://magnit.tech/vacancies/2327",
      "created_at": "Thu, 25 Sep 2025 19:44:36 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/_20250322231720.svg",
      "salary": "~ от 218 500 ₽",
      "title": "qa engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Команда Магнит OMNI занимается развитием пользовательского опыта покупок в Магнит Маркете. Она отвечает за весь путь клиента, начиная от добавления товара в корзину и заканчивая оформлением заказа.<\/p><p>Вы будете документировать и отслеживать ошибки, создавать чек-листы и подробные тестовые сценарии. Вам нужно будет проводить регрессионное, функциональное и интеграционное тестирование. Также предстоит писать автотесты под Android, а при желании — и под iOS.<\/p>",
      "company": "Магнит",
      "location": "",
      "id": 9321,
      "category": "qa",
      "conditions_details": "<ul><li>Оформление в аккредитованную ИТ-компанию<\/li><li>ДМС со стоматологией и льготными условиями для членов семьи<\/li><li>Предоставление техники для работы<\/li><li>Возможность реализовать свой опыт и потенциал в интересных и многоплановых проектах<\/li><li>Оплачиваемое обучение на курсах и участие в конференциях<\/li><li>Возможность участвовать в митапах и хакатонах для знакомства с работой других подразделений<\/li><li>Корпоративные скидки PRIMEZONE и программы лояльности<\/li><li>Доступ к корпоративной библиотеке курсов<\/li><li>Возможность рекомендовать компанию друзьям по реферальной программе<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в QA от 3 лет<\/li><li>Имеете опыт тестирования приложений на Android и iOS<\/li><li>Имеете опыт написания автотестов на Android или iOS<\/li><li>Знаете, как работать со снифферами трафика Charles/Proxyman<\/li><li>Имеете опыт работы с REST API, Swagger, HTTP/HTTPS, JSON<\/li><li>Имеете опыт работы с Gitlab CI<\/li><li>Имеете базовые знания Git<\/li><li>Умеете работать с требованиями и технической документацией<\/li><li>Знаете методики тестирования<\/li><li>Способны выявлять уязвимые места систем и находить дефекты<\/li><li>Понимаете, как работают клиент-серверные приложения<\/li><\/ul>",
      "views": 35
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://t.me/evgeniyaponomaryova",
      "created_at": "Thu, 25 Sep 2025 15:03:54 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon2.webp",
      "salary": "~ от 280 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания Salmon занимается разработкой продуктов для финансовой сферы. Работает с клиентами из банковской, брокерской и биржевой индустрии.<\/p><p>Вы будете заниматься разработкой и поддержкой тест-кейсов, анализировать результаты тестирования. Вам нужно будет работать с разработчиками и DevOps-командой, чтобы улучшать инструменты для автоматизации тестирования. Также предстоит следовать процессам QA, предлагать улучшения, создавать и развивать стратегию тестирования с фокусом на автоматизацию. Вы будете выполнять тест-планы, в основном автоматизированные, но иногда и ручные. Вам нужно будет отвечать за создание и поддержку набора автоматизированных тестов в своей зоне ответственности и отчитываться по их состоянию. Вы будете давать оценки старшим QA Automation инженерам и поднимать риски при возникновении сложностей с выполнением задач.<\/p>",
      "company": "Salmon",
      "location": "",
      "id": 9254,
      "category": "qa",
      "conditions_details": "<ul><li>Международная команда специалистов со всего мира<\/li><li>Быстрый профессиональный рост, где важны только результаты<\/li><li>Вознаграждение за вклад и долгосрочный успех компании<\/li><li>Возможность карьерного роста в международных проектах<\/li><li>Варианты удалённой и гибридной работы<\/li><li>Медицинская страховка, программы здоровья и благополучия<\/li><li>Корпоративные мероприятия и активности онлайн и офлайн<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы от 3 лет в аналогичной роли<\/li><li>Имеете хорошие навыки программирования, понимаете принципы SOLID и паттерны проектирования<\/li><li>Имеете опыт создания фреймворка тестовой автоматизации с нуля — это будет плюсом<\/li><li>Имеете опыт ручного и автоматизированного API-тестирования с использованием Java/Kotlin и Postman<\/li><li>Имеете опыт тестирования приложений для финансовых организаций с микросервисной архитектурой<\/li><li>Умеете чётко и кратко описывать сложные баги и ситуации<\/li><li>Имеете отличные коммуникативные и коллаборационные навыки<\/li><\/ul>",
      "views": 33
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125765179",
      "created_at": "Thu, 25 Sep 2025 15:02:30 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/Bitsgap_Holding_20250925150230.webp",
      "salary": "~ от 208 000 ₽",
      "title": "Тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Bitsgap — это крупная платформа для автоматизации криптотрейдинга. Она помогает трейдерам использовать торговых ботов и алгоритмические ордера. Компания работает с 2017 года и входит в тройку лучших агрегаторов криптобирж. Технологиями Bitsgap пользуются более 500 000 трейдеров.<\/p><p>Вы будете разрабатывать и поддерживать автотесты для веб-приложений, используя Playwright и TypeScript. Вам нужно будет фиксировать ошибки и следить за их исправлением в Jira, а также составлять и обновлять тест-кейсы и чек-листы в Zephyr. Вы будете анализировать и участвовать в разработке тестовой документации в Confluence, общаться с командами разработчиков и QA, а также помогать улучшать процессы тестирования.<\/p>",
      "company": "Bitsgap Holding",
      "location": "",
      "id": 9253,
      "category": "qa",
      "conditions_details": "<ul><li>Работа из любой точки мира<\/li><li>Участие в создании ценного продукта, который помогает клиентам по всему миру<\/li><li>Возможность быть на передовой финансового рынка<\/li><li>Работа в международной компании с европейскими стандартами и командой из 21 страны<\/li><li>Стабильная заработная плата каждый месяц<\/li><li>Оплачиваемый больничный<\/li><li>21 день оплачиваемого отпуска<\/li><li>Компенсация обучения на курсах и вебинарах<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в тестировании от 2 лет<\/li><li>Имеете опыт в трейдинге (FOREX/крипта)<\/li><li>Умеете вести тестовую документацию и понимаете сроки и этапы тестирования<\/li><li>Умеете тестировать проекты методом чёрного ящика, имитируя работу обычного пользователя<\/li><li>Понимаете методологию разработки ПО и умеете находить простые ошибки<\/li><li>Можете заглянуть в консоль браузера, чтобы понять, где проблема (Frontend или Backend), и дать разработчикам максимум информации о ней<\/li><li>Имеете опыт разработки технической документации и описания продуктов<\/li><li>Знаете SQL и умеете делать простые запросы к базе данных для анализа проблем<\/li><li>Имеете базовые знания HTML и CSS<\/li><li>Владеете инструментами для работы с HTTP-запросами (Postman, curl) и имеете опыт работы с API<\/li><li>Знаете и умеете работать с системами управления тестированием<\/li><\/ul>",
      "views": 31
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125803745",
      "created_at": "Thu, 25 Sep 2025 14:59:38 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon3.webp",
      "salary": "от 150 000 ₽",
      "title": "Тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Secure-T – это IT-компания, которая с 2019 года разрабатывает платформу для повышения осведомлённости пользователей в области информационной безопасности. Продуктами компании уже воспользовались более 300 тысяч человек из крупных организаций, таких как Hh, РЖД, ДоДо пицца и другие. Компания ищет специалиста по автоматизированному тестированию для дальнейшего развития своей платформы.<\/p><p>Вам предстоит заниматься разработкой и поддержкой автотестов для UI и API, а также поддерживать существующую инфраструктуру тестирования. Вам нужно будет участвовать в анализе требований и планировании тестирования, проводить регрессионное тестирование и анализировать его результаты. Также вы будете взаимодействовать с ручными тестировщиками, командой разработки и продуктовой командой, улучшать процессы тестирования и покрытие автотестами. Вам потребуется готовить техническую документацию по тестам и фреймворку, а также интегрировать автотесты в CI/CD.<\/p>",
      "company": "Секьюр-Ти",
      "location": "",
      "id": 9249,
      "category": "qa",
      "conditions_details": "<ul><li>Гибридный или полностью удалённый формат работы<\/li><li>Официальное оформление по ТК РФ в аккредитованную IT-компанию со всеми льготами<\/li><li>Большой пакет ДМС после прохождения испытательного срока<\/li><li>Предоставление ноутбука или, по желанию, корпоративных стикеров и мерча<\/li><li>Свободный дресс-код в офисе<\/li><li>Корпоративные мероприятия, такие как картинг и nerf-война<\/li><li>Регулярные встречи и performance review по результатам работы<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы от 2 до 3+ лет в автоматизированном тестировании<\/li><li>Знаете Python на уверенном уровне<\/li><li>Имеете опыт работы с инструментами тестирования, например, Selenium<\/li><li>Умеете писать автотесты для API и Web UI<\/li><li>Имеете опыт работы с CI/CD и настройки автотестов в пайплайне<\/li><li>Знаете процесс разработки ПО и методологии Agile/Scrum<\/li><li>Имеете опыт построения или развития фреймворков с нуля<\/li><li>Умеете работать с системами контроля версий, такими как Git<\/li><li>Имеете опыт работы с базами данных и выполнения SQL-запросов<\/li><li>Умеете работать автономно и принимать технические решения<\/li><li>Будет плюсом: имеете опыт работы с Docker или навыки настройки окружения (Docker, GitLab CI и т.п.), а также опыт работы с Allure, TestRail или другими системами отчётности<\/li><\/ul>",
      "views": 22
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125802471",
      "created_at": "Thu, 25 Sep 2025 14:40:19 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon3.webp",
      "salary": "~ от 197 000 ₽",
      "title": "Тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>ISPsystem — это IT-компания с более чем 20-летним опытом, которая разрабатывает и поддерживает собственные продукты для управления IT-инфраструктурой. Среди них ПО для работы с физическими серверами, виртуализацией и биллинговые платформы. Цель компании — стать ведущей экосистемой программных продуктов для управления IT-инфраструктурой на всех уровнях. Клиентами ISPsystem являются более 1000 компаний из более чем 100 стран мира. Компания уделяет особое внимание качеству своих продуктов и расширяет команду QA.<\/p><p>Вы будете заниматься разработкой и поддержкой автоматизированных тестов для веб-приложений, включая UI и API, используя Python и Pytest. Вам нужно будет автоматизировать UI-тестирование с помощью Selenium WebDriver и API-тестирование с использованием Requests. Также предстоит генерировать и анализировать тестовые отчёты в Allure, работать с тестовыми данными и проверять результаты через SQL-запросы. Вам потребуется интегрировать автотесты в CI/CD pipeline, взаимодействовать с разработчиками, аналитиками и DevOps-инженерами для уточнения требований и воспроизведения дефектов, а также настраивать и использовать мок-сервисы и заглушки для изолированного тестирования. Анализ сетевого трафика с помощью снифферов (Charles Proxy, Fiddler, Wireshark) для отладки и диагностики также будет входить в ваши задачи.<\/p>",
      "company": "ISPsystem",
      "location": "",
      "id": 9231,
      "category": "qa",
      "conditions_details": "<ul><li>Работа в аккредитованной IT-компании в полном соответствии с ТК РФ<\/li><li>Интересные задачи, возможность прокачать техническую экспертизу и профессионально расти, углубляясь в автоматизацию или тест-аналитику<\/li><li>Работа в классной, технически сильной команде, где приветствуется обмен опытом<\/li><li>Справедливая и полностью \"белая\" заработная плата, соответствующая профессиональному уровню<\/li><li>Рост заработной платы пропорционально персональным успехам<\/li><li>Возможность посещать профильные конференции и обучающие курсы<\/li><li>Участие во внутренних обучающих митапах в качестве слушателя или докладчика<\/li><li>Занятия английским с штатным преподавателем<\/li><li>Доплаты по больничным и отпускам для восстановления без потери дохода<\/li><li>Возможность получения отсрочки от военной службы и ИТ-ипотеки под 5%<\/li><li>Классный мерч, регулярные интеллектуальные игры и оффлайн-мероприятия дважды в год, включая одно на Байкале<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в QA-автоматизации от 1 года<\/li><li>Умеете уверенно использовать Python для написания тестов и вспомогательных утилит<\/li><li>Имеете опыт работы с Pytest, включая параметризацию, фикстуры и маркировку тестов<\/li><li>Владеете навыками работы с Selenium WebDriver, включая XPath/CSS селекторы, ожидания и обработку сложных элементов<\/li><li>Имеете опыт автоматизации тестирования API с использованием Requests<\/li><li>Знаете Allure для формирования понятных и наглядных отчётов<\/li><li>Понимаете основы SQL: SELECT, JOIN, фильтрация, сортировка, группировка<\/li><li>Знаете принципы построения тестовой архитектуры (Page Object, API Object)<\/li><li>Имеете опыт работы с системами контроля версий (Git)<\/li><li>Будет плюсом опыт работы с Docker и контейнеризированными окружениями, опыт работы с мок-сервисами и заглушками (WireMock, Mockoon, custom mocks), навыки анализа трафика с помощью снифферов (Charles, Fiddler, Wireshark), опыт настройки CI/CD (Jenkins, GitLab CI, TeamCity), знание основ работы HTTP, REST, JSON, XML, опыт тестирования микросервисных архитектур, а также английский язык на уровне чтения технической документации<\/li><\/ul>",
      "views": 24
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://career.habr.com/vacancies/1000162228",
      "created_at": "Thu, 25 Sep 2025 12:57:21 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/1_20250416072317.webp",
      "salary": "~ от 196 200 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Т1 — это компания, которая помогает людям развиваться в IT и решать интересные задачи. В ней создают атмосферу открытости и комфортные условия для работы. В Т1 можно выбрать любое IT-направление и построить свою карьеру. Компания быстро растёт и ищет новых специалистов.<\/p><p>Вы будете заниматься созданием новых и поддержкой уже существующих автоматизированных тестов на Java 17, Selenide, Rest Assured, Jdbi, Junit 5, Gradle. Также вам нужно будет развивать проект автоматизации тестирования, улучшая подходы и внедряя новые инструменты. При желании можно заняться поддержкой инфраструктуры автоматизации, такой как Teamcity, Bitbucket, Nexus, Selenoid/Moon, и создавать артефакты автоматизированного тестирования.<\/p>",
      "company": "Т1",
      "location": "",
      "id": 9222,
      "category": "qa",
      "conditions_details": "<ul><li>Современный стек технологий<\/li><li>Программа ДМС со стоматологией после испытательного срока<\/li><li>Корпоративные скидки и система компенсаций<\/li><li>Внутреннее обучение<\/li><li>Возможность работать в офисе или удаленно (удаленка из РФ)<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт автоматизации тестирования web, понимаете HTML, CSS, XPath, умеете работать с Chrome devtools<\/li><li>Имеете опыт автоматизации тестирования API, понимаете HTTP, REST, умеете работать со Swagger/Postman/SoapUI<\/li><li>Знаете SQL и имеете опыт работы с одной из реляционных баз данных: Oracle, PostgeSQL, MySQL, MS SQL<\/li><li>Уверенно знаете Java SE<\/li><li>Умеете работать с Git<\/li><li>Имеете опыт работы с Selenide/Selenium<\/li><li>Имеете опыт работы с RestAssured (или аналогами)<\/li><li>Имеете опыт работы с Jdbi (Jdbc)<\/li><li>Знаете теорию тестирования<\/li><li>Понимаете цели автоматизации тестирования<\/li><li>Способны самостоятельно выявлять проблемы тест-кейсов и добиваться их устранения<\/li><li>Имеете опыт работы с Docker (будет плюсом)<\/li><li>Имеете опыт работы с CI/CD системами (будет плюсом)<\/li><li>Имеете опыт работы с Selenoid/Moon (будет плюсом)<\/li><\/ul>",
      "views": 37
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://www.aviasales.ru/about/vacancies/4071365",
      "created_at": "Wed, 24 Sep 2025 21:34:23 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/Aviasales_20250416064253.webp",
      "salary": "~ от 183 000 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Команда Internal Support Automations в Авиасейлс создает эффективную поддержку, где автоматизация берет на себя рутинные задачи, а люди фокусируются на заботе о клиентах и решении сложных вопросов.<\/p><p>Вы будете участвовать в обсуждении новых функций и проверке требований, тестировать новые сервисы и интеграции на этапе разработки и перед выпуском. Вам нужно будет работать с баг-трекером, описывая ошибки и контролируя их исправление, а также совместно с командой принимать решения по улучшению сервисов. Вам предстоит разрабатывать тестовую документацию, анализировать тестовое покрытие и улучшать процессы работы с качеством внутри команды.<\/p>",
      "company": "Aviasales",
      "location": "",
      "id": 9198,
      "category": "qa",
      "conditions_details": "<ul><li>Работа в любой точке мира, оплата в долларах<\/li><li>Удобные и открытые процессы без бюрократии<\/li><li>Компенсация ДМС, психотерапии или иностранных языков, занятий спортом<\/li><li>Оплата больничных<\/li><li>Возможность работать на Пхукете<\/li><li>Компенсация детского обучения (садик, школа)<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Знаете специфику бекенд-приложений и их тестирования<\/li><li>Умеете грамотно оценивать трудозатраты и планировать свою работу<\/li><li>Имеете опыт тестирования веб-приложений (будет плюсом)<\/li><li>Умеете проектировать тестовые сценарии для микросервисной архитектуры (будет плюсом)<\/li><li>Имеете опыт работы с автотестами на Golang и написания сценариев для них (будет плюсом)<\/li><\/ul>",
      "views": 69
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125725143",
      "created_at": "Wed, 24 Sep 2025 21:18:24 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon3.webp",
      "salary": "~ от 234 000 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>DZ Systems — это группа компаний, которая работает с 2005 года и входит в реестр аккредитованных IT-компаний. Продукты, созданные компанией, активно используют крупные федеральные предприятия. Главные ценности компании — это качество продукта, своевременность реализации проектов, высокая адаптивность, удобство использования и забота о людях. Для заказчика в телеком-компании ищется QA Engineer уровня Senior для работы над data-продуктом, который обеспечивает доступ к структурированным данным разных индустрий.<\/p><p>Вы будете заниматься проектированием и автоматизацией функциональных тестов на Python для сервисов, которые обрабатывают данные (ETL). Вам нужно будет проектировать метрики качества для витрин данных и интегрировать их в систему контроля качества. Также предстоит контролировать тестовое покрытие, обновлять документацию в TMS (Allure TestOps), организовывать интеграционное тестирование с другими командами и участвовать в релизном процессе, проходя тесты критически важного функционала.<\/p>",
      "company": "DZ Systems",
      "location": "",
      "id": 9196,
      "category": "qa",
      "conditions_details": "<ul><li>Программа \"Кафетерий\" для компенсации затрат на спорт, английский язык и проф. обучение<\/li><li>English club для улучшения разговорного английского<\/li><li>Day-off: до 3 дней оплачиваемого больничного без больничного листа<\/li><li>Пересмотр зарплаты по итогам аттестации два раза в год<\/li><li>Официальное оформление по ТК РФ с первого дня работы (возможны варианты по ИП/ГПХ)<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в QA от 2 лет<\/li><li>Умеете разрабатывать автоматизированные тесты с использованием Python<\/li><li>Владеете SQL на продвинутом уровне<\/li><li>Знаете и понимаете методологии и виды тестирования<\/li><li>Умеете разрабатывать тест-кейсы и понимаете методики тест-дизайна<\/li><li>Имеете опыт использования GitLab CI/CD для автоматизации сборки и развертывания приложения<\/li><li>Знаете основы Linux и умеете работать с командной строкой<\/li><li>Имеете опыт работы с Docker<\/li><li>Будет плюсом: опыт работы с Airflow, Hadoop, Kafka<\/li><\/ul>",
      "views": 45
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125727143",
      "created_at": "Wed, 24 Sep 2025 21:02:20 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/_20250322230810.svg",
      "salary": "~ от 186 500 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>МТС — это цифровая экосистема, которая создает и развивает сервисы в сферах мобильной связи, больших данных, искусственного интеллекта, облачного хранения, медиа и финансов. Компания делает жизнь людей проще и интереснее. Один из сервисов — MTC Music, который предлагает более 50 миллионов треков, подкастов и аудиокниг.<\/p><p>В команду MTC Music ищут автоматизатора тестов. Вам предстоит разрабатывать и воплощать стратегию тестирования платформы МТС Музыка (бэк, фронт, мобильная разработка), разрабатывать автотесты и подготавливать тестовые данные. Также нужно будет проводить тестирования UI, RestAPI и мобильных приложений, разрабатывать и оптимизировать тестовую документацию и методики испытаний, регистрировать и отслеживать дефекты, а также систематизировать обнаруженные проблемы.<\/p>",
      "company": "МТС",
      "location": "",
      "id": 9190,
      "category": "qa",
      "conditions_details": "<ul><li>Оклад плюс годовой бонус<\/li><li>Программа ДМС с первого месяца работы, включая 100% покрытие расходов в частных клиниках, стоматологию, страховку в поездках за границу и страхование жизни. Близких родственников можно застраховать со скидкой 50%<\/li><li>Очное и онлайн-обучение в Корпоративном университете и у внешних провайдеров, обмен опытом во внутренних профессиональных сообществах, доступ к онлайн-библиотеке<\/li><li>Оплачиваемые выходные на значимые события в жизни сотрудника<\/li><li>Материальная помощь в сложных жизненных ситуациях<\/li><li>Корпоративная мобильная связь и интернет, единая подписка МТС Premium (включая онлайн-кинотеатр KION, сервис МТС Music, МТС Строки)<\/li><li>Предложения от партнеров для путешествий, развлечений и занятий спортом<\/li><li>Возможность участия в волонтерских программах (благотворительные ярмарки, образовательные проекты для детей, конкурсы социальных проектов, экологические проекты)<\/li><li>Внутренняя спортивная программа «В движении» (забеги, марафоны, турниры по разным видам спорта, медитации и занятия на баланс)<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт написания автотестов на Python<\/li><li>Знаете и понимаете жизненный цикл ПО и проекта<\/li><li>Знаете процессы тестирования, виды и уровни тестирования, жизненный цикл ПО<\/li><li>Понимаете технологии виртуализации и контейнеризации<\/li><li>Имеете опыт выполнения проектов по автоматизированному тестированию<\/li><li>Имеете опыт применения техник тест дизайна<\/li><li>Имеете опыт тестирования API и интеграционного тестирования<\/li><li>Знаете принципы построения микросервисной архитектуры и тестирования распределенных приложений<\/li><li>Понимаете принципы REST API и способы его тестирования<\/li><\/ul>",
      "views": 50
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125727034",
      "created_at": "Wed, 24 Sep 2025 19:33:32 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon3.webp",
      "salary": "от 115 000 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Группа Компаний \"Эксперт\" — лидер в частной медицине России и СНГ с 17-летней историей. Компания создаёт цифровые решения, которые ежедневно помогают тысячам пациентов получать качественную медицинскую помощь.<\/p><p>Вы будете заниматься полным циклом тестирования функциональности, от анализа требований до подготовки релиза. Вам нужно будет разрабатывать и улучшать тестовую документацию, проводить функциональное, интеграционное и регрессионное тестирование. Также предстоит приоритизировать и фиксировать дефекты, вести баг-трекинг и активно общаться с командами разработки, аналитики и продукта.<\/p>",
      "company": "ГК Эксперт",
      "location": "",
      "id": 9182,
      "category": "qa",
      "conditions_details": "<ul><li>Ответственная и интересная работа в аккредитованной ИТ-компании<\/li><li>Оформление по ТК РФ<\/li><li>Конкурентная \"белая\" заработная плата<\/li><li>Удалённый формат работы<\/li><li>Регулярное обучение и посещение конференций за счет компании<\/li><li>Корпоративные льготы на медицинские услуги для сотрудников и членов их семей<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт коммерческого тестирования WEB и API от 2-х лет в составе кросс-функциональной команды<\/li><li>Понимаете жизненный цикл ПО и методологии тестирования<\/li><li>Умеете четко и структурированно излагать дефекты и их причины на техническом и бизнес-языке<\/li><li>Умеете работать с системами контроля версий (Git)<\/li><li>Знаете и имеете практический опыт работы с Python + Selenium, API и 1С (будет плюсом)<\/li><li>Имеете опыт работы с TMS TestRail/TestIT (будет плюсом)<\/li><\/ul>",
      "views": 47
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125730763",
      "created_at": "Wed, 24 Sep 2025 19:32:15 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/Selecty_20250521154136.webp",
      "salary": "от 220 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания Selecty работает над проектами для крупного частного банка. В работе активно используется тестирование как ручное, так и автоматизированное, в равной степени затрагивая как веб-приложения и API, так и внутреннюю часть систем.<\/p><p>Вы будете проводить ручное и автоматизированное тестирование продуктовых доработок. Вам предстоит работать с веб-приложениями и Rest API, писать автоматизированные тесты на C#, выполнять сложные SQL-запросы и проводить выгрузки данных. Также нужно будет осуществлять интеграционное тестирование и поддерживать CI/CD процессы с использованием инструментов автоматизации, работать с брокерами сообщений.<\/p>",
      "company": "Selecty",
      "location": "",
      "id": 9180,
      "category": "qa",
      "conditions_details": "<ul><li>Оформление по ТК или ИП на выбор кандидата<\/li><li>Расширенный ДМС со стоматологией и телемедициной<\/li><li>Скидки на изучение иностранных языков<\/li><li>Скидки на фитнес<\/li><li>Скидки на кино от КАРО<\/li><li>По желанию кандидата выдается техника для работы<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт написания автоматизированных тестов на C# от 3 лет<\/li><li>Имеете опыт работы с Rest API<\/li><li>Имеете опыт работы с SQL базами данных на уровне очень сложных запросов и выгрузок<\/li><li>Имеете опыт работы с интеграционным тестированием<\/li><li>Имеете опыт работы с CI/CD (Jenkins)<\/li><li>Имеете опыт работы с брокерами сообщений (Kafka, RabbitMQ, аналоги)<\/li><li>Владеете инструментами: Postman/Swagger, Jira, Confluence, Git, Visual Studio, Bitbucket<\/li><li>Будет плюсом опыт работы с системами на микросервисной архитектуре (Spring Cloud, Kubernetes, Openshift или аналоги) и опыт работы в Fintech со сложными бизнес процессами<\/li><\/ul>",
      "views": 31
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125711579",
      "created_at": "Wed, 24 Sep 2025 12:32:26 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon4.webp",
      "salary": "~ от 179 000 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>AIT.LAB — это сообщество из более чем 500 IT-специалистов, где ценятся комфорт, развитие и стабильность. Компания является резидентом «Сколково» и сотрудничает с более чем 30 крупными компаниями в сфере финтеха и инвестиций. Предлагаются проекты, соответствующие стеку технологий, интересам и ритму жизни специалистов.<\/p><p>Вы будете заниматься разработкой и поддержкой автоматизированных тестов для веб-приложений и API. Вам нужно будет участвовать в анализе требований и создании тестовой документации, такой как тест-кейсы и тест-планы. Также предстоит работать с системами контроля версий (Git) и CI/CD, и участвовать в улучшении процессов тестирования и качества продукта.<\/p>",
      "company": "Аналитика ИТ Лаб",
      "location": "",
      "id": 9177,
      "category": "qa",
      "conditions_details": "<ul><li>Полностью удалённый формат работы<\/li><li>Гибкий старт дня: с 9:00 до 10:00 по МСК<\/li><li>Предоставляется необходимое оборудование или возможность работать на своем<\/li><li>Компенсация использования ДМС или расходов на спорт<\/li><li>Предоставляется 2 дня off в первый год работы, 5 дней — со второго<\/li><li>Оказывается материальная поддержка в особые моменты<\/li><li>Бессрочный трудовой договор по ТК РФ или иной формат по согласованию<\/li><li>28 дней отпуска + оплачиваемые больничные<\/li><li>Работа с современным стеком, отсутствие легаси, долгосрочные проекты<\/li><li>Обеспечивается подбор следующего проекта заранее при завершении текущего<\/li><li>Есть карьерный трек внутри компании<\/li><li>Предоставляется индивидуальная помощь в подготовке резюме, подсветке достижений и переговорах с заказчиком<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете базовые знания TypeScript (JavaScript)<\/li><li>Умеете составлять локаторы (XPath, CSS)<\/li><li>Имеете опыт работы с Selenium (или WebDriverIO)<\/li><li>Знаете основные команды Linux и Docker<\/li><li>Имеете опыт работы с базами данных (основные команды SQL, понимание разницы между реляционными и нереляционными БД)<\/li><li>Понимаете принципы REST API и микросервисной архитектуры<\/li><li>Имеете опыт работы с k8s (Kubernetes)<\/li><li>Понимаете назначение и принципы работы Redis (поверхностно)<\/li><li>Имеете опыт работы с заглушками (Stubs/Mocks)<\/li><\/ul>",
      "views": 58
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://t.me/AlesyaPS",
      "created_at": "Wed, 24 Sep 2025 12:28:05 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/EMCD_20250909052050.webp",
      "salary": "до 316 000 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>EMCD — это ведущая финтех-компания, которая занимается криптовалютами. Она является крупнейшим майнинг-пулом в Восточной Европе и одним из мировых лидеров. Компания создает экосистему сервисов для работы с цифровыми активами и развивает продукты для миллионов пользователей, активно расширяясь на международных рынках.<\/p><p>В команду ищут двух сильных QA-инженеров, которые будут заниматься автоматизацией тестирования. Вам предстоит разрабатывать и выполнять комплексные планы тестирования, включая функциональное и регрессионное тестирование. Также нужно будет создавать и поддерживать автоматизированные тесты для фронтенда и бэкенда, участвовать в улучшении тестовых фреймворков и инфраструктуры автоматизации. Вам нужно будет тестировать REST API, работать с базами данных (SQL/NoSQL) и проверять корректность данных, а также встраивать тесты в CI/CD (GitLab CI, Jenkins, GitHub Actions).<\/p>",
      "company": "EMCD",
      "location": "",
      "id": 9174,
      "category": "qa",
      "conditions_details": "<ul><li>Удалённая работа или гибридный формат в Москве<\/li><li>Гибкий график работы<\/li><li>28 дней отпуска плюс 12 бонусных дней<\/li><li>100% оплачиваемый больничный<\/li><li>Финансирование курсов, обучения и сертификаций<\/li><li>Работа с продуктами высокой нагрузки с реальным влиянием на рынок<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в QA от 5 лет<\/li><li>Имеете сильный опыт в автоматизации тестирования<\/li><li>Имеете опыт работы с CI/CD и понимаете DevOps-процессы<\/li><li>Имеете хорошие знания API и баз данных<\/li><li>Будет плюсом опыт использования AI-инструментов<\/li><\/ul>",
      "views": 52
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125694066",
      "created_at": "Wed, 24 Sep 2025 10:33:34 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon1.webp",
      "salary": "от 170 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания \"КСА\" — это аккредитованная IT-компания, которая занимается полным спектром услуг по проектированию, разработке, внедрению и сопровождению решений на платформе 1С для предприятий по всей России.<\/p><p>Вам предстоит проверять бизнес-процессы в ритейле, такие как продажи, склад, логистика и финансы, а также интеграции с кассовыми системами, WMS и CRM. Вы будете участвовать в тестировании нового функционала ERP-системы Microsoft Dynamics NAV.<\/p>",
      "company": "КСА",
      "location": "",
      "id": 9145,
      "category": "qa",
      "conditions_details": "<ul><li>Белая оплата труда по окладной системе<\/li><li>Возможность работать в аккредитованной ИТ-компании<\/li><li>График работы: полный рабочий день (5/2)<\/li><li>Формат работы: удалённо<\/li><li>Оформление по ТК РФ, ГПХ, ИП или самозанятость<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете глубокие знания ERP NAV<\/li><li>Имеете опыт работы с ERP Navision/Ms Dynamics Nav от 2-х лет<\/li><li>Умеете готовить тестовые модели<\/li><li>Умеете проводить функциональные и интеграционные тесты<\/li><li>Имеете опыт использования модуля автотестирования на платформе Navision/Ms Dynamics Nav (будет плюсом)<\/li><li>Имеете опыт работы с Microsoft Dynamics AX (будет плюсом)<\/li><li>Знаете SQL (будет плюсом)<\/li><li>Знаете инструменты автоматизации процессов тестирования, такие как средства ведения тест-кейсов, трекеры дефектов и средства тестирования API (будет плюсом)<\/li><\/ul>",
      "views": 37
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125700364",
      "created_at": "Wed, 24 Sep 2025 10:07:06 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/evrone_20250701164119.webp",
      "salary": "до 210 000 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания Evrone занимается разработкой продуктов для стартапов и помогает в цифровой трансформации бизнеса в России, США и Европе. Они работают над технически сложными, высоконагруженными проектами с большой бизнес-логикой или серверной инфраструктурой. Компания предоставляет услуги по аналитике, проектированию интерфейсов, разработке, инфраструктуре и эксплуатации, выступая как полная техническая команда проекта или консультируя существующие команды. Вся команда работает удаленно с 2008 года, что позволяет эффективно организовывать распределенную разработку.<\/p><p>Вам предстоит проводить автоматизированное тестирование для backend-сервисов и писать автотесты на Python. Также нужно будет ставить и сопровождать задачи по улучшению продукта и устранению проблем, составлять и актуализировать сценарии тестирования, контролировать тестовое покрытие и постоянно совершенствовать технологии контроля качества. Вы будете участвовать в процессе разработки по Agile.<\/p>",
      "company": "evrone",
      "location": "",
      "id": 9120,
      "category": "qa",
      "conditions_details": "<ul><li>Удаленная фулл-тайм работа<\/li><li>Гибкий график с необходимостью синхронизации тайм-зон и пересечения рабочего времени с командой<\/li><li>Качественный онбординг и HR-менеджмент, возможность смены проектов<\/li><li>Учёт профессиональных и личных интересов сотрудников при формировании команды<\/li><li>Работа в дружном и профессиональном коллективе<\/li><li>Хорошо организованный рабочий процесс, отсутствие бюрократии и работа на доверии<\/li><li>Годовой бюджет на развитие: ДМС, спорт, курсы иностранных языков, техника, обучение (курсы, тренинги, книги, конференции)<\/li><li>Премии за привлечение новых сотрудников и клиентов, за выступления на конференциях и митапах<\/li><li>Оплачиваемое участие в проведении технических интервью<\/li><li>Внутренние митапы и культура менторства<\/li><li>Доступ к внутренней библиотеке электронных книг и курсов<\/li><li>Возможность практиковать английский язык с западными заказчиками<\/li><li>Помощь в подготовке докладов для конференций (офлайн и онлайн), оплата расходов и студийная съемка<\/li><li>Возможность публиковать статьи в блогах компании с помощью редакторов и иллюстраторов<\/li><li>Поддержка и продвижение open source проектов, оплата часов, потраченных на контрибьюцию<\/li><li>Помощь менторов в начале работы с open source проектами<\/li><li>Регулярные корпоративные мероприятия для личного общения<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете знание теории и методологий тестирования, владеете навыками тест-дизайна и проектирования тестов<\/li><li>Имеете опыт написания автотестов на Python от 1 года<\/li><li>Знаете специфику тестирования и автоматизации бекенда<\/li><li>Владеете синтаксисом построения SQL-запросов<\/li><li>Имеете чёткое понимание процесса тестирования, его целей, задач и места в цикле разработки<\/li><\/ul>",
      "views": 33
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://t.me/nadzeya_recruiter",
      "created_at": "Wed, 24 Sep 2025 08:41:45 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon3.webp",
      "salary": "от 158 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания DevHunt — это стартап, который меняет то, как люди общаются с искусственным интеллектом. В приложении есть много AI-персонажей, с которыми можно общаться текстом, фото и видео. У компании уже более 250 тысяч активных пользователей в месяц, и каждую неделю добавляется по 2-3 новые функции.<\/p><p>Вам нужно будет тестировать iOS, Android, Web и backend API. Также предстоит проверять бизнес-логику, включая платежи, deep links, A/B-тесты и монетизацию. Вы будете проводить smoke и регрессионное тестирование перед релизами, расставлять приоритеты, анализировать баги через логи, мониторинг и трафик. Кроме того, вам нужно будет сотрудничать с командой продукта и разработки, а также менторить небольшую QA-команду.<\/p>",
      "company": "DevHunt",
      "location": "",
      "id": 9114,
      "category": "qa",
      "conditions_details": "<ul><li>Работа в международной команде<\/li><li>Гибкий график и удалённый формат работы<\/li><li>Возможность влиять на продукт с миллионами пользователей<\/li><li>Работа в быстрорастущем AI-стартапе<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете более 4 лет опыта ручного QA мобильных или веб-продуктов<\/li><li>Умеете работать с API (Postman, cURL)<\/li><li>Имеете опыт работы с баг-трекингом (Jira)<\/li><li>Владеете навыками анализа логов и работы с сетевыми прокси (Fiddler, Charles)<\/li><li>Умеете быстро адаптироваться в стартапе и самостоятельно находить риски<\/li><li>Будет плюсом опыт UI-автоматизации (Playwright, Appium, Detox)<\/li><li>Будет плюсом знание performance/load/security-тестирования<\/li><li>Будет плюсом опыт работы с AI-продуктами или мессенджерами<\/li><\/ul>",
      "views": 37
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125688393",
      "created_at": "Wed, 24 Sep 2025 08:15:39 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon2.webp",
      "salary": "от 230 000 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания Sifox занимается запуском IT-продуктов на телеком-рынке России. Эти продукты помогают операторам получать новую выручку. У компании есть своя команда разработки, более 10 лет опыта на рынке, финансирование и желание создавать инновационные IT-решения для телекома. Компания является резидентом Сколково и её решения внесены в Реестр отечественного ПО Минцифры.<\/p><p>Вы будете заниматься созданием тестового окружения для приложений, которые работают внутри мобильных операторов и взаимодействуют с их модулями. Вам нужно будет разрабатывать регрессионные тест-планы, писать TestCases, автоматизировать e2e и интеграционные тесты в области VoIP-разработки, а также разрабатывать и проводить нагрузочные тесты.<\/p>",
      "company": "Sifox",
      "location": "",
      "id": 9107,
      "category": "qa",
      "conditions_details": "<ul><li>Релевантный уровень дохода (fix+KPI), обсуждается с успешным кандидатом<\/li><li>Оформление с соблюдением всех норм ТК РФ<\/li><li>ДМС (после 3 мес. испытательного периода)<\/li><li>Возможность удаленной работы<\/li><li>Аккредитация Минцифры: предоставляются все льготы для IT-специалистов (в том числе IT-ипотека)<\/li><li>Широкие возможности для саморазвития в компании увлеченных, активных людей, болеющих своим делом<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете QA-бэкграунд в сегменте телеком<\/li><li>Знаете VoIP/SIP и мобильные протоколы (ISUP, SMPP)<\/li><li>Являетесь опытным пользователем Linux (работа из командной строки, bash, awk)<\/li><li>Имеете опыт работы с инструментами автоматизации тестирования, такими как JMeter<\/li><li>Владеете Gitlab, Gitlab CI<\/li><li>Знаете SQL<\/li><li>Будет плюсом владение одним из языков разработки (python или java)<\/li><li>Будет плюсом опыт работы со средствами тестирования в телеком, такими как sipp<\/li><li>Будет плюсом опыт работы с Docker и K8s<\/li><li>Будет плюсом опыт работы с ansible (в том числе опыт работы с jinja2)<\/li><\/ul>",
      "views": 37
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://t.me/ITHR_Uliana",
      "created_at": "Tue, 23 Sep 2025 13:27:15 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon1.webp",
      "salary": "~ от 250 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Банковская группа Синара ищет опытного специалиста по автоматизации тестирования мобильных приложений для работы над проектами в сфере финтеха. Компания занимается разработкой продуктов, которые развивают мир финтеха.<\/p><p>Вы будете работать в команде с другими автоматизаторами, создавать и обновлять автотесты для мобильных приложений банков Синара и Делобанк, а также инвестиций Синара. Вам нужно будет развивать и улучшать фреймворк автоматизации, проводить ревью кода коллег, заводить и отслеживать исправление багов, а также обучать и помогать менее опытным сотрудникам.<\/p>",
      "company": "СКБ Лаб",
      "location": "",
      "id": 9059,
      "category": "qa",
      "conditions_details": "<ul><li>Оформление в аккредитованную ИТ компанию ООО \"СКБ Лаб\"<\/li><li>Конкурентная заработная плата<\/li><li>ДМС со стоматологией<\/li><li>Услуги и продукты Банка на льготных условиях<\/li><li>Интересная корпоративная жизнь<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в автотестировании мобильных приложений<\/li><li>Знаете Python, Pytest, Selenium, Requests, Git, CI/CD, Docker, SQL<\/li><li>Умеете проводить ревью кода коллег<\/li><li>Понимаете, как заводить баги и отслеживать их исправление<\/li><li>Будете обучать и помогать менее опытным коллегам<\/li><\/ul>",
      "views": 40
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125665327",
      "created_at": "Tue, 23 Sep 2025 13:24:45 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/1_20250421064059.webp",
      "salary": "~ от 177 400 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания 1С — это крупная IT-компания, которая разрабатывает программное обеспечение для малого бизнеса и розницы. Продукты компании помогают автоматизировать учет и управление в различных сферах бизнеса.<\/p><p>Вам предстоит заниматься проектным, регрессионным и приемочным тестированием типовых конфигураций и сервисов 1С. Нужно будет готовить тест-планы и тестовые данные, проводить интеграционное тестирование, а также разрабатывать автоматизированные сценарии тестирования. Вам также нужно будет регистрировать и работать с ошибками, взаимодействовать с разработчиками и методистами, и оценивать трудозатраты на тестирование.<\/p>",
      "company": "1С",
      "location": "",
      "id": 9056,
      "category": "qa",
      "conditions_details": "<ul><li>Сильная команда и дружный коллектив, где всегда помогут и поддержат<\/li><li>Расширенный социальный пакет, включающий медицинское обслуживание, питание и спорт<\/li><li>Гибкое начало рабочего дня<\/li><li>Возможность выбора формата работы: удаленка, гибрид или офис<\/li><li>Просторный офис рядом с метро Тимирязевская с бесплатной парковкой, кофе-поинтами, массажными креслами и библиотекой<\/li><li>Предоставляется мощное оборудование для комфортной работы<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы с конфигурациями на платформе 1С:Предприятие<\/li><li>Понимаете ведение управленческого учета<\/li><li>Знаете виды и процесс обработки первичной документации<\/li><li>Проявляете внимательность, аккуратность и здоровый перфекционизм<\/li><li>Умеете работать в команде<\/li><li>Будет плюсом опыт работы с конфигурациями на платформе 1С:Предприятие и знание систем 1С Предприятие и типовых конфигураций<\/li><\/ul>",
      "views": 37
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://t.me/ITHR_Uliana",
      "created_at": "Tue, 23 Sep 2025 12:58:49 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon4.webp",
      "salary": "до 250 000 ₽",
      "title": "qa engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Банковская группа Синара занимается развитием финтех-продуктов. Компания ищет опытного специалиста по автоматизации тестирования мобильных приложений.<\/p><p>Вы будете работать в команде с другими автоматизаторами, создавать и обновлять автотесты для мобильных приложений Синара банк, Делобанк или Синара инвестиции. Вам предстоит развивать и улучшать фреймворк автоматизации, проводить ревью кода коллег, заводить баги и отслеживать их исправление, а также обучать и помогать менее опытным коллегам.<\/p>",
      "company": "Синара",
      "location": "",
      "id": 9049,
      "category": "qa",
      "conditions_details": "<ul><li>Оформление в аккредитованную ИТ компанию ООО \"СКБ Лаб\"<\/li><li>Конкурентная заработная плата<\/li><li>ДМС со стоматологией<\/li><li>Услуги и продукты Банка на льготных условиях<\/li><li>Интересная корпоративная жизнь<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в автотестировании мобильных приложений<\/li><li>Знаете стек: Python, Pytest, Selenium, Requests, Git, CI/CD, Docker, SQL<\/li><li>Умеете проводить ревью кода коллег<\/li><li>Понимаете, как заводить баги и отслеживать их исправление<\/li><li>Готовы обучать и помогать менее опытным коллегам<\/li><\/ul>",
      "views": 36
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125658288",
      "created_at": "Tue, 23 Sep 2025 12:36:08 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/_20250923123608.webp",
      "salary": "от 200 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания Трайв Технолоджис занимается разработкой активно развивающихся проектов. Вы будете заниматься тестированием программного обеспечения на различных платформах, включая iOS, Android, Web и Backend. Вам предстоит проводить мануальное тестирование, а также автоматизировать его с использованием Python или Java, Selenide, Selenium, RestAssured, Appium и других инструментов. Вам нужно будет тестировать системы на микросервисной архитектуре, работать с базами данных и использовать систему версионного контроля GIT.<\/p>",
      "company": "Трайв Технолоджис",
      "location": "",
      "id": 9033,
      "category": "qa",
      "conditions_details": "<ul><li>Заработная плата: 150-250 т.р.<\/li><li>Аккредитованная IT-компания<\/li><li>Возможность работать удалённо<\/li><li>Курсы английского языка за счёт компании<\/li><li>Опытная команда разработки, авторитетные лиды и опытные наставники<\/li><li>Профессиональное развитие и рост<\/li><li>Заботливые, комфортные, максимально дружелюбные отношения в компании<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете высшее образование, желательно техническое или математическое<\/li><li>Имеете опыт работы в тестировании ПО более 5 лет (iOS, Android, Web, Backend)<\/li><li>Имеете опыт в автоматизации тестирования от 3 лет<\/li><li>Имеете опыт мануального тестирования на одном из последних проектов<\/li><li>Имеете опыт в автоматизации тестирования с использованием Python или Java, Selenide, Selenium, RestAssured, Appium и т. д.<\/li><li>Имеете опыт тестирования систем на микросервисной архитектуре от 3 лет<\/li><li>Имеете опыт работы с базами данных от 3 лет<\/li><li>Имеете практический опыт применения практик тест-дизайна<\/li><li>Умеете проектировать тест-кейсы и подготавливать тестовые данные<\/li><li>Имеете опыт тестирования REST API (ручное и автоматизированное)<\/li><li>Имеете опыт работы с системой версионного контроля GIT (бранчи, пулл-реквесты и т.д.)<\/li><li>Имеете опыт работы с системами CI<\/li><li>Умеете использовать тестовые инструменты (Swagger, Postman, Fiddler/Charles, DevTools)<\/li><li>Умеете читать и анализировать логи<\/li><li>Очень желателен опыт в нагрузочном тестировании<\/li><\/ul>",
      "views": 29
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125659438",
      "created_at": "Tue, 23 Sep 2025 12:23:20 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon4.webp",
      "salary": "до 250 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>DCloud — это сообщество разработчиков, которое существует более 10 лет. Его основали профессионалы из крупных IT-компаний, таких как Epam, Luxoft и Accenture. Компания занимается разработкой проектов с нуля и сотрудничает с большими корпорациями и стартапами.<\/p><p>Вы будете тестировать системы с микросервисной архитектурой. Вам предстоит заниматься авто- и ручным тестированием (70% на 30%) фронтенда, бэкенда, API и запросов к базе данных. Нужно будет самостоятельно писать ручные тесты, а затем автоматизировать их. Также вы будете запускать автотесты и анализировать результаты их выполнения.<\/p>",
      "company": "DCloud",
      "location": "",
      "id": 9024,
      "category": "qa",
      "conditions_details": "<ul><li>График работы 5/2 с 9 до 18 или с 10 до 19 по московскому времени, возможно гибкое начало дня<\/li><li>Удалённая работа по всей территории РФ<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы от 3 до 6 лет<\/li><li>Понимаете методологии разработки ПО<\/li><li>Понимаете клиент-серверную архитектуру<\/li><li>Понимаете принципы работы компьютерных сетей и основных протоколов: HTTP(S), TCP/IP, UDP<\/li><li>Имеете опыт использования Git, BitBucket, Confluence<\/li><li>Имеете базовое понимание работы СУБД PostgreSQL<\/li><li>Знаете SQL<\/li><li>Будет плюсом: имеете опыт автоматизации тестирования на Java от 1 года, умеете проектировать тест-кейсы и готовить тестовые данные, имеете опыт работы с SOAP, REST, SQL, знаете ООП и паттерны разработки автотестов, имеете опыт интеграции автотестов в CI/CD-пайплайны, имеете опыт проведения нагрузочного тестирования и анализа результатов<\/li><\/ul>",
      "views": 28
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://career.habr.com/vacancies/1000162160",
      "created_at": "Tue, 23 Sep 2025 10:22:29 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/_20250908134258.webp",
      "salary": "~ от 179 200 ₽",
      "title": "Тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания \"Передовые Платежные Решения\" — крупный финтех-оператор, который уже более 20 лет работает на рынке России и СНГ. Она предлагает сервисы для бизнеса в разных сферах: управляет автопарками, организует деловые поездки и помогает с логистикой грузов.<\/p><p>Вы будете участвовать во всем процессе разработки новых функций, проводить ручное и автоматизированное тестирование веб-приложений. Вам нужно будет создавать и обновлять тестовую документацию, писать и поддерживать автотесты, а также развивать фреймворки. Кроме того, вы будете обучать других тестировщиков и проводить ревью их кода.<\/p>",
      "company": "ППР",
      "location": "",
      "id": 9003,
      "category": "qa",
      "conditions_details": "<ul><li>Формат работы на выбор: офис, гибрид или полностью удалённо (без привязки к стране)<\/li><li>Работа в аккредитованной IT-компании<\/li><li>Больничный лист без потери зарплаты до 14 дней и 3 дополнительных оплачиваемых дня отгула<\/li><li>ДМС со стоматологией, широким набором клиник и пакетом юридических и психологических консультаций после 3 месяцев работы<\/li><li>Корпоративное обучение: внутренние тренинги, воркшопы и финансирование внешнего обучения<\/li><li>Гибкая система льгот: после 3 месяцев работы можно выбрать дополнительные льготы (спорт, обучение, путешествия и др.)<\/li><li>Корпоративная мобильная связь<\/li><li>Развитая корпоративная культура: праздники, подарки на памятные даты<\/li><li>Работа в команде профессионалов и возможности для карьерного роста<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт ручного и автоматизированного тестирования веб-приложений от 3 лет, включая от 2 лет в ручном тестировании и от 1 года в автоматизации<\/li><li>Умеете проводить ручное тестирование, составлять тестовую документацию и анализировать требования<\/li><li>Понимаете клиент-серверную архитектуру приложений<\/li><li>Знаете SQL на уровне простых запросов<\/li><li>Имеете опыт работы с DevTools, Swagger, Postman<\/li><li>Имеете опыт работы с *nix системами и знаете базовые bash команды<\/li><li>Уверенно знаете Java Core<\/li><li>Имеете практический опыт в разработке автотестов с использованием JUnit, Selenide, RestAssured<\/li><li>Имеете опыт работы с TMS и системами таск-трекинга<\/li><li>Проявляете проактивность, инициативность и желание работать в команде<\/li><li>Будет плюсом опыт написания проектной и пользовательской документации, а также понимание и умение создавать Mock-сервисы<\/li><\/ul>",
      "views": 35
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125647237",
      "created_at": "Tue, 23 Sep 2025 09:49:07 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon3.webp",
      "salary": "~ от 198 700 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Hotellab.io — это международная компания, которая разрабатывает сервис для увеличения доходов отелей. Сервис использует технологии Revenue Management, аналитику и цифровой маркетинг. Сейчас у компании более 250 отелей в России, СНГ и Европе.<\/p><p>В связи с расширением, компания ищет в команду Middle QA Engineer. Вам предстоит разрабатывать и выполнять тестовые сценарии, проводить регрессионное, функциональное и интеграционное тестирование. Также нужно будет участвовать в проектировании фич, помогать формулировать corner cases до разработки, верифицировать работу с данными (Kafka, Avro, Clickhouse, PostgreSQL, MinIO, S3 connectors) и тестировать микросервисную архитектуру (Python, Go, FastAPI, gRPC, Kubernetes). Вам нужно будет поддерживать тестовую документацию (test cases, checklists, баг-репорты), настраивать и развивать автотесты (API/UI, нагрузочные тесты), а также взаимодействовать с командой разработки, первой линией поддержки и системным аналитиком для повышения стабильности продукта.<\/p>",
      "company": "hotellab.io",
      "location": "",
      "id": 8977,
      "category": "qa",
      "conditions_details": "<ul><li>Удалённый формат работы<\/li><li>Официальное трудоустройство в аккредитованную ИТ-компанию, резидента ОЭЗ Иннополис<\/li><li>Испытательный срок 3 месяца<\/li><li>Гибкий график, обязательные командные митинги<\/li><li>Влияние на архитектуру и качество продукта<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы QA от 2 лет<\/li><li>Имеете опыт тестирования веб-сервисов и API (REST/gRPC, Postman, Pytest)<\/li><li>Понимаете работу реляционных и аналитических БД (PostgreSQL, Clickhouse, Trino) — будет плюсом<\/li><li>Имеете опыт работы с Docker/Kubernetes на уровне запуска окружений для тестов<\/li><li>Знаете инструменты для логирования и мониторинга (Grafana, Prometheus, Loki)<\/li><li>Умеете работать с системами трекинга задач (YouTrack, Jira)<\/li><li>Умеете писать автотесты на Python (pytest, requests/httpx, allure)<\/li><li>Имеете опыт тестирования систем с Kafka/Avro/streaming — будет плюсом<\/li><li>Знаете особенности highload-систем — будет плюсом<\/li><li>Имеете опыт выстраивания QA-процессов с нуля — будет плюсом<\/li><li>Имеете опыт работы с CI/CD пайплайнами — будет плюсом<\/li><\/ul>",
      "views": 42
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125637066",
      "created_at": "Tue, 23 Sep 2025 06:39:14 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/_20250908134258.webp",
      "salary": "~ от 256 700 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания «Передовые Платежные Решения» занимается поддержкой и доработкой Личного кабинета для клиентов. Этот веб-сервис работает с базами данных Oracle, использует Java и Spring Boot, а для клиентов отображается через Vue/Angular. В компании активно используют Jira для задач, Gitlab для разработки, Kubernetes для развертывания приложений и обладают всеми необходимыми компетенциями для быстрой и качественной работы. В команде уже есть бэкенд и фронтенд разработчики, дизайнер, системный аналитик, деливери менеджер и два тестировщика.<\/p><p>Вы будете участвовать в полном цикле разработки нового функционала. Вам предстоит проводить ручное и автоматизированное тестирование веб-приложений, разрабатывать и поддерживать тестовую документацию в актуальном состоянии, а также писать и поддерживать автотесты, развивая при этом фреймворки. Кроме того, вы будете обучать других тестировщиков и проводить ревью их кода.<\/p>",
      "company": "ППР",
      "location": "",
      "id": 8962,
      "category": "qa",
      "conditions_details": "<ul><li>Формат работы на выбор: офис, гибрид или полностью удалённо (без привязки к стране)<\/li><li>Работа в аккредитованной IT-компании<\/li><li>Больничный лист без потери зарплаты до 14 дней и 3 дополнительных оплачиваемых дня отгула<\/li><li>ДМС со стоматологией, широким набором клиник и пакетом юридических и психологических консультаций после 3 месяцев работы<\/li><li>Корпоративное обучение, включая внутренние тренинги, воркшопы и финансирование внешнего обучения<\/li><li>Гибкая система льгот после 3 месяцев работы с возможностью выбора дополнительных льгот (спорт, обучение, путешествия и т.д.)<\/li><li>Корпоративная мобильная связь<\/li><li>Развитая корпоративная культура с праздниками и подарками на памятные даты<\/li><li>Работа в команде профессионалов с отличными возможностями для карьерного роста<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт проведения ручного и автоматизированного тестирования веб-приложений от 3 лет, включая от 2 лет в ручном тестировании и от 1 года в автоматизации<\/li><li>Умеете уверенно проводить ручное тестирование, формировать тестовую документацию и анализировать требования<\/li><li>Понимаете клиент-серверную архитектуру приложений<\/li><li>Знаете SQL на уровне простых запросов<\/li><li>Имеете опыт работы с DevTools, Swagger, Postman<\/li><li>Имеете опыт работы с *nix системами и знаете базовые bash команды<\/li><li>Уверенно знаете Java Core<\/li><li>Имеете практический опыт в разработке автотестов с использованием JUnit, Selenide, RestAssured<\/li><li>Имеете опыт работы с TMS и системами таск-трекинга<\/li><li>Проявляете проактивность, инициативность, умеете и хотите работать в команде<\/li><li>Будет плюсом: имеете опыт написания проектной и пользовательской документации, опыт работы с БД Oracle, понимаете и умеете создавать Mock-сервисы<\/li><\/ul>",
      "views": 41
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://job.2gis.ru/test/74922/",
      "created_at": "Tue, 23 Sep 2025 05:56:28 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/2_20250322230558.svg",
      "salary": "~ от 267 800 ₽",
      "title": "qa engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Команда Casino занимается развитием рекламного направления в 2ГИС. Компания создает новые рекламные форматы и улучшает стратегию их продвижения. Разрабатываются высоконагруженные сервисы для показа рекламы, агрегируются данные из CRM и ERP систем, обрабатываются фиды заказчиков, регистрируются рекламные креативы и показываются пользователям.<\/p><p>Вы будете оценивать трудоемкость, анализировать требования и планировать тестирование. Вам нужно будет создавать тестовые артефакты, писать тесты для API и end-to-end, а также участвовать в релизах функционала и его поддержке. Также предстоит работать над задачами в роли ГФК, описывать работу существующих сервисов, оптимизировать ручное тестирование, масштабировать автоматизацию и внедрять метрики качества.<\/p>",
      "company": "2ГИС",
      "location": "",
      "id": 8960,
      "category": "qa",
      "conditions_details": "<ul><li>Можно работать удалённо<\/li><li>Гибкий график работы<\/li><li>Полностью белая зарплата, размер обсуждается на собеседовании<\/li><li>ДМС, штатный терапевт, невролог, мед. консультант и другие IT-плюшки<\/li><li>Помощь с выступлениями на конференциях и статьями для Хабра<\/li><li>Внутренние хакатоны, фестивали и митапы<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в сфере тестирования от 4 лет<\/li><li>Понимаете основы тестирования ПО, включая виды тестирования, техники тест-дизайна и критерии качества<\/li><li>Имеете опыт анализа требований и выявления потенциальных проблем на ранних этапах разработки<\/li><li>Имеете опыт ручного тестирования, включая исследовательское тестирование, регрессионное и работу с edge-кейсами<\/li><li>Имеете опыт автоматизации тестирования от 2 лет на любом высокоуровневом языке программирования<\/li><li>Имеете опыт тестирования API (REST или SOAP)<\/li><li>Понимаете CI/CD процессы и умеете интегрировать тесты в пайплайн<\/li><li>Понимаете контейнеризацию (Docker) и умеете работать с контейнеризированными окружениями<\/li><li>Имеете хорошие коммуникативные навыки, умеете доносить важные замечания и взаимодействовать с командой<\/li><li>Будет плюсом: опыт работы с Python<\/li><\/ul>",
      "views": 43
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125634427",
      "created_at": "Tue, 23 Sep 2025 05:49:04 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon3.webp",
      "salary": "~ от 251 200 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>INDEEPA — это компания, которая занимается динамическим ценообразованием на маркетплейсах. Она помогает бизнесам управлять ценами на большое количество товаров автоматически, используя свою аналитическую систему и инструменты для сбора и обработки данных. Компания является резидентом Сколково и имеет аккредитацию в Минцифры.<\/p><p>Вам предстоит заниматься разработкой и поддержкой автоматизированных тестов для API. Нужно будет создавать надежные и эффективные тестовые решения, участвовать в настройке процессов автоматизированного тестирования и следить за качеством продукта на всех этапах разработки.<\/p>",
      "company": "Нью ривер",
      "location": "",
      "id": 8953,
      "category": "qa",
      "conditions_details": "<ul><li>Стабильная компания с передовыми технологиями<\/li><li>Конкурентоспособная зарплата<\/li><li>Перспективы карьерного роста<\/li><li>Интересные проекты<\/li><li>Обучение и развитие<\/li><li>Свободный выбор места работы: офис, удаленка или гибрид<\/li><li>В здании есть спортзал<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт автоматизации тестирования от 3 лет, а для Senior-позиции — от 5 лет<\/li><li>Умеете писать автотесты API на C#, Python или JS<\/li><li>Имеете опыт работы с SpecFlow/Reqnroll или похожими инструментами<\/li><li>Умеете проектировать тест-стратегии<\/li><li>Понимаете принципы CI/CD<\/li><li>Имеете базовые знания SQL<\/li><li>Имеете опыт проведения нагрузочного тестирования с использованием JMeter, k6 или Gatling<\/li><li>Знаете принципы работы с системами контроля версий, такими как Git<\/li><li>Умеете анализировать логи (ELK, Grafana, Splunk) — будет плюсом<\/li><li>Имеете опыт UI-автоматизации (Selenium/Playwright/Cypress) — будет плюсом<\/li><li>Знаете Docker/Kubernetes — будет плюсом<\/li><li>Имеете опыт работы с Message Brokers (Kafka, RabbitMQ) — будет плюсом<\/li><li>Имеете сертификаты ISTQB, AWS/GCP или другие — будет плюсом<\/li><li>Имеете опыт менторинга junior/middle QA — будет плюсом<\/li><li>Умеете оптимизировать скорость выполнения тестов — будет плюсом<\/li><li>Для Senior-уровня: участвуете в принятии архитектурных решений — будет плюсом<\/li><li>Для Senior-уровня: менторите junior/middle QA специалистов — будет плюсом<\/li><li>Для Senior-уровня: оптимизируете скорость выполнения тестов — будет плюсом<\/li><li>Для Senior-уровня: имеете опыт работы со стабами и моками — будет плюсом<\/li><\/ul>",
      "views": 36
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125615575",
      "created_at": "Mon, 22 Sep 2025 12:51:08 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon4.webp",
      "salary": "от 230 000 ₽",
      "title": "Тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания АБП занимается развитием и поддержкой API-сервисов. Проект рассчитан на срок от 6 месяцев.<\/p><p>Вам предстоит проводить функциональные и регресс-тесты нового функционала и сторонних API, автоматизировать API и UI тесты. Примерное соотношение функционального и автотестирования составит 30/70. Вам нужно будет писать понятную тестовую документацию, помогать команде формировать стратегию тестирования и участвовать в определении пирамиды тестирования, применяя знания из теории тестирования и понимая основные технологии стека. Также потребуется участвовать в ревью постановок системных аналитиков или макетов от дизайнеров, помогать принимать решения в неоднозначных ситуациях и участвовать в демонстрациях нового функционала для бизнеса и пользователей. Вам нужно будет управлять тестированием в TestOps/Testit/TestRail, разбираться в инцидентах на промышленной среде, находить их первопричину, взаимодействовать с разными командами и доводить дело до устранения, работая с kibana/SQL при разборе логов. Нужно быть проактивным, стремиться развивать продукты и улучшать процессы.<\/p>",
      "company": "АБП",
      "location": "",
      "id": 8899,
      "category": "qa",
      "conditions_details": "<ul><li>Зарплата от 230 000 ₽ в месяц на руки<\/li><li>Выплаты раз в месяц<\/li><li>Полная занятость<\/li><li>График работы 5/2<\/li><li>Рабочие часы 8 часов в день<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы более 6 лет<\/li><li>Знаете язык программирования Java 21<\/li><li>Владеете фреймворками для тестирования JUnit 5, AssertJ, Hamcrest<\/li><li>Понимаете Spring Framework для организации тестовых проектов и интеграции зависимостей<\/li><li>Умеете работать с системой управления зависимостями Maven<\/li><li>Знаете SL4J для логирования<\/li><li>Владеете Allure для отчетности<\/li><li>Понимаете принципы интеграции с CI/CD через GitLab CI<\/li><li>Имеете опыт работы с Docker<\/li><li>Знаете REST-клиент RestAssured для тестирования API<\/li><li>Умеете работать с mock-сервером WireMock<\/li><li>Владеете Jackson для работы с JSON<\/li><li>Имеете опыт работы с инструментами для UI-тестов Selenium WebDriver, Selenide<\/li><li>Понимаете принципы удаленного запуска веб драйвера через Moon<\/li><li>Умеете работать с DB JDBC для тестирования баз данных (PostgreSQL, Oracle)<\/li><li>Будет плюсом: глубокие знания принципов работы HTTP (заголовки, коды ответов, методы, особенности кеширования), понимание и опыт работы с различными типами аутентификации и авторизации (Basic, OAuth2, JWT, SSO и др), опыт работы с брокерами сообщений (например, Apache Kafka) и тестированием асинхронных процессов, понимание принципов работы Redis (использование в качестве кэша, хранилища сессий и брокера)<\/li><\/ul>",
      "views": 38
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125612270",
      "created_at": "Mon, 22 Sep 2025 12:50:05 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/Digital_20250521112527.webp",
      "salary": "~ от 250 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>БКС Мир инвестиций — это финансовый холдинг с 30-летней историей, который предлагает клиентам широкий спектр брокерских, инвестиционных и банковских услуг. Компания помогает клиентам достигать финансовых целей и имеет сильную ИТ-экспертизу, что подтверждается наградами. БКС Финтех, ИТ-компания холдинга, является резидентом «Сколково» и аккредитована Минцифры России. Работа ведется в кросс-платформенных командах по Scrum, с полным циклом разработки фичей, где QA участвует на всех этапах. Есть внутреннее QA-комьюнити для обсуждения задач и решения проблем, а также проводятся воркшопы по тестированию.<\/p><p>Вы будете разрабатывать новые и поддерживать существующие автотесты. Вам нужно будет проводить приёмочные испытания при выпуске релизов. Также предстоит взаимодействовать с аналитиками, разработчиками, дизайнерами и руководителями проекта по вопросам требований.<\/p>",
      "company": "БКС Digital",
      "location": "",
      "id": 8898,
      "category": "qa",
      "conditions_details": "<ul><li>Конкурентный доход<\/li><li>Удаленный режим работы<\/li><li>Работа в аккредитованной Минцифры России ИТ-компании, резиденте «Сколково»<\/li><li>Работа в компании — лидере инвестиционного рынка<\/li><li>Современный стек технологий, амбициозные проекты<\/li><li>Возможность карьерного роста<\/li><li>Расширенная программа ДМС с первой недели работы (включая стоматологию, страхование жизни, психолога, телемедицину и возможность подключения родственников)<\/li><li>Скидки на фитнес-клубы и спортивные сообщества<\/li><li>Тренинги и программа «БКС Среда»<\/li><li>Насыщенная корпоративная жизнь (праздники, тимбилдинги, выезды)<\/li><li>Мероприятия для детей сотрудников<\/li><li>Льготные условия банковского обслуживания и корпоративные скидки BestBenefits<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы автоматизатором от 3 лет<\/li><li>Умеете писать с нуля тестовый проект на JUnit 5<\/li><li>Понимаете бэкенд: REST, WebSocket, gRPC, kafka, redis, postgresql<\/li><li>Имеете достаточно глубокое понимание Java: паттерны (кроме Page Object, на уровне практического применения), интерфейсы, абстрактные классы, концепция DDT, ParametrizedTest, асинхронность<\/li><li>Умеете работать с Docker на уровне Java<\/li><li>Владеете gradle<\/li><li>Имеете опыт работы с приложениями на Spring<\/li><li>Умеете локально поднимать приложения<\/li><\/ul>",
      "views": 46
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125607537",
      "created_at": "Mon, 22 Sep 2025 11:30:44 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon3.webp",
      "salary": "от 200 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания Пума Биллинг занимается разработкой программного обеспечения. Вы будете анализировать требования к продуктам, чтобы обеспечить их высокое качество. Вам предстоит создавать и поддерживать автоматизированные тесты, а также исследовательские сценарии. Если вы найдете ошибки, то будете их описывать и отслеживать в системе учета. Вы будете сообщать о найденных функциях и ошибках всем заинтересованным лицам. Работая в команде Scrum, вы будете уточнять бизнес-требования, давать свои комментарии и предлагать улучшения для процессов и качества ПО.<\/p>",
      "company": "Пума Биллинг",
      "location": "",
      "id": 8883,
      "category": "qa",
      "conditions_details": "<ul><li>Интересные и амбициозные задачи в динамично развивающейся международной компании<\/li><li>График работы гибридный, с редкими встречами с командой в офисе в Москве<\/li><li>Возможность работать над современными интеграционными проектами<\/li><li>Сотрудничество с командой профессионалов<\/li><li>Конкурентоспособная заработная плата и социальный пакет<\/li><li>Возможности для профессионального роста и развития<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в тестировании ПО не менее 2 лет<\/li><li>Знаете и имеете опыт работы с объектно-ориентированными языками, скриптами, шаблонами проектирования и фреймворками автоматизации тестирования<\/li><li>Имеете опыт проведения производительного тестирования с использованием Gatling или аналогичных инструментов<\/li><li>Умеете работать с Git и такими инструментами, как TestRail, Selenium, JUnit, TestNG и другими<\/li><li>Имеете опыт работы с GitLab CI/CD pipelines<\/li><li>Проявляете интерес к практикам CI/CD, имеете опыт работы с Jenkins<\/li><li>Имеете аналитический склад ума, желание рассматривать вопросы в целом и решать проблемы<\/li><li>Отлично владеете английским языком<\/li><li>Имеете опыт тестирования API/RESTful веб-сервисов<\/li><li>Имеете опыт работы с базами данных — Oracle DB, PostgreSQL и другими<\/li><li>Знание Java будет плюсом<\/li><li>Опыт работы в телекоммуникационной сфере является плюсом<\/li><li>Проявляете ответственность, внимательность к деталям, умеете расставлять приоритеты и эффективно справляться с многозадачностью<\/li><li>Являетесь мотивированным командным игроком, заинтересованным в обмене знаниями и профессиональном росте<\/li><\/ul>",
      "views": 40
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125605612",
      "created_at": "Mon, 22 Sep 2025 10:52:28 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/_20250922105228.webp",
      "salary": "~ от 193 400 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>ООО «Ньютон Технологии» – это продуктовая IT-компания, которая создает приложение «Газпромбанк Инвестиции». Компания помогает людям с разным уровнем дохода начать инвестировать в ценные бумаги, которые торгуются на Московской и СПБ Биржах. Платформа компании – это распределенная система с высокими требованиями к надежности и производительности, работающая в условиях больших нагрузок. В компании используется микросервисная архитектура без устаревшего кода, применяются современные решения в разработке.<\/p><p>Вам предстоит тестировать мобильное и веб-приложение, а также API, используя ручное тестирование. Нужно будет разрабатывать, поддерживать и запускать автотесты для UI и API, а также тестировать интеграционную шину. Вам нужно будет проводить регулярное регресс- и смоук-тестирование релизов, в том числе с помощью автоматизированных сценариев. Также вы будете участвовать в проектах, проводить ревью технических заданий на этапе анализа, оценивать задачи на тестирование и автоматизацию. Вам нужно будет участвовать в настройке тестовых данных и стендов для тестирования, писать тестовую документацию (чек-листы, тест-кейсы, тест-планы) и анализировать результаты прогонов автотестов.<\/p>",
      "company": "Ньютон Технологии",
      "location": "",
      "id": 8870,
      "category": "qa",
      "conditions_details": "<ul><li>Возможность расти от ручного тестирования до полноценного full-stack специалиста с уклоном в автоматизацию<\/li><li>Обучение и наставничество: компания готова инвестировать в развитие и научить всему, что знает сама, при наличии сильной мотивации и базы<\/li><li>Интересные и сложные задачи в сфере финансовых технологий, участие в динамичном и амбициозном финтех-проекте<\/li><li>Демократичная атмосфера, отсутствие бюрократии<\/li><li>Оформление по ТК РФ<\/li><li>Полностью удаленная работа<\/li><li>Предоставление корпоративной техники<\/li><li>ДМС с базовой стоматологией<\/li><li>Внутреннее и внешнее обучение, возможность участия в профильных конференциях<\/li><li>На выбор: изучение иностранного языка, занятия фитнесом или индивидуальный бенефит<\/li><li>Оплачиваемые Days off и Sick days для перезагрузки и быстрого выздоровления<\/li><li>Доставка фруктов от компании в случае болезни<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы на позиции QA от 3 лет<\/li><li>Знаете теорию тестирования<\/li><li>Умеете составлять тестовую документацию<\/li><li>Умеете анализировать бизнес и функциональные требования<\/li><li>Имеете опыт ручного тестирования WEB и нативных мобильных приложений под iOS &amp; Android от 2 лет<\/li><li>Имеете опыт тестирования backend (API, логи, БД)<\/li><li>Имеете опыт работы с непрерывным деплоем задач (CI/CD)<\/li><li>Имеете опыт и желание развиваться в направлении автоматизированного тестирования<\/li><li>Имеете опыт работы с API (REST) - Postman, Swagger - от 1 года, знаете основные CRUD операции, умеете писать скрипты для облегчения запросов<\/li><li>Имеете опыт работы с системами таск-менеджмента (Jira) и тест-менеджмента (TestIT)<\/li><li>Имеете навыки работы с базами данных и составления SQL-запросов (PostgreSQL) - от 1 года, умеете обновлять данные, писать комплексные запросы<\/li><li>Понимаете жизненный цикл ПО<\/li><li>Имеете опыт работы по Agile-методологиям (Scrum, Kanban)<\/li><li>Имеете навыки чтения логов и нахождения причины ошибок (Redash, Kibana) - от 1 года, понимаете уровни логирования<\/li><li>Имеете опыт работы с Jenkins<\/li><li>Умеете расставлять приоритеты и эффективно планировать рабочее время<\/li><li>Умеете грамотно излагать свои мысли, задавать вопросы и отстаивать свое мнение<\/li><li>Умеете работать в команде<\/li><li>Будет огромным плюсом: имеете базовые знания Java (или сильное желание быстро изучить)<\/li><li>Будет огромным плюсом: имеете опыт или знакомство с фреймворками для автоматизации тестирования: Selenide / Selenium WebDriver для UI-тестов и RestAssured для API-тестов<\/li><li>Будет огромным плюсом: знаете и понимаете принципы работы JUnit 5, TestNG<\/li><li>Будет огромным плюсом: имеете опыт работы со сборщиком проектов Maven / Gradle<\/li><li>Будет огромным плюсом: понимаете принципы Page Object Model (POM) и других паттернов проектирования в автотестах<\/li><li>Будет огромным плюсом: умеете работать с системой контроля версий Git (GitLab)<\/li><li>Будет огромным плюсом: имеете опыт работы с IDE (IntelliJ IDEA)<\/li><li>Будет огромным плюсом: имеете базовое понимание архитектуры автоматизированных тестов и CI/CD процесса для их интеграции<\/li><li>Также плюсом будет: понимание фондового рынка (проявление интереса)<\/li><li>Также плюсом будет: имеете практический опыт инвестирования на фондовом рынке<\/li><li>Также плюсом будет: знаете системы QORT и QUIK<\/li><li>Также плюсом будет: имеете опыт работы без документации<\/li><\/ul>",
      "views": 48
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125601034",
      "created_at": "Mon, 22 Sep 2025 09:56:38 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/_20250922095545.webp",
      "salary": "~ от 224 300 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания Холдем — это международная IT-компания с аккредитацией в РФ. Она создает мобильные приложения для общения, создания контента и установления связей между людьми по всему миру. Эти приложения отличаются высокой технологической нагруженностью.<\/p><p>Вы будете заниматься развитием тестового фреймворка на Python и создавать инструменты для автоматизации тестирования. Вам нужно будет писать автотесты на Python для тестирования платежных микросервисов компании, которые будут масштабируемыми и легко поддерживаемыми. Также вы будете проявлять инициативу по улучшению автотестов, тестовых данных и инфраструктуры, а еще поддерживать тестовую документацию в актуальном состоянии.<\/p>",
      "company": "Холдем",
      "location": "",
      "id": 8854,
      "category": "qa",
      "conditions_details": "<ul><li>Опционная система поощрения после прохождения испытательного срока<\/li><li>Полностью удаленная работа из любой точки мира<\/li><li>Предоставляется мощное корпоративное железо<\/li><li>Возможность работать с современными web3 технологиями<\/li><li>Здоровая корпоративная культура<\/li><li>Развитая система адаптации и онбординга новых сотрудников<\/li><li>Регулярные неформальные встречи и корпоративы<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в тестировании от 3 лет<\/li><li>Знаете Python и SQL на уровне middle-разработчиков или выше<\/li><li>Умеете проводить автоматизированное тестирование веб-приложений на Python<\/li><li>Имеете опыт автоматизированного тестирования (API, интеграционное, нагрузочное)<\/li><li>Владеете технологиями: Python, Postgres, Allure, AWS<\/li><\/ul>",
      "views": 44
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125594556",
      "created_at": "Mon, 22 Sep 2025 08:26:07 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon4.webp",
      "salary": "от 60 000 ₽",
      "title": "Тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания Лодка занимается разработкой продуктов в сфере Web3 и геймификации. Она создает игровые механики и инструменты для взаимодействия с блокчейн-технологиями.<\/p><p>Вы будете заниматься ручным и автоматизированным тестированием ролей, реферальной системы и достижений. Вам нужно будет проверять бизнес-логику токена, включая фарминг, сжигание, аренду и начисления USDT. Также предстоит автоматизировать end-to-end сценарии с использованием Playwright, тестировать кросс-сетевые операции на BSC и Polygon, а также безопасность транзакций. Для работы потребуется использовать блокчейн-эксплореры, Metamask и DevTools.<\/p>",
      "company": "Лодка",
      "location": "",
      "id": 8825,
      "category": "qa",
      "conditions_details": "<ul><li>Удаленная работа<\/li><li>Гибкий график работы с синхронизацией по продуктам и спискам стендапов<\/li><li>Полная занятость<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт тестирования Web3/Frontend + API от 1.5 лет<\/li><li>Умеете работать с Playwright на JavaScript/TypeScript<\/li><li>Понимаете Web3-стек: транзакции, газ, EVM<\/li><li>Владеете навыками тестирования крайних случаев, таких как просроченная аренда или некорректные сценарии сжигания<\/li><li>Будет плюсом опыт тестирования геймификационных систем и знание CI/CD (GitHub Actions)<\/li><\/ul>",
      "views": 35
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125592068",
      "created_at": "Mon, 22 Sep 2025 08:24:38 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon2.webp",
      "salary": "~ от 192 300 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>\"РСХБ-Интех\" — российская ИТ-компания, которая занимается разработкой, внедрением и поддержкой программного обеспечения для Россельхозбанка. Компания создает новые digital-продукты, чтобы сделать экосистему нового поколения и улучшить взаимодействие пользователей с банком, сделав его понятным и удобным.<\/p><p>Вы будете участвовать в больших и инновационных проектах. Вам предстоит разрабатывать тест-кейсы по бизнес-требованиям, пользовательской документации и описанию дефектов. Нужно будет тестировать новый функционал, разрабатывать и актуализировать автотесты на Java, а также анализировать результаты их прохождения. Вам предстоит проводить интеграционное, функциональное, компонентное и регрессионное тестирование, тестировать API и UI, регистрировать, локализовывать и классифицировать дефекты. Также вы будете контролировать и актуализировать тестовые среды, взаимодействовать с членами команды и смежными подразделениями.<\/p>",
      "company": "РСХБ-Интех",
      "location": "",
      "id": 8822,
      "category": "qa",
      "conditions_details": "<ul><li>Программа реферального рекрутинга с выплатой бонусов за приведенного друга<\/li><li>Оплата обучения и переквалификации<\/li><li>Участие в профильных конференциях<\/li><li>Материальная поддержка в различных жизненных ситуациях<\/li><li>ДМС, включая стоматологию и психологическую поддержку<\/li><li>Комфортный офис рядом с метро Тёплый стан с бесплатной парковкой, столовой, спортзалом и медицинским кабинетом<\/li><li>Возможность выбора времени начала и окончания работы, а также гибридного графика (офис/удаленка)<\/li><li>Предоставление корпоративной техники сотрудникам<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт разработки тест-кейсов по бизнес-требованиям, пользовательской документации и описанию дефектов<\/li><li>Имеете опыт тестирования банковских или финансовых систем<\/li><li>Имеете опыт интеграционного тестирования<\/li><li>Понимаете принципы REST и имеете опыт тестирования API<\/li><li>Имеете опыт тестирования UI<\/li><li>Умеете писать автотесты на Java, опыт от 2 лет<\/li><li>Имеете опыт работы с RestAssured и Hibernate<\/li><li>Имеете опыт работы с Selenium/Selenide<\/li><li>Имеете опыт работы с базами данных<\/li><li>Имеете опыт работы с очередями<\/li><li>Имеете опыт работы с Git<\/li><li>Имеете опыт работы с CI/CD<\/li><li>Понимаете различные методологии разработки ПО<\/li><li>Имеете опыт работы с OS Windows, Linux, системами учета дефектов<\/li><li>Будет плюсом понимание основ инвестиционного бизнеса, Postgres, Kafka, Lotus Notes, Confluence, Jira<\/li><\/ul>",
      "views": 46
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://t.me/BubenTatiana",
      "created_at": "Mon, 22 Sep 2025 08:18:17 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon2.webp",
      "salary": "до 350 000 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания занимается ускорением доставки продукта, автоматизируя процессы обеспечения качества.<\/p><p>Вы будете автоматизировать процессы тестирования и разработки, а также автоматизировать сбор статистики и составление отчетов по результатам запуска автотестов. Вам предстоит разрабатывать QA-инструменты для команды тестирования и поддерживать окружение для запуска автотестов, например, Gitlab и K8s. Также вы будете привлекать функциональных тестировщиков к автоматизации регрессионных сценариев и участвовать в code review.<\/p>",
      "company": "Tiqum",
      "location": "",
      "id": 8814,
      "category": "qa",
      "conditions_details": "<ul><li>Предоставляется техника<\/li><li>Расширенный ДМС<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете от 3 лет коммерческого опыта в SDET<\/li><li>Имеете коммерческий опыт работы с фреймворками для тестирования<\/li><li>Умеете настраивать CI/CD<\/li><li>Умеете писать мок-сервисы<\/li><li>Умеете делать ревью автотестов<\/li><li>Владеете основным языком программирования Java/Kotlin<\/li><li>Знаете редкие языки программирования Python, C#/.NET, JavaScript<\/li><li>Имеете опыт работы в качестве автоматизатора тестирования/SDET от 3 лет<\/li><li>Имеете опыт автоматизации с использованием фреймворка TestNG или JUnit<\/li><li>Умеете работать с REST API, SOAP API, HTTP/HTTPS, gRPC, Avro<\/li><li>Знаете SQL: DML-, DDL-запросы, JOIN, группировки и агрегирующие функции<\/li><li>Имеете опыт использования систем сборки: Maven, Gradle и других<\/li><li>Имеете опыт настройки CI/CD с помощью TeamCity, Jenkins или GitLab<\/li><\/ul>",
      "views": 49
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125567842",
      "created_at": "Mon, 22 Sep 2025 05:00:32 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/Employcity_20250513050850.webp",
      "salary": "~ от 175 000 ₽",
      "title": "Тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Международная продуктовая IT компания занимается разработкой и поддержкой больших проектов для крупных клиентов, в основном это развлекательные онлайн-сервисы. Команда сейчас работает над FinTech решением с более чем миллионом пользователей в день, которое требует высокой надежности и масштабируемости.<\/p><p>Вы будете заниматься построением и развитием автоматизации тестирования для UI и API, а также test automation framework. Вам нужно будет участвовать в настройке CI/CD-процессов и взаимодействовать с командами разработчиков, аналитиков и DevOps.<\/p>",
      "company": "Employcity",
      "location": "",
      "id": 8801,
      "category": "qa",
      "conditions_details": "<ul><li>Компания готова оплачивать курсы для повышения квалификации и привлекать наставников<\/li><li>Отсутствие бюрократии и быстрое согласование вопросов<\/li><li>Оплачиваемые больничные и отпускные<\/li><li>ДМС после испытательного срока<\/li><li>Частичная компенсация расходов на английский язык или психолога<\/li><li>Компенсация занятий в спортзале<\/li><li>4 оплачиваемых выходных дня в год<\/li><li>Компания поддерживает сотрудников в важные периоды жизни<\/li><li>Новогодняя премия до одного оклада<\/li><li>Молодой коллектив, средний возраст сотрудников — 27 лет<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт в автоматизации от 2 лет<\/li><li>Имеете коммерческий опыт написания тестов на Playwright с использованием JS/TS<\/li><li>Имеете опыт автоматизации тестирования API<\/li><li>Понимаете принципы ООП и паттернов, которые используются в автотестировании<\/li><li>Понимаете, как работает клиент-серверная архитектура<\/li><li>Понимаете, что такое HTML, CSS Selectors, XPath<\/li><li>Понимаете принципы CI/CD<\/li><li>Будет плюсом: Имеете опыт работы с Gitlab CI<\/li><\/ul>",
      "views": 53
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125524728",
      "created_at": "Fri, 19 Sep 2025 09:37:46 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/Navio_20250505183947.webp",
      "salary": "~ от 256 000 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания Navio разрабатывает технологии для автономного вождения, которые подходят для разных видов транспорта, от легковых машин до грузовиков. В команде Navio работает более 800 специалистов, которые трудятся над тем, чтобы доставка грузов стала быстрее и эффективнее, а городской транспорт — безопаснее и комфортнее. Основное направление работы компании — создание универсальной автономной технологии, которая включает программное и аппаратное обеспечение, исследования и разработки, уникальные процессы тестирования и систему сервисов для обработки данных и управления автопарком.<\/p><p>Вам предстоит заниматься инструментами для поиска, просмотра и скачивания логов автономного программного обеспечения, а также инструментами для создания и запуска тестов в симуляторе. Вам нужно будет работать с инструментами разметки (2D, 3D) и системами управления ими. Также вы будете автоматизировать тестирование веб-сервисов (backend/frontend) для автономных транспортных средств, участвовать в предрелизном регрессе продуктов, поддерживать разработку тестовых сценариев, проектировать и поддерживать тестовую инфраструктуру, а также развертывать ПО для тестирования на рабочем месте.<\/p>",
      "company": "Navio",
      "location": "",
      "id": 8701,
      "category": "qa",
      "conditions_details": "<ul><li>Гибкий график работы<\/li><li>ДМС для сотрудников с первого дня и стоматология после испытательного срока<\/li><li>Корпоративные программы, включая субсидию на ипотеку и скидки от компаний-партнеров<\/li><li>Обучение и возможности развития, включая виртуальную школу, митапы, хакатоны и конференции<\/li><li>Просторный офис с социальной инфраструктурой, мягкими и коворкинг зонами<\/li><li>Компенсация питания и бесплатные напитки<\/li><li>Предоставление современной и производительной техники<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Понимаете принципы и методики тестирования<\/li><li>Имеете опыт работы с Jira, Confluence, а также опыт использования любой TMS<\/li><li>Знаете принципы работы протокола HTTP, Web API<\/li><li>Уверенно владеете Python, Request, PyTest<\/li><li>Имеете опыт выстраивания взаимодействий с CI/CD системами (GitLab, Docker)<\/li><\/ul>",
      "views": 62
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125524936",
      "created_at": "Fri, 19 Sep 2025 09:37:13 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon1.webp",
      "salary": "от 250 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания \"Синьор Софт\" — это IT-компания с опытом работы более 10 лет. Она занимается автоматизацией бизнес-процессов для крупных компаний из разных сфер, таких как авиация, нефтегазовая отрасль, машиностроение, финансы и торговля.<\/p><p>Вы будете заниматься обеспечением высокого качества продукта. Вам предстоит участвовать в разработке и поддержке тестовых сценариев и автотестов, а также развивать инструменты и фреймворки для тестирования.<\/p>",
      "company": "Синьор Софт",
      "location": "",
      "id": 8700,
      "category": "qa",
      "conditions_details": "<ul><li>Официальное трудоустройство (возможен формат ИП или СМЗ)<\/li><li>Полностью удалённый формат работы<\/li><li>Участие в значимых проектах с высокой социальной и бизнес-ценностью<\/li><li>Корпоративное обучение и доступ к услугам корпоративного психолога<\/li><li>Поддержка и стабильность от компании, работающей на рынке более 10 лет<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в тестировании от 3 лет<\/li><li>Понимаете теорию тестирования<\/li><li>Знаете техники тест-дизайна и умеете их применять<\/li><li>Умеете писать тестовую документацию (тест-кейсы, чек-листы)<\/li><li>Имеете опыт тестирования микросервисов с синхронными и асинхронными вызовами<\/li><li>Понимаете протокол HTTPS и знаете инструменты для работы с API (Postman, curl и т.д.)<\/li><li>Имеете опыт работы с API (REST)<\/li><li>Умеете анализировать логи и имеете опыт работы с инструментами для их анализа (Kibana и т.д.)<\/li><li>Умеете использовать отладочные прокси-серверы (Fiddler, Charles)<\/li><li>Имеете опыт работы с системами управления тестированием (Allure TestOps, Test IT и т.д.) и баг-трекерами (Jira, Redmine и т.д.)<\/li><li>Имеете опыт работы с тестовыми фреймворками<\/li><li>Имеете опыт разработки UI/API тестов на Python<\/li><li>Имеете опыт работы с Selenium WebDriver<\/li><li>Имеете опыт работы с базами данных на уровне выполнения простых запросов<\/li><li>Имеете опыт работы с Git<\/li><li>Имеете базовое понимание принципов работы CI/CD<\/li><li>Знаете язык автотестов: Python (full-stack тестирование)<\/li><li>Понимаете принципы ООП и умеете их применять на практике<\/li><li>Знаете паттерны проектирования и умеете их применять на практике<\/li><li>Имеете опыт проектирования и разработки тестового фреймворка<\/li><li>Имеете опыт проектирования и разработки тестовых инструментов<\/li><li>Имеете опыт составления планов тестирования (регрессионное, smoke и т.д.)<\/li><\/ul>",
      "views": 55
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125526087",
      "created_at": "Fri, 19 Sep 2025 09:36:59 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/OQTACORE_20250725212347.webp",
      "salary": "~ от 182 700 ₽",
      "title": "Тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>OQTACORE – это швейцарская IT-компания, которая занимается разработкой веб- и мобильных приложений, а также работает с технологиями web3 и блокчейн. Компания любит использовать современные технологии и браться за сложные задачи.<\/p><p>Вы будете заниматься тестированием веб-приложений, включая сервисы на базе блокчейн. Вам нужно будет анализировать требования заказчика, проводить различные виды тестирования, документировать найденные ошибки и составлять отчеты. Также вы будете участвовать в обсуждении задач с командой.<\/p>",
      "company": "OQTACORE",
      "location": "",
      "id": 8699,
      "category": "qa",
      "conditions_details": "<ul><li>Полностью удаленный формат работы<\/li><li>Гибкий график работы, но с необходимостью пересекаться по времени с командой в московском часовом поясе (GMT+3)<\/li><li>Участие в интересных западных проектах<\/li><li>Полностью оплачиваемые больничные и отпускные<\/li><li>Есть банк выходных дней, которые можно использовать по своему усмотрению<\/li><li>Четкие обязанности, прописанные в должностных инструкциях<\/li><li>Работа в профессиональной команде, готовой поддержать<\/li><li>Возможности для обучения и профессионального роста<\/li><li>Корпоративный доступ к ChatGPT, MidJourney, Cursor<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Знаете теорию тестирования, включая виды и методы тестирования, а также методы тест-дизайна<\/li><li>Понимаете, как устроена клиент-серверная архитектура<\/li><li>Имеете опыт создания тестовой документации<\/li><li>Имеете опыт тестирования веб-приложений<\/li><li>Имеете опыт тестирования API (REST, GraphQL)<\/li><li>Имеете опыт тестирования Web3 сервисов<\/li><li>Владеете основными инструментами тестирования, такими как DevTools, Postman, Charles или их аналогами<\/li><li>Знаете HTML/CSS<\/li><li>Умеете составлять базовые SQL-запросы<\/li><li>Имеете опыт работы с системами управления задачами, например Jira, или похожими<\/li><li>Имеете опыт работы с автотестами (playwright, selenium) будет большим преимуществом<\/li><\/ul>",
      "views": 56
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125521710",
      "created_at": "Fri, 19 Sep 2025 09:18:38 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon1.webp",
      "salary": "~ от 192 700 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания занимается разработкой инновационного программного обеспечения в сфере Fintech для международных проектов на рынках финансовых услуг. Создает решения для внедрения, трансформации и стратегического развития автоматизированных информационных систем и программных комплексов.<\/p><p>Вы будете заниматься планированием и подготовкой тестирования, писать тест-кейсы и чек-листы. Вам предстоит проводить ручное тестирование новых функций и исправлений ошибок, а также писать и поддерживать автотесты. Необходимо будет запускать автотесты, анализировать их результаты, проводить smoke и regression-тестирование. Также вы будете участвовать в командных встречах (daily, grooming, retro и др.) и улучшать тестовую документацию.<\/p>",
      "company": "FFG",
      "location": "",
      "id": 8688,
      "category": "qa",
      "conditions_details": "<ul><li>Работа в дружной команде профессионалов, наставничество от ведущих специалистов на этапе вхождения в проект<\/li><li>Динамичный и быстроразвивающийся бизнес, ресурсы и возможность сделать вместе выдающийся продукт на мировом рынке Азии, Латинской Америки, Европы и СНГ<\/li><li>Практика и развитие своих компетенций, обсуждение плана индивидуального развития каждого сотрудника<\/li><li>Удаленная работа<\/li><li>Официальное оформление в соответствии с ТК РФ<\/li><li>Конкурентная заработная плата и возможность масштабировать её в зависимости от выполняемых бизнес-задач<\/li><li>Стабильная оплата с учетом отражений всех выплат<\/li><li>Гибкое начало и окончание рабочего дня<\/li><li>ДМС (включая стоматологию) с первого рабочего дня<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете знание теории тестирования<\/li><li>Умеете писать тест-кейсы<\/li><li>Имеете опыт тестирования web и мобильных приложений<\/li><li>Владеете языком программирования Python (желательно)<\/li><li>Имеете опыт работы с Selenium, Appium, Locust (или аналогичным), Cucumber<\/li><li>Имеете опыт тестирования API с использованием Postman, Swagger<\/li><li>Имеете опыт работы с CI/CD (Jenkins, GitLab CI)<\/li><li>Имеете опыт работы с Git<\/li><li>Умеете работать с базами данных, знаете SQL на уровне написания запросов для проверки данных<\/li><li>Умеете работать с логами и дебагом, анализировать логи, понимать стек ошибок, работать с отладчиком<\/li><li>Владеете английским языком<\/li><\/ul>",
      "views": 66
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125520494",
      "created_at": "Fri, 19 Sep 2025 09:17:57 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon1.webp",
      "salary": "~ от 194 300 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Группа Компаний Орбита — это российская ИТ-компания, которая занимается разработкой цифровых решений для бизнеса. Компания работает в таких сферах, как государственный сектор, FinTech, HRTech, коммуникации и медиа, услуги, рынок недвижимости и travel. Уже более 6 лет компания разрабатывает собственные продукты и выполняет заказную разработку. Сейчас ГК Орбита ищет QA Fullstack на JAVA в команду крупного банка для работы над продуктом LLM_SpotLight — единой поисковой платформой на основе генеративного ИИ.<\/p><p>Вам предстоит заниматься тестированием веб-приложений и работать с Rest API. Нужно будет покрывать новые функции инструментами автотестирования на Java, проводить интеграционное тестирование и работать с CI/CD (Jenkins, GitlabCI). Также вам потребуется опыт работы с брокерами сообщений (Kafka, RabbitMQ, аналоги) и мок-сервисами (Wiremock или аналоги).<\/p>",
      "company": "ГК Орбита",
      "location": "",
      "id": 8687,
      "category": "qa",
      "conditions_details": "<ul><li>Работа из дома, из офиса в Екатеринбурге или оплачиваемого коворкинга<\/li><li>Белая зарплата всегда в рынке, оформление по ТК РФ<\/li><li>3 месяца плавного погружения под присмотром HR<\/li><li>ИТ-отсрочка и HR/юридические консультации 24/7<\/li><li>Прозрачные процессы и открытая коммуникация<\/li><li>Работа на мощном железе, фокус на доверии и результате<\/li><li>ДМС (забота о здоровье за счет компании)<\/li><li>Индивидуальный план обучения, конференции и митапы<\/li><li>Возможность выступлений на конференциях, митапах, написание статей<\/li><li>Ежеквартальное обновление корпоративных скидок<\/li><li>Вечеринки оффлайн и онлайн, мерч, конкурсы и челленджи<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт тестирования веб-приложений<\/li><li>Имеете опыт работы с Rest API<\/li><li>Умеете покрывать новые функциональности при помощи инструментов автотестирования (Java)<\/li><li>Имеете опыт работы с интеграционным тестированием<\/li><li>Имеете опыт работы с CI/CD (Jenkins, GitlabCI)<\/li><li>Имеете опыт работы с брокерами сообщений (Kafka, RabbitMQ, аналоги)<\/li><li>Имеете опыт работы с мок-сервисами (Wiremock или аналоги)<\/li><li>Имеете опыт работы с SQL/NoSQL БД на уровне сложных запросов и выгрузок (join, View etc.)<\/li><li>Умеете работать с инструментами: SOAP UI, Postman, Jira, Confluence, Git, IntelliJ IDEA, Bitbucket<\/li><li>Имеете опыт работы с системами на микросервисной архитектуре (Spring Cloud, Kubernetes, Openshift или аналоги) (Будет плюсом)<\/li><li>Имеете опыт работы с системами Cache (Redis, Hazelcast) (Будет плюсом)<\/li><\/ul>",
      "views": 53
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125517810",
      "created_at": "Fri, 19 Sep 2025 08:06:48 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/X5_Tech_20250506155343.webp",
      "salary": "~ от 241 300 ₽",
      "title": "Тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>X5 Tech — это IT-компания, которая помогает бизнесам X5 Group работать эффективнее. Команда из более чем 5000 специалистов создает решения для сотрудников и миллионов покупателей. В компании тестируют вручную и с помощью автотестов, проверяют нагрузку и безопасность, чтобы все работало как надо.<\/p><p>Вы будете оценивать, сколько времени нужно на тестирование, создавать разную документацию, например, планы тестирования и отчеты. Также вам нужно будет проводить функциональное, регрессионное и интеграционное тестирование, искать и анализировать ошибки, а еще работать с дефектами и актуализировать тестовую модель. Вам предстоит создавать и запускать автоматизированные тестовые сценарии, поддерживать и развивать существующие решения в автоматизации, а также организовывать и проводить автоматизированное тестирование бизнес-процессов.<\/p>",
      "company": "X5 Tech",
      "location": "",
      "id": 8678,
      "category": "qa",
      "conditions_details": "<ul><li>Официальное оформление с белой зарплатой и ежеквартальными премиями<\/li><li>Возможность работать удалённо или в гибридном формате<\/li><li>Широкий пакет ДМС, включая выезд за рубеж и стоматологию, страхование жизни и здоровья<\/li><li>Возможность учиться и развиваться за счёт компании: тренинги, семинары, конференции, программы развития навыков, корпоративный университет и школа наставников<\/li><li>Программы мотивации для спикеров и авторов, подготовка спикеров к конференциям, сообщество авторов на Хабре<\/li><li>Обмен опытом через технические комьюнити<\/li><li>Яркая корпоративная жизнь с мероприятиями, конкурсами и возможностями для творчества<\/li><li>Забота о благополучии сотрудников: спортивные сообщества, Неделя здоровья<\/li><li>Скидки в экосистеме бизнесов Х5<\/li><li>Программа привилегий Prime-zone<\/li><li>Материальная помощь в сложных жизненных ситуациях<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт в тестировании от 3 лет (Web/Mobile/Desktop)<\/li><li>Знаете теорию тестирования и техники тест-дизайна<\/li><li>Работаете с SQL-запросами<\/li><li>Работаете с REST API<\/li><li>Имеете опыт тестирования многокомпонентных продуктов<\/li><\/ul>",
      "views": 60
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://career.avito.com/vacancies/razrabotka/17552/",
      "created_at": "Fri, 19 Sep 2025 07:48:16 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/_20250408081615.webp",
      "salary": "~ от 233 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Авито — это самая посещаемая онлайн-платформа объявлений в мире. С помощью Авито можно размещать объявления в категориях \"Товары\", \"Авто\", \"Работа\", \"Услуги\", \"Недвижимость\". В сервисе есть Авито Доставка, которая помогает безопасно заключать сделки по всей России. Авито объединяет продавцов и покупателей, как частных лиц, так и бизнес. Ежемесячная аудитория Авито — более 72 миллионов пользователей.<\/p><p>Вы будете участвовать в сборе и анализе требований, оценке рисков и их минимизации. Вам нужно будет корректировать процессы в команде для обеспечения качества на всех этапах реализации продукта. Вы будете владеть скоупом автотестов команды и беклогом автоматизации. Вам предстоит проводить нагрузочное тестирование и разрабатывать тест-планы и чек-листы по сложным задачам.<\/p>",
      "company": "Авито",
      "location": "",
      "id": 8669,
      "category": "qa",
      "conditions_details": "<ul><li>Возможность реализовать свои идеи в проекте с многомиллионной аудиторией<\/li><li>Талантливая команда, готовая поддержать ваши инициативы<\/li><li>Мощное железо, дополнительные мониторы и всё, что нужно для продуктивной работы<\/li><li>Прозрачная система премий, достойная зарплата — размер обсудим на собеседовании<\/li><li>Личный бюджет на обучение, который можно тратить на книги, курсы и конференции<\/li><li>Забота о здоровье: с первого дня будет ДМС со стоматологией, в офисе принимают терапевт и массажист<\/li><li>Удалёнка и офис в двух минутах от метро «Белорусская»: панорамный вид на центр города, места для уединённой работы и зоны отдыха<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт разработки автоматизированных тестов от 2 лет<\/li><li>Имеете опыт тестирования от 3 лет<\/li><li>Хорошо понимаете базовые принципы процесса обеспечения качества IT продуктов и всего цикла QA<\/li><li>Готовы постоянно совершенствоваться и улучшать процессы QA в команде, слышать обратную связь<\/li><li>Имеете опыт построения тестовых моделей<\/li><li>Обладаете практическими знаниями в области тестирования (тест-дизайн, виды тестирования, пирамида тестирования и т. д.)<\/li><li>Понимаете методы оптимизации тестирования<\/li><li>Владеете хотя бы одним языком программирования и готовы обучаться новым языкам<\/li><\/ul>",
      "views": 56
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://career.habr.com/vacancies/1000162072",
      "created_at": "Thu, 18 Sep 2025 18:12:06 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/OfferCase_20250918180209.webp",
      "salary": "от 400 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания OfferCase занимается разработкой портфолио облачных платформ и сервисов для крупных корпоративных клиентов. Среди них есть сервисы типа PaaS, например, база данных как сервис, управление API как сервис и мониторинг как сервис. Это отличная возможность для инженера среднего уровня, который хочет перейти от обычных решений к облачному ПО и корпоративным системам.<\/p><p>Вам предстоит создавать лучшие практики тестирования в компании, а также покрывать существующие порталы юнит-тестами на JavaScript. Плавный пользовательский опыт — один из ключевых факторов успеха для этих масштабных проектов.<\/p>",
      "company": "OfferCase",
      "location": "",
      "id": 8663,
      "category": "qa",
      "conditions_details": "<ul><li>Привлекательная компенсация, оплачиваемый отпуск, больничные дни, национальные праздники и обучение<\/li><li>Возможность посещать международные объекты клиентов, тесно сотрудничать с инженерными командами клиентов — крупными корпоративными предприятиями, лидирующими в своих отраслях<\/li><li>Стимулирующая, динамичная и растущая команда<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете более 3 лет коммерческого опыта в тестировании ПО<\/li><li>Знаете язык программирования JavaScript на продвинутом уровне<\/li><li>Имеете опыт работы с фреймворками для автоматизации тестирования Mocha и Cypress<\/li><li>Понимаете техники, инструменты и методологии тестирования<\/li><li>Понимаете жизненный цикл разработки ПО (SDLC)<\/li><li>Имеете опыт работы с Azure Cloud (будет плюсом)<\/li><li>Имеете опыт работы с Vue.js и Node.js (будет плюсом)<\/li><li>Имеете опыт построения CI/CD пайплайнов (будет плюсом)<\/li><li>Обладаете отличными коммуникативными навыками<\/li><li>Имеете склонность к решению проблем<\/li><li>Владеете английским языком на уровне Upper-Intermediate (письменно и устно)<\/li><li>Имеете высшее образование в области компьютерных наук, инженерии или смежной области<\/li><\/ul>",
      "views": 68
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125493674",
      "created_at": "Thu, 18 Sep 2025 18:00:55 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon3.webp",
      "salary": "от 140 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания ИТМС занимается разработкой программного обеспечения. Вы будете заниматься разработкой и поддержкой автотестов на Playwright (TS/JS) для e2e и API. Вам нужно будет понимать и проводить различные виды тестирования, а также разбираться в принципах работы Frontend/Backend, DevTools и баз данных. Также предстоит интегрировать автотесты в CI/CD GitLab (GitHub Actions / Jenkins), разрабатывать и поддерживать тест-кейсы, чек-листы и баг-репорты. Вам нужно будет взаимодействовать с командой разработки, дизайна, аналитики и DevOps, анализировать требования, проверять спецификации, оценивать задачи и обрабатывать обращения от техподдержки.<\/p>",
      "company": "ИТМС",
      "location": "",
      "id": 8647,
      "category": "qa",
      "conditions_details": "<ul><li>Интересные и разнообразные задачи, позволяющие прокачивать компетенции и воплощать идеи в реальность<\/li><li>Полный рабочий день с гибким началом рабочего дня<\/li><li>Удаленный, гибридный или офисный формат работы (офис в Пермском IT-кластере)<\/li><li>Работа в крутой команде над классным продуктом<\/li><li>Возможность профессионального и карьерного развития<\/li><li>Официальное оформление по ТК РФ<\/li><li>Возможность устройства по самозанятости/ИП<\/li><li>Работа в аккредитованной ИТ-компании<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы с TypeScript + Playwright (Cypress, Selenium)<\/li><li>Имеете опыт работы с REST API (Postman, Swagger, тесты через fetch/axios и т.п.)<\/li><li>Имеете опыт работы с системами контроля версий (Git)<\/li><li>Имеете опыт интеграции и настройки CI/CD автотестов<\/li><li>Понимаете базовые принципы POM (Page element model)<\/li><li>Понимаете основы клиент-серверного взаимодействия, HTTP, cookies, CORS<\/li><li>Умеете писать моck, заглушки<\/li><li>Уверенно знаете SQL, PostgreSQL<\/li><li>Имеете опыт работы от 3 до 6 лет<\/li><li>Будет плюсом опыт нагрузочного тестирования grafana k6, опыт тестирования мобильных приложений Appium, опыт работы с GitLab CI (Jenkins), опыт с Allure, знание подходов BDD, TDD, shift-left testing, а также опыт работы с Mongo, ReactJS<\/li><\/ul>",
      "views": 48
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125493114",
      "created_at": "Thu, 18 Sep 2025 17:51:25 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/_20250430083201.webp",
      "salary": "~ от 175 000 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания bpm — это эксперты, которые помогают среднему и крупному бизнесу анализировать и автоматизировать рабочие процессы. У них есть опыт в импортозамещении различных систем, таких как BPM, CRM, СЭД, ITSM, а также в работе с low-code платформами, open-source технологиями и внедрением искусственного интеллекта. Компания считает своих сотрудников главным активом и инвестирует в их рост и развитие. С 2011 года компания успешно реализовала более 100 проектов в России и СНГ, работая с крупными клиентами, включая Росбанк, СБЕР и банк ВТБ.<\/p><p>Сейчас компания ищет Тестировщика, который присоединится к команде для развития высоконагруженных и масштабируемых решений для крупного банка. Вам нужно будет тестировать сложные интеграционные решения, разрабатывать и поддерживать автотесты, работать с блокчейн-технологиями, участвовать в Agile-процессах и совершенствовать процессы тестирования.<\/p>",
      "company": "ЛАНИТ",
      "location": "",
      "id": 8637,
      "category": "qa",
      "conditions_details": "<ul><li>Возможность работать над амбициозными проектами с большим потенциалом<\/li><li>Работа в аккредитованной ИТ-компании<\/li><li>Удаленный или гибридный формат работы, с возможностью работать из регионов или в комфортабельном офисе в Москве с зонами отдыха<\/li><li>Возможности для профессионального развития: культура менторства, курсы и тренинги от корпоративного университета, митапы от профессиональных сообществ<\/li><li>Хороший социальный пакет, включающий ДМС со стоматологией и телемедициной 24/7, материальную поддержку, льготные условия кредитования, скидки от партнеров и корпоративные тарифы мобильной связи<\/li><li>Насыщенная корпоративная жизнь с регулярными корпоративами, квизами, киберспортивными матчами и внутренними техническими митапами<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы с базами данных Oracle, PostgreSQL, NoSQL и умеете писать сложные запросы из нескольких таблиц<\/li><li>Проводили разные виды тестирования: функциональное, нефункциональное, системное, интеграционное и регрессионное<\/li><li>Разбираетесь в DeFi и Web 3.0 технологиях<\/li><li>Тестировали интеграционные взаимодействия через REST API и Kafka, а также умеете анализировать логи систем<\/li><li>Работали с XML и JSON, анализировали XSD-схемы для интеграций<\/li><li>Знаете основные UNIX-команды<\/li><li>Автоматизировали тестирование Java-приложений<\/li><li>Использовали Maven, Git, Jenkins в рабочем процессе<\/li><li>Участвовали в разработке или улучшении блокчейн-платформ<\/li><\/ul>",
      "views": 54
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125500686",
      "created_at": "Thu, 18 Sep 2025 17:41:54 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon3.webp",
      "salary": "~ от 245 800 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания ИЦ АЙ-ТЕКО занимается разработкой IT-решений и работает в сфере высоких технологий.<\/p><p>Вы будете самостоятельно выстраивать процесс автотестирования с нуля. Вам нужно будет разрабатывать автотесты и проводить автоматизированное тестирование систем с их использованием.<\/p>",
      "company": "ИЦ АЙ-ТЕКО",
      "location": "",
      "id": 8629,
      "category": "qa",
      "conditions_details": "<ul><li>Работа в аккредитованной IT-компании<\/li><li>Оформление по ТК РФ с первого дня<\/li><li>Возможность работать удаленно<\/li><li>ДМС с первого дня, включая стоматологию<\/li><li>Корпоративный спорт: скидки на фитнес, футбольная и волейбольная секции, собственный йога-класс<\/li><li>Работа в команде, использующей гибкий подход к разработке<\/li><li>Возможность развития и обмена опытом в IT-проекте с командой специалистов высокого уровня<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы от 3 до 6 лет<\/li><li>Знаете стек технологий: Java, JavaScript (Cypress), fullstack<\/li><li>Умеете писать E2E, интеграционные и юнит тесты от 3 лет<\/li><\/ul>",
      "views": 56
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125487523",
      "created_at": "Thu, 18 Sep 2025 11:56:31 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon4.webp",
      "salary": "~ от 247 100 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания ITFB Group занимается разработкой и внедрением программного обеспечения, создавая инновационные продукты для бизнеса, компаний, заводов и городов. Она помогает ускорять ИТ-разработку и повышать надежность информационных систем. Среди клиентов компании — Сбер, ВТБ, МТС, Яндекс и Росатом.<\/p><p>Вам предстоит автоматизировать UI, бизнес-логику и интеграцию веб-приложений. Нужно будет разрабатывать дизайн и стратегию автотестов, а также следить за инфраструктурой автотестов, используя Selenium, Allure и Jenkins. Вам потребуется определять подходы и выбирать инструменты для автоматизации тестирования, разрабатывать и поддерживать фреймворки автотестирования. Также нужно будет оценивать трудозатраты и риски внедрения автоматизации, обучать и наставлять младших специалистов, а также предоставлять отчетность о выполненной работе.<\/p>",
      "company": "ITFB Group",
      "location": "",
      "id": 8610,
      "category": "qa",
      "conditions_details": "<ul><li>Оформление в соответствии с ТК РФ<\/li><li>Индексация дохода по результатам оценки работы (оценка 360 - не реже одного раза в год)<\/li><li>ДМС (+Стоматология) после испытательного срока<\/li><li>Обучение и сертификация за счет компании<\/li><li>Возможность работать удаленно, либо в одном из офисов в Москве, Рязани и Уфе<\/li><li>Прозрачность в вопросах карьерного планирования и прогнозирования дохода<\/li><li>Возможность ротации на другие проекты компании<\/li><li>Корпоративные тимбилдинги, мероприятия, подарки и скидки для сотрудников от партнеров<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт автоматизации тестирования Web/Desktop интерфейсов от 3 лет<\/li><li>Уверенно владеете Java<\/li><li>Знаете SQL для написания запросов и работы с хранимыми процедурами<\/li><li>Владеете Selenium WebDriver (приоритетно), Appium, Winium/WinAppDriver, REST Assured<\/li><li>Имеете опыт тестирования REST API, веб-сервисов и микросервисной архитектуры<\/li><li>Понимаете архитектуру REST и протокол HTTP<\/li><li>Имеете опыт работы с CI/CD системами (Jenkins приоритетно)<\/li><li>Знаете системы контроля версий (Git)<\/li><li>Имеете опыт с инструментами автоматизации сборки (Maven, Gradle)<\/li><li>Будет плюсом: уверенные знания основных практик тест-дизайна, знание основ построения архитектур приложений, опыт проектирования реляционных баз данных (Oracle, MS SQL, MySQL и т.п.), опыт автоматизированного тестирования API, опыт разворачивания и администрирования VCS и CI/CD систем, желательно владение инструментами DevOps, знание систем семейства *nix (ubuntu) на базовом уровне, опыт общения с Заказчиком по уточнению постановки задачи, опыт работы в финансовой организации и базовое понимание банковских продуктов<\/li><\/ul>",
      "views": 58
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125481837",
      "created_at": "Thu, 18 Sep 2025 11:19:26 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon4.webp",
      "salary": "~ от 173 900 ₽",
      "title": "Тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Brandquad — это IT-компания, которая занимается разработкой и внедрением платформы для управления информацией о товарах. Эта платформа помогает автоматизировать процесс создания данных о товарах и собирать аналитику по их продажам в интернете. Клиентами компании являются известные мировые бренды, такие как L'Oreal, Estée Lauder и другие. Штаб-квартира компании находится в России, а глобальный офис — во Франции.<\/p><p>В команду разработки ищется Middle QA Engineer. Вам предстоит участвовать в разработке новых функций в рамках scrum-команды. Нужно будет проверять работу функционала на соответствие требованиям и пользовательским историям, проводить UI-тестирование, тестирование API и запускать автотесты. Также потребуется выполнять ручные регрессионные и smoke-тестирования системы, составлять и поддерживать тестовую документацию, а также работать с задачами в общей команде по методике Kanban.<\/p>",
      "company": "Brandquad",
      "location": "",
      "id": 8603,
      "category": "qa",
      "conditions_details": "<ul><li>Стабильная заработная плата<\/li><li>Официальное трудоустройство по ТК РФ<\/li><li>График работы 5/2 с 9 до 18 или с 10 до 19<\/li><li>Удалённый формат работы<\/li><li>Возможность профессионального роста за счет экспертизы, качественного продукта, масштаба и работы с топ-клиентами<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в должности QA на коммерческих проектах от 1 года<\/li><li>Являетесь уверенным пользователем Linux или Mac OS<\/li><li>Владеете командами для работы с системой контроля версий Git (push, merge и т.д.) в командной строке<\/li><li>Умеете разворачивать ветки и проекты с помощью Docker/docker-compose<\/li><li>Имеете практический опыт работы с IDE, например, PyCharm<\/li><li>Имеете опыт работы с базами данных (Postgres)<\/li><li>Владеете навыком работы в Postman для написания запросов (Post, Get и др.) и запуска тестов<\/li><li>Умеете самостоятельно заводить задачи с ошибками 500, 400 и т.д. и прикладывать трейсбек<\/li><li>Имеете базовые знания языка Python, Go будет плюсом<\/li><\/ul>",
      "views": 71
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125472538",
      "created_at": "Thu, 18 Sep 2025 08:50:06 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon2.webp",
      "salary": "~ от 88 000 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Джи Эф Си – это компания, которая занимается доставкой продуктов питания для ресторанов и кафе, а также создает IT-решения для этого бизнеса. Компания работает с 2004 года и представлена во многих регионах России, являясь одной из ведущих фудсервисных компаний. Она сотрудничает с известными ресторанами и напрямую с производителями продуктов.<\/p><p>Вы будете отвечать за качество программного обеспечения на базе 1С. Вам нужно будет анализировать требования, проводить функциональное тестирование (нового функционала, регрессионное, дымовое, интеграционное, сквозное), а также нефункциональное тестирование (UI/UX, удобства использования). Вы будете участвовать в командных встречах по Scrum, составлять тест-кейсы и сценарии в TestIT, находить, описывать и отслеживать ошибки в YandexTracker. Вам предстоит общаться с разработчиками, аналитиками, менеджерами и другими специалистами, предоставлять отчеты о тестировании, оценивать задачи и управлять дефектами. Также вы будете писать автоматизированные тесты на Gerkin (Vanessa automation) и записывать видеоинструкции.<\/p>",
      "company": "Джи Эф Си",
      "location": "",
      "id": 8581,
      "category": "qa",
      "conditions_details": "<ul><li>Стандартный график работы с понедельника по пятницу, с 9:00 до 18:00<\/li><li>Возможность выбрать удобный формат работы: удаленный, полностью офисный или гибридный<\/li><li>Организация разнообразных корпоративных событий для сплочения команды<\/li><li>Комфортные условия в офисе: просторные рабочие места, современная техника, зоны для переговоров и отдыха, бесплатный чай и кофе<\/li><li>Возможность покупать лучшие ресторанные продукты со скидкой<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт тестирования продуктов 1С, включая автотестирование<\/li><li>Знаете инструменты, методики и подходы к тестированию ПО на 1С<\/li><li>Понимаете работу клиент-серверной архитектуры, имеете опыт тестирования обменов и API<\/li><li>Понимаете жизненный цикл разработки ПО<\/li><li>Умеете работать с платформой 1С (различные конфигурации), знание Vanessa automation будет преимуществом<\/li><li>Имеете опыт составления и поддержки тестовой документации (тест-кейсы, тест-планы)<\/li><li>Понимаете принципы ООП<\/li><li>Готовы развиваться в автоматизированном тестировании<\/li><li>Будет плюсом опыт работы с 1С УТ, RabbitMQ<\/li><\/ul>",
      "views": 54
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125456649",
      "created_at": "Thu, 18 Sep 2025 06:38:14 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon1.webp",
      "salary": "от 150 000 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Citrus.team — это IT-команда с более чем 12-летним опытом в интернет-сфере, которая создала сотни интернет-проектов, от простых сайтов до крупных порталов федерального уровня.<\/p><p>Вы будете заниматься внедрением и развитием системы автоматизации тестирования продуктов. Вам нужно будет разрабатывать и поддерживать регрессионные, функциональные и API автотесты по документации и тест-кейсам. Также предстоит поддерживать запуск автотестов и инструментов для формирования регулярной отчётности, а ещё взаимодействовать со смежными командами, такими как разработка и дизайн.<\/p>",
      "company": "Цитрус",
      "location": "",
      "id": 8569,
      "category": "qa",
      "conditions_details": "<ul><li>Гибридный формат работы с гибким стартом<\/li><li>Корпоративный английский, курсы/тренинги и спорт<\/li><li>Корпоративные выезды на природу и мероприятия в офисе<\/li><li>Небольшие команды, где каждый может влиять на технологии и продукт<\/li><li>Возможность переключаться между проектами<\/li><li>No blame culture и минимум бюрократии<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт автоматизации тестирования WEB-приложений на Python от 2 лет<\/li><li>Владеете инструментами автоматизации: Selenium/Playwright, Pytest, Allure<\/li><li>Понимаете архитектуру и принципы работы RESTful<\/li><li>Знаете SQL и Git<\/li><li>Понимаете процесс и принципы создания программного продукта по Agile<\/li><li>Имеете опыт работы с багтрекинговыми системами, например Jira<\/li><li>Имеете базовое понимание GitLab CI/CD<\/li><li>Будет плюсом знание тест-менеджера Qase или аналогов (Allure TestOps)<\/li><li>Будет плюсом знакомство с Playwright<\/li><\/ul>",
      "views": 53
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125438383",
      "created_at": "Thu, 18 Sep 2025 06:00:26 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon1.webp",
      "salary": "~ от 220 000 ₽",
      "title": "Тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Unisender — это платформа, которая помогает компаниям автоматизировать маркетинг. Она предоставляет удобные инструменты для создания и управления email-кампаниями, помогая увеличивать продажи и поддерживать связь с клиентами. Сервис включает email-рассылки, чат-ботов, конструктор лендингов, транзакционные рассылки, SMS-рассылки, аналитику и интеграцию с другими сервисами.<\/p><p>Вы будете заниматься написанием и поддержкой автотестов, а также проводить ручное тестирование примерно в равных долях. Вам предстоит масштабировать и оптимизировать существующие решения, взаимодействовать с командами разработки и тестирования. Нужно будет покрывать приложения автотестами для UI, REST и JSON-RPC, поддерживать тестовую документацию, регистрировать найденные дефекты в баг-трекинговой системе, планировать время и объем тестирования, а также предоставлять отчеты о результатах. Вы будете участвовать в планировании спринтов вместе с командой разработки и способствовать повышению общего качества продукта и процессов тестирования в компании.<\/p>",
      "company": "Unisender",
      "location": "",
      "id": 8554,
      "category": "qa",
      "conditions_details": "<ul><li>Работа в аккредитованной IT-компании<\/li><li>Оплачиваемые выходные на значимые события в жизни сотрудника<\/li><li>Материальная помощь в сложных жизненных ситуациях<\/li><li>Поддержка развития: оплата профильных ивентов, книг и курсов<\/li><li>ДМС после испытательного срока<\/li><li>Скидки 60% на сервис психологической поддержки Ясно<\/li><li>Оплата 50% на изучение английского языка в Skyeng<\/li><li>Ценится work-life balance, не приветствуются овертаймы, нет задач \"на вчера\"<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете минимум 3-4 года коммерческого опыта в автоматизированном тестировании<\/li><li>У вас глубокое знание Java и вы умеете уверенно применять ООП<\/li><li>Имеете опыт работы с Selenium WebDriver (Selenide — будет плюсом) и Maven<\/li><li>Имеете опыт работы с API-тестами (REST, JSON-RPC) и UI-тестами<\/li><li>Имеете опыт работы с Git и Unix-системами<\/li><li>Желателен опыт работы с системами непрерывной интеграции (CI), предпочтительно GitLab CI<\/li><li>Желателен опыт работы с Allure Framework для создания отчетов<\/li><li>Желателен опыт работы с TestNG/Postman<\/li><li>Владение RabbitMQ/MySQL/PostgreSQL/Clickhouse/MongoDB/Redis будет большим плюсом<\/li><li>Наличие ISTQB-сертификата будет большим плюсом<\/li><\/ul>",
      "views": 65
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://career.habr.com/vacancies/1000161988",
      "created_at": "Wed, 17 Sep 2025 18:38:46 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/Selecty_20250521154136.webp",
      "salary": "до 280 000 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания Selecty занимается разработкой IT-решений для банковской сферы. В данный момент ведется работа над проектом лояльности для Семейного банка.<\/p><p>Вам предстоит заниматься тестированием в рамках проекта лояльности. Нужно будет автоматизировать тестирование на Java, работать с REST-сервисами и микросервисной архитектурой.<\/p>",
      "company": "Selecty",
      "location": "",
      "id": 8457,
      "category": "qa",
      "conditions_details": "<ul><li>ИТ-аккредитация<\/li><li>Профессиональное развитие в команде экспертов<\/li><li>Участие в крупных проектах с высоконагруженными системами<\/li><li>Удаленная работа по РФ и в дружественных странах с гибким графиком<\/li><li>ДМС со стоматологией с первого дня работы<\/li><li>Скидка 20% на изучение иностранных языков от Skyeng для сотрудника и его родственников<\/li><li>Бонус за рекомендации по реферальной программе<\/li><li>Скидки на фитнес от Xfit и FitMost<\/li><li>Оплата курсов<\/li><li>Предоставление техники для работы (ноутбук и всё необходимое)<\/li><li>Гибкие варианты оформления: по ТК РФ или как ИП<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы функциональным тестировщиком от 3 лет<\/li><li>Имеете опыт автоматизации тестирования на Java от 3 лет<\/li><li>Понимаете клиент-серверную архитектуру<\/li><li>Имеете опыт тестирования систем на микросервисной архитектуре или понимаете особенности такой архитектуры<\/li><li>Имеете опыт тестирования REST сервисов<\/li><li>Умеете работать с требованиями и оценивать новую функциональность<\/li><li>Уверенно знаете техники тест-дизайна и умеете применять их на практике<\/li><li>Имеете опыт анализа ошибок, включая работу с логами<\/li><li>Имеете опыт работы с системой контроля версий Git (бранчи, пулл-реквесты и т.д.)<\/li><li>Имеете опыт работы с системами CI/CD<\/li><\/ul>",
      "views": 58
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125433591",
      "created_at": "Wed, 17 Sep 2025 09:45:04 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon1.webp",
      "salary": "~ от 238 400 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания занимается разработкой ERP-системы, которая является проектом импортозамещения.<\/p><p>Вы будете участвовать в проекте по разработке ERP-системы.<\/p>",
      "company": "Юникон Бизнес",
      "location": "",
      "id": 8429,
      "category": "qa",
      "conditions_details": "<ul><li>Возможность работать удаленно из любого города РФ<\/li><li>Готовность обсуждать оформление в штат или субподрядные схемы (ИП, ГПХ)<\/li><li>Доступно соискателям с инвалидностью<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы тестировщиком в проектах по функциональному тестированию ПО<\/li><li>Имеете опыт работы с языками программирования Python, Bash, JavaScript, Groovy, Java или C# для написания автотестов<\/li><li>Имеете опыт автоматизации тестирования, включая актуализацию существующих автотестов и их запуск<\/li><li>Имеете опыт подготовки отчетов по результатам тестирования<\/li><li>Имеете опыт настройки тестовых сред, включая установку и конфигурирование прикладного ПО<\/li><li>Имеете практический опыт автоматизации тестирования с использованием инструментов Selenium, HP UFT, Cucumber, Junit, TestNG, Espresso, Earl Grey, API или TestСomplete<\/li><li>Имеете опыт работы с тест-дизайном, включая проектирование тестовой модели и создание набора тестовых случаев для оптимального тестового покрытия приложения<\/li><li>Имеете опыт работы с SQL, включая составление запросов различной сложности, объединение нескольких таблиц (от 3-х и более), вложенные запросы и фильтрацию по нескольким полям<\/li><li>Имеете практический опыт интеграционного тестирования ПО и использования инструментов API тестирования, таких как SoapUI, rfhutil, MQ или Fiddler<\/li><li>Имеете практический опыт функционального и интеграционного тестирования сервисных шин и процессов интеграции данных<\/li><li>Имеете практический опыт тестирования баз данных Oracle, MySQL, MS SQL, PostgreSQL, GRID или Firebird<\/li><li>Имеете практический опыт чтения, редактирования и анализа ошибок XML/HTML кода с использованием Altova XMLSpy или аналогичных инструментов<\/li><li>Имеете опыт использования паттерна Page Object в работе<\/li><li>Имеете практический опыт разработки эмуляторов/заглушек<\/li><\/ul>",
      "views": 73
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://career.ostrovok.ru/vacancy/4051020/",
      "created_at": "Wed, 17 Sep 2025 05:34:29 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/_20250529093205.webp",
      "salary": "~ от 158 300 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Островок — это аккредитованная IT-компания, которая создает продукты для путешественников, турагентов и отельеров по всему миру.<\/p><p>Вы будете тестировать платежные процессы и интеграции с внутренними и внешними сервисами. Вам нужно будет помогать другим командам с платежными сценариями и сотрудничать с командами поддержки для решения проблем и инцидентов. Основное внимание будет уделяться бэкенд-тестированию (80%), а также фронтенд-тестированию (20%). Вам предстоит управлять багами и тестовой документацией, а также запускать существующие автоматизированные тесты и проверять их результаты.<\/p>",
      "company": "Островок",
      "location": "",
      "id": 8372,
      "category": "qa",
      "conditions_details": "<ul><li>Гибкий график с возможностью удаленной работы или работы из офиса<\/li><li>Поддержка профессионального развития и участия в конференциях<\/li><li>Корпоративные программы оздоровления и скидки на услуги<\/li><li>Внутренние программы обучения для развития soft skills и лидерских качеств<\/li><li>Корпоративные цены на отели и туристические услуги<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы тестировщиком от 2 лет<\/li><li>Знаете техники тест-дизайна и анализа<\/li><li>Имеете опыт работы с Postman и Devtools<\/li><li>Понимаете, что такое REST API<\/li><li>Владеете английским языком на уровне B1 (Intermediate)<\/li><li>Будет плюсом опыт автоматизации с использованием Python и mocking<\/li><\/ul>",
      "views": 86
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://career.avito.com/vacancies/razrabotka/17352/",
      "created_at": "Tue, 16 Sep 2025 19:18:59 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/_20250408081615.webp",
      "salary": "~ от 322 400 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания Авито — самая посещаемая онлайн-платформа объявлений в мире. Через Авито люди размещают объявления о товарах, авто, работе, услугах и недвижимости. В сервисе есть Авито Доставка, которая помогает безопасно совершать сделки по всей России. Авито связывает частных лиц, малый и средний бизнес, а также крупные компании. Ежемесячная аудитория Авито — более 72 миллионов пользователей, а количество активных объявлений превышает 230 миллионов.<\/p><p>Вам предстоит обеспечивать качество доработок продукта, повышать стандарты качества в команде, участвовать в проработке новых функций. Вам нужно будет поддерживать и дополнять тестовую модель продукта, формировать правильную пирамиду тестирования, а также обеспечивать мониторинг работы критических бизнес-сценариев. Вам также предстоит вести задачи, связанные с обеспечением качества, и разрабатывать e2e и интеграционные тесты.<\/p>",
      "company": "Авито",
      "location": "",
      "id": 8359,
      "category": "qa",
      "conditions_details": "<ul><li>Возможность реализовать свои идеи в проекте с многомиллионной аудиторией<\/li><li>Талантливая команда, готовая поддержать ваши инициативы<\/li><li>Мощное железо, дополнительные мониторы и всё, что нужно для продуктивной работы<\/li><li>Прозрачная система премий, достойная зарплата (размер обсуждается на собеседовании)<\/li><li>Личный бюджет на обучение (книги, курсы, конференции)<\/li><li>Забота о здоровье: ДМС со стоматологией с первого дня, в офисе принимают терапевт и массажист<\/li><li>Удалёнка и офисы в разных городах<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт разработки автоматизированных тестов<\/li><li>Владеете одним из языков программирования и SQL на уровне написания запросов<\/li><li>Готовы осваивать новые технологии (в проекте используется в основном TypeScript/JS, немного Go, Swift, Kotlin)<\/li><li>Имеете опыт тестирования мобильных приложений, веб-приложений и API<\/li><li>Обладаете практическими знаниями в области тестирования (тест-дизайн, виды тестирования, пирамида тестирования и т.д.)<\/li><li>Имеете опыт построения тестовых моделей<\/li><li>Понимаете методы оптимизации процесса обеспечения качества<\/li><li>Умеете выстраивать конструктивную коммуникацию, как внутри команды, так и со смежными командами<\/li><li>Ответственны и организованны<\/li><li>Умеете работать в условиях большой неопределенности<\/li><\/ul>",
      "views": 85
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://t.me/M_95_95_95",
      "created_at": "Tue, 16 Sep 2025 18:35:01 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon4.webp",
      "salary": "~ от 320 000 ₽",
      "title": "Тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания PlayMax занимается разработкой решений для онлайн-казино, игровых провайдеров и агрегаторов. Агрегатор объединяет тысячи игр от множества популярных провайдеров. Основные технологии, используемые в компании: C#, Python, gRPC, MongoDB, Cassandra.<\/p><p>Вам предстоит работать в команде разработки, проектировать, создавать и поддерживать сценарии и инструменты для тестирования продуктов компании. Также нужно будет общаться со стейкхолдерами и экспертами, чтобы понимать технологии и требования к продуктам, и на основе этого разрабатывать стратегии тестирования, обеспечивая высокие стандарты качества. Вам нужно будет настраивать тестовое окружение, разрабатывать автотесты для backend, вести тестовую документацию в тест-менеджмент системе, обеспечивать стабильность автотестов. По мере развития продукта потребуется покрывать автотестами фронтенд (бекофис продукта). Также предстоит поддерживать и улучшать систему автоматизированного тестирования, решать возникающие проблемы, оценивать и разбирать инциденты, ставить задачи разработчикам.<\/p>",
      "company": "PlayMax",
      "location": "",
      "id": 8353,
      "category": "qa",
      "conditions_details": "<ul><li>Полностью удалённая работа<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт выполнения проектов по автоматизированному тестированию от 3 лет, включая разработку автотестов, эмуляторов и утилит для генерации тестовых данных<\/li><li>Имеете обязательный опыт в автоматизированном тестировании backend и API с использованием Python и PyTest<\/li><li>Знаете современные принципы и практики автоматизированного тестирования<\/li><li>Знаете ООП, SOLID и паттерны проектирования<\/li><li>Имеете глубокое понимание gRPC<\/li><li>Имеете опыт работы с базами данных (SQL/NoSQL)<\/li><li>Умеете работать с различными форматами данных: JSON, XML, CSV, HTML<\/li><li>Имеете опыт работы с CI/CD (Jenkins, GitLab, TeamCity, Azure)<\/li><li>Имеете опыт работы с Git<\/li><li>Имеете опыт работы с Docker<\/li><li>Имеете опыт работы с TMS (Allure TestOps, TestRail, TestIT)<\/li><li>Имеете навыки оценки рисков и прогнозирования влияния изменений в интеграционном взаимодействии<\/li><li>Умеете работать с требованиями продукта и составлять тест-кейсы<\/li><li>Имеете хорошие коммуникативные навыки для взаимодействия с разработчиками, менеджерами продукта и другими участниками процесса разработки<\/li><li>Будет плюсом опыт построения системы автоматизированного тестирования с нуля, опыт работы с ClickHouse и опыт в работе над проектами в домене Gambling<\/li><\/ul>",
      "views": 71
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125396441",
      "created_at": "Tue, 16 Sep 2025 18:30:19 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon1.webp",
      "salary": "~ от 231 900 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания QUALITICA — аккредитованная IT-компания, которая занимается разработкой чат-ботов, онлайн-сервисов, сложных интернет-магазинов, CRM и ERP. Компания выполняет множество интеграций с различными системами, такими как 1С, соцсети, платежные системы и СДЭК. Проекты разнообразные и сложные, что дает возможность приложить свои силы. Работа ведется с крупными компаниями-заказчиками и агентствами, что позволяет быть причастным к нетривиальным историям и видеть все изнутри.<\/p><p>Вы будете создавать и актуализировать автотесты для web и API. Вам нужно будет исследовать проблемы падения автотестов и исправлять их. Также предстоит поддерживать и развивать фреймворк автоматизации тестирования и обеспечивать запуск автотестов и инструментов составления отчетности.<\/p>",
      "company": "QUALITICA",
      "location": "",
      "id": 8351,
      "category": "qa",
      "conditions_details": "<ul><li>Испытательный срок три месяца<\/li><li>Возможность развиваться на крупных проектах в командной работе<\/li><li>Возможность проявить себя<\/li><li>Широкий круг профессионального общения<\/li><li>Удаленный формат работы или работа в офисе в Оренбурге<\/li><li>Заработная плата обсуждается и зависит от технических компетенций<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в автоматизации тестирования от 3 лет<\/li><li>Имеете опыт автоматизации web и API<\/li><li>Умеете разрабатывать автотесты на Java/Kotlin, Selenium/Selenide, TestNG/JUnit, Maven/Gradle или на Python, Pytest, Selenium, Request<\/li><li>Имеете опыт работы с системами контроля версий<\/li><li>Имеете опыт работы с системами CI/CD (Jenkins/Teamcity)<\/li><li>Имеете опыт работы с DevOps: Selenoid, Selenium Grid, Docker приложения<\/li><li>Будет плюсом опыт параллельного запуска автотестов<\/li><li>Будет плюсом опыт работы с Appium, Cucumber<\/li><li>Будет плюсом опыт работы с одной из систем логирования: Splunk, Graylog, Kibana<\/li><\/ul>",
      "views": 73
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125399323",
      "created_at": "Tue, 16 Sep 2025 18:09:13 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/_20250916180913.webp",
      "salary": "~ от 183 600 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания является современной аккредитованной IT-компанией, которая создает эффективные цифровые решения для социальной сферы. Основная цель компании — внести значительный вклад в развитие креативной экономики страны, разрабатывая востребованные цифровые продукты. Среди известных продуктов компании — Виртуальная школа, Культурный регион, Культура.РФ, Пушкинская карта и другие.<\/p><p>В команду требуется Автотестировщик (QA Automation Engineer). Вам предстоит оценивать важность написания автоматизированных тестов, исходя из целей заказчика, проектных задач и рисков. Также нужно будет готовить тестовые данные, проектировать, разрабатывать и обновлять скрипты автоматизированного тестирования, создавать заглушки и эмуляторы информационных систем. Вы будете создавать отчеты по результатам автоматизированного тестирования с выводами и предложениями по улучшению систем и инфраструктуры, а также описывать и фиксировать найденные дефекты программного обеспечения.<\/p>",
      "company": "Медиа Сервис",
      "location": "",
      "id": 8346,
      "category": "qa",
      "conditions_details": "<ul><li>Работа в аккредитованной IT-компании, входящей в состав ПАО «Ростелеком»<\/li><li>Возможность развивать продукты с миллионной аудиторией по всей стране<\/li><li>Возможность работать удаленно из любого города России<\/li><li>График работы 5/2, с 09:00 до 18:00 по МСК<\/li><li>Годовая премия для сотрудников, проработавших от года<\/li><li>Программа нематериальной мотивации с возможностью приобретать мерч и участвовать в розыгрышах призов (путевка в Дубай, iPhone 16, PlayStation)<\/li><li>Бесплатное корпоративное обучение для всех сотрудников<\/li><li>Профессиональная команда, выстроенная обратная связь, конференции и реальные возможности для роста и развития<\/li><li>Оформление по ТК РФ<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт разработки автотестов для UI и backend части от 3 лет<\/li><li>Знаете язык программирования Python и фреймворки Pytest и Playwright<\/li><li>Имеете опыт развития архитектуры тестового фреймворка<\/li><li>Понимаете жизненный цикл и этапы разработки ПО<\/li><li>Имеете опыт работы с системами контроля версий (Git)<\/li><li>Имеете опыт работы с системами контейнеризации (Kubernetes)<\/li><li>Умеете писать SQL запросы средней сложности (PostgreSQL)<\/li><li>Имеете опыт работы с очередями сообщений (Kafka)<\/li><li>Умеете читать логи сервера (Grafana)<\/li><li>Имеете опыт работы с системами управления проектами (Jira или аналогами)<\/li><li>Будет плюсом: опыт тестирования билетных систем, опыт нагрузочного тестирования, навыки конфигурирования CI/CD, высшее профессиональное техническое образование<\/li><\/ul>",
      "views": 72
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125401685",
      "created_at": "Tue, 16 Sep 2025 17:56:59 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/_20250804094916.webp",
      "salary": "~ от 220 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Национальный исследовательский университет Высшая школа экономики — это крупный образовательный центр, который занимается подготовкой специалистов в различных областях. Университет предлагает программы обучения и создает продукты для студентов и исследователей.<\/p><p>Вы будете принимать решения о том, как лучше проводить тестирование, и разрабатывать автоматизированные сценарии для проверки программ. Вам нужно будет настраивать процессы, чтобы тесты запускались автоматически, собирать результаты и формировать отчеты. Также предстоит писать и поддерживать чек-листы и сценарии тестирования, участвовать в проектах автоматизации как ведущий QA/TA инженер. Вам нужно будет разрабатывать, внедрять и поддерживать инструменты и фреймворки для тестирования.<\/p>",
      "company": "НИУ ВШЭ",
      "location": "",
      "id": 8338,
      "category": "qa",
      "conditions_details": "<ul><li>Оформление по ТК РФ<\/li><li>Возможность дистанционного формата работы<\/li><li>Обширные возможности для профессионального развития: программы повышения квалификации, посещение образовательных мероприятий и лекций, возможность изучать иностранные языки<\/li><li>Софинансирование ДМС, скидки на культурные мероприятия<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт разработки автоматизированных сценариев на Java 11+ с использованием jUnit5, TestNG, Cucumber, Selenium WebDriver, RestAssured, Allure<\/li><li>Имеете опыт составления тест-кейсов и ведения тестовой документации<\/li><li>Владеете скриптовыми языками, такими как bash, ksh, sh<\/li><li>Имеете опыт использования инструментов для тестирования API: Postman, Insomnia, SoapUI и подобных<\/li><li>Знаете структуру баз данных и владеете языками запросов (SQL, диалекты: PostgreSQL, Oracle)<\/li><li>Понимаете протоколы и архитектурные принципы построения современных web-приложений: HTTP/HTTPS, RESTFull, WebSocket<\/li><li>Знаете теорию тестирования и основные техники тест-дизайна<\/li><li>Понимаете принципы построения приложений, этапы современных процессов разработки и тестирования<\/li><li>Имеете опыт написания и оформления баг-репортов (Jira, Bugzilla, Yandex Tracker и т.п.)<\/li><li>Имеете опыт разработки вспомогательных инструментов, сервисов, утилит и скриптов<\/li><li>Имеете опыт работы со средствами мониторинга и сбора данных<\/li><li>Будет плюсом: имеете опыт работы со следующими технологиями и фреймворками: Spring Boot, Docker, K8s, Kafka, Hazelcast, Gradle, Jenkins, Nexus, Ansible; знаете устройство JVM (JMM, принципы работы Garbage Collector-ов); имеете опыт работы с ELK стэком; имеете опыт в использовании реляционных/in-memory БД; знаете особенности БД: индексирование, партиционирование, реляционные паттерны; имеете опыт работы с продуктами Atlassian (Jira, Confluence, Stash); имеете опыт разработки методологии нагрузочного тестирования; имеете экспертизу в стандартных средствах нагрузочного тестирования и генерации нагрузки; имеете опыт использования практик DevOps и понимание принципов CI/CD; знаете один или несколько Agile-подходов: XP, Kanban-метод, Scrum, LeSS, Nexus, SAFe<\/li><\/ul>",
      "views": 63
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://t.me/chloe_cay",
      "created_at": "Tue, 16 Sep 2025 17:24:04 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon4.webp",
      "salary": "~ от 275 000 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Centicore – это компания, которая занимается разработкой мобильных приложений для пользователей по всему миру. Продукты компании помогают людям решать повседневные задачи и делают их жизнь удобнее.<\/p><p>Вы будете проверять, соответствует ли мобильное приложение на Android и iOS документации. Вам нужно будет анализировать требования и готовить тестовую документацию и данные. Также предстоит тестировать документацию и дизайн макетов по методу Shift-Left, проводить функциональное, регрессионное и интеграционное тестирование. Вы будете тестировать UI и API, находить, локализовать и фиксировать дефекты, а также формировать отчёты об ошибках в Jira. Вам нужно будет разрабатывать тестовые сценарии автотестов на Swift/Kotlin/Java и участвовать в тестировании интеграционной функциональности совместно с другими отделами.<\/p>",
      "company": "Centicore",
      "location": "",
      "id": 8298,
      "category": "qa",
      "conditions_details": "<ul><li>Удалённый формат работы в IT аккредитованной компании<\/li><li>Длительный проект<\/li><li>Оплачиваемый отпуск 28 календарных дней в год и оплачиваемые больничные<\/li><li>ДМС<\/li><li>Предоставление техники<\/li><li>Компенсация хобби/спортзала/английского языка<\/li><li>Индексация/пересмотр заработной платы<\/li><li>Компенсация профессионального обучения<\/li><li>Возможность участия во внутренних программах компании и активностях<\/li><li>Услуги корпоративного психолога<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в тестировании от 5 лет<\/li><li>Имеете минимальный опыт написания автотестов<\/li><li>Имеете опыт работы с технологиями API (REST | SOAP | GraphQlL | gRPC | WebSocket)<\/li><li>Имеете опыт работы с мобильными приложениями (iOS и Android), понимаете их специфику<\/li><li>Знаете теорию тестирования и техники тест-дизайна<\/li><li>Умеете сниффить трафик и подменять запросы<\/li><li>Умеете читать логи (Kibana/Mesos)<\/li><li>Умеете собирать логи на Android и iOS<\/li><li>Знаете инструменты: Postman, Charles<\/li><li>Имеете высшее образование<\/li><\/ul>",
      "views": 64
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://telegra.ph/QA-Tester-09-14",
      "created_at": "Tue, 16 Sep 2025 11:57:09 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/-_20250625083119.webp",
      "salary": "от 100 000 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Крупная медиакомпания с более чем 25-летней историей и миллиардной выручкой создает полезные сервисы и продукты для 15 профессиональных аудиторий. Это журналы, справочные системы, интернет-сервисы и дистанционное обучение.<\/p><p>Вы будете заниматься тестированием новых доработок и автоматизировать его. Вам нужно будет сокращать время прогона автотестов, присваивать приоритеты дефектам, ориентируясь на ценность для пользователя, писать тестовую документацию и локализовать дефекты. Также потребуется обновлять тестовое покрытие, проверять корректность выполнения задач разработчиком в спринте и работать в команде, сообща решая все проблемы.<\/p>",
      "company": "Актион-Технологии",
      "location": "",
      "id": 8295,
      "category": "qa",
      "conditions_details": "<ul><li>Белая, своевременная и конкурентоспособная заработная плата<\/li><li>ДМС<\/li><li>Гибкий график, начало работы с 8 до 11<\/li><li>Профессиональный рост: внутреннее обучение, возможность посещать конференции и митапы, спонсирование обучения<\/li><li>Удаленный формат работы<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт в тестировании от 1 года<\/li><li>Имеете минимальный опыт в автоматизации web приложений, API на Java (курсы, свои проекты)<\/li><li>Понимаете процессы тестирования<\/li><li>Умеете строить план и приоритизировать тестирование<\/li><li>Знаете SQL, CI, GIT, log4J, HTTP, консоль браузера<\/li><li>И будет здорово, если имеете знания JAVA/Kotlin, Selenium, Allure, docker<\/li><li>Умеете взаимодействовать в команде<\/li><\/ul>",
      "views": 83
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125391076",
      "created_at": "Tue, 16 Sep 2025 11:47:53 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/MANGO_FZCO_20250911100901.webp",
      "salary": "от 200 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания создает Windi Messenger — новый мессенджер с искусственным интеллектом и встроенной системой задач. Это не просто чат, а инструмент для жизни и бизнеса, который должен быть максимально надежным.<\/p><p>Вы будете тестировать мобильные приложения (iOS, Android), а в будущем и веб-версию. Вам нужно будет выстраивать процессы тестирования с нуля, создавать тест-планы, чек-листы и регламенты. Также предстоит находить баги и оформлять их так, чтобы программисты точно поняли проблему, работать с системой мониторинга Sentry для анализа ошибок в продакшене, настраивать и использовать инструменты тестирования для мобильных платформ. Вам нужно будет проверять, что задачи закрыты правильно и ничего не сломано, давать обратную связь по юзабилити и логике, а также работать вместе с разработчиками (бэкенд на FastAPI Python) и продакт-менеджером над улучшением продукта.<\/p>",
      "company": "MANGO FZCO",
      "location": "",
      "id": 8292,
      "category": "qa",
      "conditions_details": "<ul><li>Работа над продуктом, который уже выходит на международный рынок<\/li><li>Возможность построить процессы тестирования с нуля — ваш вклад в архитектуру качества<\/li><li>Гибкий удаленный формат работы<\/li><li>Влияние на качество продукта — ваша работа будет реально менять Windi<\/li><li>Конкурентное вознаграждение<\/li><li>Возможность расти вместе с проектом и брать на себя новые зоны ответственности<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы от 3 лет с опытом выстраивания процессов тестирования<\/li><li>Понимаете, как устроено тестирование мобильных приложений<\/li><li>Владеете инструментами тестирования: TestFlight, Firebase Test Lab, Charles Proxy, Postman/Insomnia для API<\/li><li>Имеете опыт работы с системами трекинга багов (Jira, Linear, YouTrack или аналоги)<\/li><li>Знакомы с мониторингом ошибок (Sentry или аналоги)<\/li><li>Умеете мыслить критически и докапываться до сути<\/li><li>Внимательны к деталям, но при этом умеете видеть картину в целом<\/li><li>Горите идеей делать продукт мирового уровня и готовы строить процессы с чистого листа<\/li><li>Будет плюсом опыт автоматизации тестирования (Appium, Detox, или аналоги)<\/li><li>Будет плюсом знание Python и понимание архитектуры FastAPI<\/li><li>Будет плюсом опыт работы в стартапах или быстрорастущих продуктах<\/li><li>Будет плюсом интерес к AI-продуктам<\/li><li>Будет плюсом опыт настройки CI/CD для автоматического тестирования<\/li><\/ul>",
      "views": 78
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125389872",
      "created_at": "Tue, 16 Sep 2025 11:47:09 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/KTS_20250617050218.webp",
      "salary": "~ от 121 000 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания KTS занимается разработкой и внедрением собственных B2B-продуктов, автоматизирует сложные процессы крупных компаний, создает высоконагруженные игровые веб-сервисы для рекламных кампаний, а также развивает собственную школу разработки. В компании уже более 200 человек, и она продолжает расти. Среди клиентов KTS — Дом РФ, ПИК, Мангазея, VK, Альфа банк, X5 retail group и многие другие. Компания гордится своими проектами, такими как ЛК агента по продаже недвижимости, мобильное приложение для жителей ЖК \"Мангазея\", ЛК для сотрудников “Пятёрочка” и обучающая платформа для рекламодателей VK.<\/p><p>В юнит Корпоративных сервисов, который разрабатывает сложные IT-продукты для корпораций, в основном в областях HRTech и EdTech, ищется Manual QA Engineer. Вам предстоит работать с B2B-продуктами, автоматизировать сложные процессы крупных компаний и создавать высоконагруженные игровые веб-сервисы. Вам нужно будет тестировать IT-продукты для корпораций, в основном в областях HRTech и EdTech.<\/p>",
      "company": "KTS",
      "location": "",
      "id": 8290,
      "category": "qa",
      "conditions_details": "<ul><li>Работа по ТК РФ, выдается ДМС со стоматологией после испытательного срока<\/li><li>Гибкий график работы с 9:00 до 11:00 по московскому времени<\/li><li>Развитие системы наставничества и построение понятного плана роста внутри компании<\/li><li>Поощряется написание статей и участие с докладами в конференциях<\/li><li>Поддержка изучения английского языка корпоративной скидкой в Skyeng<\/li><li>Корпоративные скидки на квартиры от ведущих застройщиков Москвы<\/li><li>Возможность работать из офиса на Бауманской<\/li><li>Регулярные мероприятия, включая тусовки на крыше офиса и зимний корпоратив<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в QA от 2 лет<\/li><li>Уверенно владеете английским языком, чтобы не только читать документацию, но и общаться на дейликах<\/li><li>Уверенно владеете Postman и прокси-снифферами<\/li><li>Имеете опыт работы с BrowserStack и кросс-браузерным тестированием<\/li><li>Обладаете навыками администрирования проектов в TMS<\/li><li>Глубоко понимаете теорию тестирования и умеете применять её на практике<\/li><li>Умеете составлять понятную и структурированную документацию для QA<\/li><li>Способны самостоятельно решать проблемы и предлагать улучшения в процессах тестирования<\/li><li>Будет плюсом: Имеете опыт тестирования ИИ-решений и знакомы с Django Admin<\/li><\/ul>",
      "views": 89
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://career.habr.com/vacancies/1000161727",
      "created_at": "Tue, 16 Sep 2025 10:14:51 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon1.webp",
      "salary": "~ от 245 800 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания FinBeat Tech создает решения для автоматизации информационных систем и программных комплексов, которые используются в международных проектах на рынке финансовых услуг. Компания занимается разработкой инновационного программного обеспечения в сфере Fintech и входит в реестр аккредитованных ИТ-компаний.<\/p><p>Вы будете создавать и поддерживать автоматизированные тесты для backend-методов на Python. Вам нужно будет анализировать сообщения об ошибках от пользователей, составлять планы и сценарии тестирования, а также участвовать в пуско-наладочных работах. Кроме того, вы будете помогать команде разработки и аналитики в работе с требованиями к новой функциональности и вести пользовательскую документацию.<\/p>",
      "company": "FinBeat Tech",
      "location": "",
      "id": 8282,
      "category": "qa",
      "conditions_details": "<ul><li>Работа в дружной команде профессионалов<\/li><li>Наставничество от ведущих специалистов на этапе вхождения в проект<\/li><li>Возможность сделать вместе выдающийся продукт на мировом рынке Азии, Латинской Америки, Европы и СНГ<\/li><li>Практика и развитие компетенций, обсуждение индивидуального плана развития<\/li><li>Официальное оформление по ТК РФ<\/li><li>Конкурентная заработная плата, которую можно масштабировать в зависимости от бизнес-задач<\/li><li>Стабильная оплата<\/li><li>Гибкое начало и окончание рабочего дня<\/li><li>ДМС (включая стоматологию) с первого рабочего дня<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт автоматизированного тестирования в коммерческих проектах от 2-х лет<\/li><li>Знаете Python для написания автотестов<\/li><li>Имеете практический опыт автоматизированного тестирования интеграционных решений<\/li><li>Понимаете тестирование API и баз данных, если они используются в приложении<\/li><li>Знаете инструменты для автоматизации, такие как Selenium, Appium, и другие<\/li><li>Понимаете процесс разработки ПО и жизненный цикл приложения<\/li><li>Имеете опыт работы с Postman и Swagger<\/li><li>Способны анализировать журналы ошибок (логи) и использовать инструменты для выявления и отслеживания дефектов<\/li><li>Имеете опыт работы с Jira (включая различные плагины), Confluence, инструментами тест-менеджмента (X-Ray, Testrail, Test IT или аналогичными)<\/li><li>Будет плюсом: имеете опыт работы с Charles, Fiddler, SOAP UI; уверенно знаете СУБД, умеете писать запросы средней сложности; имеете опыт тестирования шины данных и очередей<\/li><\/ul>",
      "views": 88
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125383330",
      "created_at": "Tue, 16 Sep 2025 09:28:48 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon4.webp",
      "salary": "~ от 245 800 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания \"Потенциал\" занимается разработкой множества высоконагруженных SOAP сервисов и приложений, которые работают с Kafka и реляционными базами данных.<\/p><p>Вы будете тестировать SOAP веб-сервисы с использованием SoapUI, а также приложения, взаимодействующие с Kafka. Вам нужно будет разрабатывать автотесты для сервисов и планировщиков, выявлять, анализировать и документировать ошибки, вести и сопровождать дефекты в баг-трекинговых системах, а также документировать результаты тестирования и работать с тестовой документацией.<\/p>",
      "company": "Потенциал",
      "location": "",
      "id": 8271,
      "category": "qa",
      "conditions_details": "<ul><li>Минимум бюрократии<\/li><li>Интересные задачи и возможности профессионального роста<\/li><li>Поддержка и помощь со стороны коллег<\/li><li>Дружная и веселая команда<\/li><li>100% белая зарплата два раза в месяц (аванс и зарплата)<\/li><li>Оформление по ТК РФ через аккредитованную компанию<\/li><li>Полная занятость, полный рабочий день<\/li><li>Аккредитованная в Минцифры компания<\/li><li>Удаленная работа с редкими визитами в офис (Москва, Кострома)<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в тестировании от 3 лет<\/li><li>Имеете опыт тестирования SOAP web-сервисов с применением SoapUI<\/li><li>Имеете базовые знания работы с Kafka и понимаете архитектуру приложений, использующих Kafka<\/li><li>Знаете SQL (Oracle, Postgres) на уверенном уровне<\/li><li>Обладаете ответственностью и хорошими коммуникативными навыками<\/li><li>Будет плюсом, если имеете знания Groovy, Python или базовые знания других языков программирования, а также опыт автоматизации тестирования<\/li><\/ul>",
      "views": 82
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125375027",
      "created_at": "Tue, 16 Sep 2025 08:11:07 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon3.webp",
      "salary": "~ от 203 700 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>MANGO OFFICE — это лидер на рынке облачных коммуникаций в России, работающий с 2001 года. Компания входит в топ-20 крупнейших IT-разработчиков РФ и имеет филиалы в 18 городах России, где трудится более 1000 сотрудников. Клиентами MANGO OFFICE являются более 55 000 компаний, среди которых Skyeng, СитиМобил, Вкусвилл, Альфа Страхование и Сбер Маркет.<\/p><p>Вы будете заниматься разработкой и выполнением тестов на языке Java. Вам нужно будет анализировать и документировать результаты тестирования, проводить оценку затрат на тестирование, а также разрабатывать тестовые сценарии. Вы примете участие в планировании, проектировании и внедрении тестирования новых функций и исправлений. Также вам предстоит взаимодействовать с командой разработчиков для устранения ошибок и улучшения качества приложения.<\/p>",
      "company": "MANGO OFFICE",
      "location": "",
      "id": 8246,
      "category": "qa",
      "conditions_details": "<ul><li>Удалённый формат работы<\/li><li>Гибкий график с началом рабочего дня в период с 8:00 до 11:00<\/li><li>Подключение к ДМС после окончания испытательного срока<\/li><li>Безлимитные консультации на платформе корпоративного благополучия ПОНИМАЮ<\/li><li>Бесплатное обучение с профессиональными тренерами и наставниками в Манго Академии<\/li><li>Предоставляются все льготы для сотрудников как аккредитованной IT-компании<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в тестировании программного обеспечения не менее 3 лет<\/li><li>Знаете язык программирования Java<\/li><li>Имеете опыт работы с инструментами для автоматизации тестирования, такими как Selenium, JUnit, TestNG<\/li><li>Умеете работать в команде и самоуправляться<\/li><\/ul>",
      "views": 77
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125370220",
      "created_at": "Tue, 16 Sep 2025 07:34:14 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/_20250916073318.webp",
      "salary": "~ от 174 000 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания 2UP — это диджитал-агентство, которое уже 10 лет занимается созданием и дизайном сложных интернет-проектов. В команде работает более 80 специалистов, и компания является одним из лучших работодателей в сфере IT.<\/p><p>Вы будете заниматься разработкой и поддержкой автотестов для веб- и бэкенд-приложений. Вам предстоит участвовать в создании тестовой архитектуры и процессов CI/CD, а также интегрировать автотесты в пайплайн. Нужно будет поддерживать баланс между автоматическим и ручным тестированием, анализировать требования и писать тестовую документацию. Также вы будете отслеживать и анализировать результаты прогонов, работать с системами отслеживания ошибок и общаться с разработчиками и аналитиками для улучшения качества продукта.<\/p>",
      "company": "Дабл Ап",
      "location": "",
      "id": 8236,
      "category": "qa",
      "conditions_details": "<ul><li>Оформление по трудовому договору<\/li><li>Удалённый формат работы без внутренней бюрократии<\/li><li>Льготы и меры господдержки для аккредитованных IT-компаний<\/li><li>Долгосрочные проекты (от 6 месяцев)<\/li><li>Возможность участвовать в развитии IT-решений для разных отраслей<\/li><li>Работа в сильной команде профессионалов, готовых делиться опытом<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в QA от 2 лет, в автоматизации — от 1 года<\/li><li>Знаете один или несколько языков для тестов: Java, Python, JavaScript, C#<\/li><li>Имеете опыт работы с фреймворками Selenium, Selenide, Pytest, Playwright, JUnit/TestNG<\/li><li>Умеете проводить API-тестирование с использованием Postman, RestAssured, Swagger<\/li><li>Понимаете принципы CI/CD и имеете опыт работы с Docker<\/li><li>Имеете базовые знания SQL для проверки данных в БД<\/li><li>Будет плюсом: имеете опыт в нагрузочном тестировании (JMeter, k6) и работали с облаками<\/li><\/ul>",
      "views": 79
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://t.me/JulyAsap",
      "created_at": "Tue, 16 Sep 2025 04:38:02 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon1.webp",
      "salary": "~ от 310 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания Новэлект занимается разработкой программных решений для различных отраслей. Она создает продукты, которые помогают бизнесу работать эффективнее.<\/p><p>Вы будете заниматься автоматизацией тестирования. Вам нужно будет применять техники тест-дизайна, работать с тестовой документацией по стандарту IEEE 29119. Также предстоит использовать инструменты Pytest, Selenium, Request и систему контроля версий Git на уровне intermediate. Вам нужно будет организовывать процесс CI в автотестах, писать SQL-запросы с группировкой данных, подзапросами и объединениями таблиц, а также работать с хранимыми процедурами. Вам предстоит работать с mocks, stubs, протоколами HTTP, TCP, TLS, Web Sockets, а также с Rest и SOAP. Нужно будет работать с Linux и Docker. Знание Python обязательно. Вам предстоит работать в архитектурах SOA, MSA, знать паттерны проектирования. Опыт организации процесса автоматизации тестирования с нуля будет плюсом.<\/p>",
      "company": "Новэлект",
      "location": "",
      "id": 8226,
      "category": "qa",
      "conditions_details": "<ul><li>Удаленная работа по РФ<\/li><li>Полная занятость<\/li><li>Зарплата по ТК до 310 000 net, по ГПХ до 345 000 net, по ИП/СЗ до 400 000 net<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете знание техник тест-дизайна: structure based techniques, data flow test<\/li><li>Имеете знание тестовой документации: стандарт ieee 29119 – test documentation, test processes<\/li><li>Умеете работать с инструментами Pytest, Selenium, Request<\/li><li>Умеете работать в scrum командах<\/li><li>Имеете опыт работы с системой контроля версий – Git на уровне intermediate<\/li><li>Умеете организовывать процесс CI в автотестах<\/li><li>Умеете строить SQL запросы с использованием группировки данных (group by), подзапросов, объединения таблиц (join); имеете опыт работы с хранимыми процедурами<\/li><li>Умеете работать/писать mocks, stubs<\/li><li>Умеете работать с протоколами http, tcp, tls, web sockets<\/li><li>Умеете работать с Rest, SOAP<\/li><li>Умеете работать с Linux, docker container<\/li><li>Знаете Python<\/li><li>Имеете понимание и опыт работы в архитектурах SOA, MSA<\/li><li>Знаете паттерны проектирования<\/li><li>Имеете опыт организации процесса автоматизации тестирования с нуля<\/li><li>Имеете опыт работы в области автоматизации от 4 лет<\/li><\/ul>",
      "views": 63
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://t.me/Bojenka_kirill",
      "created_at": "Mon, 15 Sep 2025 20:02:17 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon2.webp",
      "salary": "~ от 276 500 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>ALEX GROUP COMPANY занимается разработкой продуктов для блокчейн-индустрии. Компания создает решения, которые помогают пользователям взаимодействовать с децентрализованными технологиями.<\/p><p>Вы будете разрабатывать и выполнять тест-планы и тест-кейсы для блокчейн-приложений. Вам предстоит проводить функциональное, регрессионное, интеграционное и нагрузочное тестирование. Также вы будете заниматься автоматизацией тестирования с использованием современных инструментов и технологий, анализировать требования и участвовать в их обсуждении с командой разработчиков. Вам нужно будет взаимодействовать с разработчиками для выявления, документирования и исправления дефектов, а также обеспечивать высокое качество релизов и минимизировать риски.<\/p>",
      "company": "ALEX GROUP COMPANY",
      "location": "",
      "id": 8222,
      "category": "qa",
      "conditions_details": "<ul><li>Удаленная работа<\/li><li>Полная занятость<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в качестве QA Engineer от 2 лет<\/li><li>Знаете принципы работы блокчейн-технологий<\/li><li>Имеете опыт работы с инструментами автоматизации тестирования (например, Selenium, JUnit, PyTest)<\/li><li>Имеете опыт работы с системами баг-трекинга (например, Jira)<\/li><li>Понимаете процессы CI/CD<\/li><li>Обладаете отличными навыками аналитического мышления и вниманием к деталям<\/li><li>Умеете работать в команде и имеете хорошие коммуникативные навыки<\/li><li>Будет плюсом опыт тестирования блокчейн-платформ или децентрализованных приложений, знание языков программирования для написания автотестов (например, Python, JavaScript) и опыт работы с Docker, а также понимание основ криптографии<\/li><\/ul>",
      "views": 89
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125337144",
      "created_at": "Mon, 15 Sep 2025 17:51:29 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon3.webp",
      "salary": "от 160 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>IT-компания Riverstart с 2012 года создает удобные сервисы для бизнеса, трансформируя сложные идеи. Компания входит в реестр МТК и аккредитована в Минцифры. Среди продуктов – высоконагруженные сервисы для веба и мобайла, включая сайты, порталы, мобильные приложения, CRM, LMS и ERP-системы. Riverstart занимает высокие позиции в рейтингах разработчиков для среднего бизнеса в России и в сфере поддержки и развития сайтов.<\/p><p>Вы будете заниматься автоматизацией тестирования, писать и поддерживать автоматизированные тесты, а также развиваться в области автоматизированного тестирования и инфраструктурной разработки. Вам нужно будет анализировать логи и работать с инструментами для их анализа, использовать системы контроля версий и CI/CD, а также работать с технологиями API.<\/p>",
      "company": "Риверстарт",
      "location": "",
      "id": 8202,
      "category": "qa",
      "conditions_details": "<ul><li>Оформление по ТК РФ или в удобном формате<\/li><li>Возможность работать удалённо или в офисе<\/li><li>Дополнительное премирование за вклад в командную работу<\/li><li>Разнообразные проекты и заказчики<\/li><li>ДМС<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт автоматизации тестирования от 2,5 лет<\/li><li>Знаете один из языков программирования Python или Java<\/li><li>Имеете опыт работы с технологиями API (REST, SOAP)<\/li><li>Понимаете протоколы HTTP/WS и знаете инструменты для работы с API<\/li><li>Умеете писать SQL-запросы на уровне простой и/или средней сложности<\/li><li>Имеете умение анализировать логи и опыт работы с инструментами для их анализа (Kibana)<\/li><li>Имеете опыт работы с системами контроля версий и CI/CD: Git, GitlabCI<\/li><li>Знаете инструменты JUnit 5, Gradle, Selenide, Selenoid, RestAssured, Allure<\/li><li>Имеете опыт работы Kafka/RabbitMQ<\/li><li>Имеете опыт автоматизации тестирования backend<\/li><li>Будет плюсом: имеете опыт тестирования микросервисов, знаете операционные системы Linux и Windows, имеете высшее техническое образование в сфере IT, математическое/инженерное образование, готовы развиваться, находить информацию, изучать и использовать инструменты<\/li><\/ul>",
      "views": 85
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125343733",
      "created_at": "Mon, 15 Sep 2025 17:32:34 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/X5_Tech_20250506155343.webp",
      "salary": "~ от 214 300 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>X5 Group — это крупная российская розничная компания, которая управляет популярными продуктовыми сетями, такими как «Пятёрочка», «Перекрёсток» и «Чижик». X5 Tech выступает как основной цифровой партнёр для этих сетей и других бизнесов X5 Group. Команда X5 Tech насчитывает более 5000 специалистов, которые создают решения для улучшения работы 372 тысяч сотрудников группы и обеспечивают удобство покупок для миллионов покупателей.<\/p><p>В дирекции по разработке открыта вакансия QA Automation Engineer. Вы будете автоматизировать тестирование API и UI, участвовать в разработке стратегии автоматизации и обучать коллег лучшим практикам. Вам предстоит развивать CI/CD вместе с командами продуктов, создавать умные и эффективные автотесты, поддерживать сценарии в актуальном состоянии и анализировать результаты их запуска. Также нужно будет готовить отчёты и предлагать улучшения для тестируемых систем, внедряя автотесты там, где это целесообразно.<\/p>",
      "company": "X5 Tech",
      "location": "",
      "id": 8187,
      "category": "qa",
      "conditions_details": "<ul><li>Официальное оформление с белой зарплатой и ежеквартальными премиями<\/li><li>Возможность работать удалённо или в гибридном формате<\/li><li>Широкий пакет ДМС, включая выезд за рубеж и стоматологию, а также страхование жизни и здоровья<\/li><li>Возможность учиться и развиваться за счёт компании: внешние тренинги, семинары, участие в конференциях, программы развития цифровых и управленческих навыков, онлайн и офлайн мастер-классы, корпоративный университет и школа наставников<\/li><li>Программы мотивации для спикеров и авторов: внутренняя школа Speak Up School, Write Up, ачивки и баллы за выступления, подготовка спикеров к конференциям, сообщество авторов на Хабре и возможность делиться опытом с внутренними и внешними экспертами<\/li><li>Обмен опытом через 12 технических комьюнити (от java до devops)<\/li><li>Яркая корпоративная жизнь с мероприятиями, конкурсами и возможностями для творческой реализации: митапы, демо-дни, открытые микрофоны, день IT-специалиста, программы волонтерства, корпоративное предпринимательство X5 Idea Challenge<\/li><li>Забота о благополучии сотрудников: 7 спортивных сообществ (бег, футбол, волейбол, баскетбол, хоккей, лыжи, триатлон), ежегодная Неделя здоровья<\/li><li>Скидки в экосистеме бизнесов Х5 («Пятёрочка», «Перекрёсток», «Много лосося», «Перекресток Впрок»)<\/li><li>Программа привилегий Prime-zone (скидки на товары и услуги от компаний-партнёров)<\/li><li>Материальная помощь сотрудникам в сложных жизненных ситуациях<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт в автоматизированном тестировании от 3 лет<\/li><li>Имеете опыт разработки на C#<\/li><li>Умеете разрабатывать фреймворки автоматизации<\/li><li>Умеете работать с REST API<\/li><li>Умеете работать с базами данных<\/li><li>Имеете опыт работы с Docker<\/li><li>Знаете инструменты CI/CD<\/li><\/ul>",
      "views": 82
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125345973",
      "created_at": "Mon, 15 Sep 2025 17:27:47 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/STARTRIBE_20250723162129.webp",
      "salary": "~ от 243 000 ₽",
      "title": "Тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания занимается разработкой и поддержкой сложных IT-проектов для крупных международных компаний, в основном это B2B решения для игровой и спортивной индустрии. Сейчас ищет специалиста для работы над мобильным приложением.<\/p><p>Вы будете тестировать функционал для Android, писать новые автотесты на Kotlin с использованием Kaspresso. Вам нужно будет организовывать и улучшать процессы тестирования вместе с командой QA и инженерами, а также развивать инфраструктуру для тестирования приложений.<\/p>",
      "company": "STARTRIBE",
      "location": "",
      "id": 8180,
      "category": "qa",
      "conditions_details": "<ul><li>Конкурентная заработная плата, соответствующая уровню навыков и ожиданиям<\/li><li>Удаленная работа из любой локации<\/li><li>Интересные задачи, перспективные проекты и передовые технологии<\/li><li>Работа в креативной и дружной русскоязычной команде<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы от 3 до 6 лет<\/li><li>Знаете Kotlin, Kaspresso и Espresso<\/li><li>Понимаете основные принципы тестирования мобильных приложений<\/li><li>Имеете опыт работы с TestRail или AllureTestOps<\/li><\/ul>",
      "views": 76
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125348788",
      "created_at": "Mon, 15 Sep 2025 17:20:32 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon2.webp",
      "salary": "~ от 159 400 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Группа КБ-12 — это коммуникационная группа, которая занимается созданием современных веб-продуктов. Компания делает яркие лендинги, корпоративные сайты, сложные веб-сервисы и интернет-магазины. Главная цель — не просто создать сайт, а сделать так, чтобы цифровой опыт решал бизнес-задачи клиентов и нравился пользователям. В команде ценят экспертизу, инициативу и ответственность за общий результат.<\/p><p>В связи с увеличением проектов, в команду требуется Тестировщик. Вы будете заниматься полным циклом тестирования веб-проектов на всех этапах разработки. Вам предстоит тесно общаться с менеджерами, дизайнерами и разработчиками. Нужно будет анализировать и тестировать требования, чтобы выявлять противоречия и \"узкие места\" на ранних этапах. Вам нужно будет разрабатывать тестовую документацию, такую как чек-листы, тест-кейсы и mind maps. Вы будете выполнять все виды тестирования: функциональное, регрессионное, кроссбраузерное и usability-тестирование. Также предстоит тестировать API с использованием Postman и четко описывать, приоритизировать и документировать баги в Jira. Вы будете участвовать в планировании и оценке сроков тестирования.<\/p>",
      "company": "Группа КБ-12",
      "location": "",
      "id": 8175,
      "category": "qa",
      "conditions_details": "<ul><li>Зарплата обсуждается на собеседовании<\/li><li>Возможность работать из любой точки мира или из офиса рядом с метро Бауманская<\/li><li>Возможность проходить обучение, курсы и сертификации за счет компании<\/li><li>Возможность карьерного роста внутри компании<\/li><li>Развитая корпоративная культура<\/li><li>Участие в экопроектах компании<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт коммерческого тестирования веб-приложений от 1 года<\/li><li>Понимаете жизненный цикл разработки ПО и принципы тестирования<\/li><li>Уверенно работаете с Chrome DevTools для анализа кода, работы с сетью и отладки<\/li><li>Имеете опыт тестирования REST API через Postman или аналоги<\/li><li>Понимаете основы клиент-серверной архитектуры, HTTP/HTTPS, работу cookies<\/li><li>Имеете опыт работы с Jira и Confluence<\/li><li>Умеете работать с макетами в Figma<\/li><li>Обладаете высоким уровнем ответственности, внимательности и развитым критическим мышлением<\/li><li>Умеете четко и грамотно излагать мысли как устно, так и письменно<\/li><li>Будет плюсом: опыт написания автотестов на Selenium / Cypress / Playwright<\/li><li>Будет плюсом: базовые знания SQL (простые SELECT, JOIN)<\/li><li>Будет плюсом: навыки работы с командной строкой (Linux/macOS Terminal, PowerShell)<\/li><li>Будет плюсом: понимание принципов CI/CD<\/li><li>Будет плюсом: базовые знания HTML / CSS / JavaScript / TypeScript<\/li><\/ul>",
      "views": 76
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://t.me/ansharkunova",
      "created_at": "Mon, 15 Sep 2025 09:11:57 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon3.webp",
      "salary": "от 250 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания Top Selection занимается разработкой продуктов для бизнеса. Вы будете писать и поддерживать автотесты, следить за стабильностью тестовой среды. Вам нужно будет оценивать, сколько времени займут задачи по тестированию, готовить сценарии для проверок и разрабатывать фреймворк для тестирования. Также вы будете определять, какие проверки лучше автоматизировать, а какие оставить для ручного выполнения.<\/p>",
      "company": "Top Selection",
      "location": "",
      "id": 8143,
      "category": "qa",
      "conditions_details": "<ul><li>Занятость: fulltime<\/li><li>Оформление: ИП<\/li><li>Локация: РФ<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт автоматизации тестирования от 4 лет на JVM платформе (Java Kotlin)<\/li><li>Умеете строить стратегии тестирования и автоматизации продуктов<\/li><li>Знаете функциональное, интеграционное и регрессионное тестирование<\/li><li>Имеете опыт составления плана тестирования и тест-анализа<\/li><li>Имеете опыт работы с REST API и брокером сообщений Kafka<\/li><li>Имеете опыт работы с PostgreSQL, Allure TestOps<\/li><li>Имеете опыт работы с CI/CD инструментами и построения пайплайнов<\/li><\/ul>",
      "views": 78
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://t.me/maria_biktyakova",
      "created_at": "Mon, 15 Sep 2025 07:02:08 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/Selecty_20250521154136.webp",
      "salary": "от 250 000 ₽",
      "title": "qa engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Крупный финтех-проект ищет специалиста для команды FastPay. Компания создает продукты для финансового сектора.<\/p><p>Вы будете заниматься тестированием веб и мобильных приложений в соотношении 50 на 50. Вам предстоит проводить как ручное, так и автоматическое тестирование, а также работать с Rest API и интеграционным тестированием.<\/p>",
      "company": "Selecty",
      "location": "",
      "id": 8125,
      "category": "qa",
      "conditions_details": "<ul><li>Расширенный ДМС<\/li><li>IT-Аккредитация<\/li><li>Предоставление техники<\/li><li>Личный HR координатор<\/li><li>Скидки у партнёров<\/li><li>Стабильный долгосрочный проект<\/li><li>Оформление по ТК РФ / ТК РБ / ИП<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в автотестировании на Java от 3 лет<\/li><li>Имеете опыт в автотестировании мобильных приложений с использованием Appium<\/li><li>Имеете опыт работы с Rest API<\/li><li>Имеете опыт в интеграционном тестировании<\/li><li>Имеете опыт написания библиотек и инструментов для автоматизации тестирования<\/li><\/ul>",
      "views": 71
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125311340",
      "created_at": "Mon, 15 Sep 2025 06:52:10 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/_20250915065210.webp",
      "salary": "~ от 180 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания РЭДИЕНС занимается разработкой умного ПО в сферах Web3, ИИ и финтеха. Миссия компании — создавать инновационные решения, которые делают жизнь людей проще и лучше. Ценности компании — командная работа, открытость и постоянное развитие. Компания имеет более 5 лет опыта на рынке и множество успешных проектов.<\/p><p>Вы будете тестировать финтех-продукт компании, который используют тысячи клиентов. Ваша работа напрямую повлияет на качество и надежность сервиса. Вам предстоит проводить функциональное, регрессионное, smoke и приемочное тестирование релизов. Также нужно будет проводить кроссплатформенное и кроссбраузерное тестирование. Вам нужно будет вести тестовую документацию, такую как тест-кейсы и чек-листы, а также выполнять и обрабатывать результаты тестирования, локализовывать и описывать дефекты. Вы будете участвовать в развитии процессов тестирования и активно общаться с разработчиками, аналитиками и DevOps для улучшения качества продукта.<\/p>",
      "company": "РЭДИЕНС",
      "location": "",
      "id": 8118,
      "category": "qa",
      "conditions_details": "<ul><li>Удаленная работа с необходимостью быть на связи<\/li><li>Оформление в испытательный срок СМЗ, после — по ТК РФ<\/li><li>График работы с 10:00 до 19:00<\/li><li>Испытательный срок 3 месяца<\/li><li>Оклад на руки 150 000 рублей + KPI с первого месяца<\/li><li>Возможность карьерного роста до ведущего тестировщика ПО<\/li><li>С первого дня предоставляется ввод в должность и поддержка лояльного руководства<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете коммерческий опыт тестирования web-приложений от 2 лет<\/li><li>Имеете опыт планирования работ по тестированию, контроля выполнения задач и формирования отчетности<\/li><li>Знаете техники тест-анализа и тест-дизайна<\/li><li>Уверенно понимаете клиент-серверную архитектуру и умеете четко различать frontend/backend-ошибки<\/li><li>Имеете опыт работы с REST API, используя Swagger, Postman (или аналоги), умеете читать и анализировать JSON/XML<\/li><li>Имеете опыт работы с инструментами тестирования сети, такими как Charles, Fiddler<\/li><li>Умеете работать с базами данных, писать SQL-запросы (SELECT, JOINs) для проверки данных и логики работы системы<\/li><li>Умеете локализовывать и описывать баги, используя DevTools (браузерные консоли, Network), анализировать логи (например, Kibana), снимки экрана и данные запросов/ответов<\/li><li>Понимаете жизненный цикл дефекта и имеете опыт работы с Jira (или аналогами), умеете оформлять документацию в Confluence<\/li><li>Имеете опыт тестирования в процессах CI/CD, понимаете принципы и работали с автотестами в пайплайне<\/li><li>Будет плюсом: имеете опыт автоматизации тестирования на любом языке/фреймворке (Java/Selenium, Python/pytest, JavaScript/Playwright и т.д.)<\/li><\/ul>",
      "views": 89
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125311862",
      "created_at": "Mon, 15 Sep 2025 06:51:53 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/X5_Tech_20250506155343.webp",
      "salary": "~ от 205 300 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>X5 Tech — это IT-компания, которая помогает развивать торговые сети X5 Group. В команде более 5000 специалистов, которые создают решения для удобства сотрудников и покупателей. Компания тестирует все свои IT-проекты, проводя ручное и автоматизированное тестирование, а также проверяя нагрузку и безопасность систем.<\/p><p>Вы будете оценивать время на тестирование, создавать документацию, такую как тестовые сценарии и отчеты. Вам нужно будет проводить функциональное, регрессионное и интеграционное тестирование, анализировать ошибки и работать с дефектами. Также предстоит актуализировать тестовую модель, создавать и запускать автотесты, поддерживать и развивать существующие решения в области автоматизации, организовывать автоматизированное тестирование бизнес-процессов и формировать требования к автоматизации.<\/p>",
      "company": "X5 Tech",
      "location": "",
      "id": 8117,
      "category": "qa",
      "conditions_details": "<ul><li>Официальное оформление с белой зарплатой и ежеквартальными премиями<\/li><li>Возможность работать удалённо или в гибридном формате<\/li><li>Широкий пакет ДМС, включая выезд за рубеж и стоматологию, страхование жизни и здоровья<\/li><li>Возможность учиться и развиваться за счёт компании: тренинги, семинары, конференции, программы развития навыков, корпоративный университет<\/li><li>Программы мотивации для спикеров и авторов, обмен опытом через технические сообщества<\/li><li>Яркая корпоративная жизнь с мероприятиями и конкурсами<\/li><li>Забота о благополучии сотрудников: спортивные сообщества, Неделя здоровья<\/li><li>Скидки в экосистеме бизнесов Х5 и программы привилегий от партнёров<\/li><li>Материальная помощь в сложных жизненных ситуациях<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт в тестировании от 3 лет (Web/Mobile/Desktop)<\/li><li>Знаете теорию тестирования и техники тест-дизайна<\/li><li>Работаете с SQL-запросами<\/li><li>Работаете с REST API<\/li><li>Имеете опыт тестирования многокомпонентных продуктов<\/li><\/ul>",
      "views": 93
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://tradingview.teamtailor.com/jobs/6121323-senior-qa-engineer",
      "created_at": "Mon, 15 Sep 2025 06:04:06 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/TradingView_20250915060517.webp",
      "salary": "~ от 320 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания TradingView — это платформа для графиков и социальная сеть, которой пользуются более 100 миллионов трейдеров и инвесторов по всему миру для поиска возможностей на глобальных рынках.<\/p><p>Вы будете отвечать за полный контроль качества бэкенд-сервисов на всех этапах разработки и поддержки. Вам нужно будет проектировать, выполнять и поддерживать стресс/нагрузочные тесты для проверки производительности системы и выявления узких мест. Также предстоит воспроизводить, анализировать и документировать ошибки с конкретными шагами для разработчиков. Вы будете поддерживать CI/CD конвейеры, участвовать в управлении релизами и развертывать приложения в продакшене.<\/p>",
      "company": "TradingView",
      "location": "",
      "id": 8110,
      "category": "qa",
      "conditions_details": "<ul><li>Полностью удаленная работа<\/li><li>Возможность релокации<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете более 5 лет опыта в тестировании бэкенд-приложений<\/li><li>Понимаете принципы тестирования и умеете применять их на практике<\/li><li>Понимаете внутреннее устройство компьютерных систем<\/li><li>Знаете клиент-серверную архитектуру, веб-сокеты, протокол HTTP и RESTful API<\/li><li>Имеете опыт тестирования API (ручного и автоматизированного)<\/li><li>Умеете писать скрипты для автоматизации задач и тестов<\/li><li>Владеете Unix-подобными системами и инструментами командной строки<\/li><li>Имеете опыт работы с контейнеризацией (Docker) и системами мониторинга (Prometheus, Grafana, Zabbix)<\/li><li>Будет плюсом: имеете опыт нагрузочного тестирования, опыт автоматизации тестов, опыт работы в финтех-сфере (платежные системы, торговые платформы), опыт работы с CI/CD инструментами (Jenkins, GitLab CI/CD), знакомы с системами управления тестированием (например, TestRail, Allure TestOps), понимаете распределенные системы и их компромиссы, имеете опыт оркестрации Kubernetes для развертывания и масштабирования<\/li><\/ul>",
      "views": 83
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125306230",
      "created_at": "Mon, 15 Sep 2025 06:00:52 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon1.webp",
      "salary": "до 250 000 ₽",
      "title": "Тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>DCloud — это сообщество разработчиков, которое существует больше 10 лет. Его основали профессионалы из крупных IT-компаний. Компания занимается разработкой проектов с нуля для больших корпораций и стартапов.<\/p><p>Вы будете тестировать системы с микросервисной архитектурой. Вам предстоит заниматься авто и ручным тестированием фронтенда, бэкенда, API и запросов к базам данных. Нужно будет самостоятельно писать ручные тесты, а потом автоматизировать их. Также вы будете запускать автотесты и анализировать результаты их выполнения.<\/p>",
      "company": "DCloud",
      "location": "",
      "id": 8108,
      "category": "qa",
      "conditions_details": "<ul><li>График работы 5/2 с возможностью гибкого начала дня (с 9 до 18 или с 10 до 19 по Москве)<\/li><li>Удаленная работа по всей территории РФ<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы от 3 до 6 лет<\/li><li>Понимаете методологии разработки ПО<\/li><li>Понимаете клиент-серверную архитектуру<\/li><li>Понимаете, как работают компьютерные сети и основные протоколы: HTTP(S), TCP/IP, UDP<\/li><li>Умеете использовать Git, BitBucket, Confluence<\/li><li>Имеете базовое понимание работы СУБД PostgreSQL<\/li><li>Знаете SQL<\/li><li>Будет плюсом, если имеете опыт автоматизации тестирования на Java от 1 года, умеете проектировать тест-кейсы и готовить тестовые данные, имеете опыт работы с SOAP, REST, SQL, знаете ООП и паттерны разработки автотестов, имеете опыт интеграции автотестов в CI/CD-пайплайны, а также опыт проведения нагрузочного тестирования и анализа результатов<\/li><\/ul>",
      "views": 81
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125306206",
      "created_at": "Mon, 15 Sep 2025 05:59:13 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon4.webp",
      "salary": "~ от 205 500 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Finstar Financial Group — это крупный международный холдинг, который работает с компаниями по всему миру. Команда компании занимается проектами в Юго-Восточной Азии, Индии и Мексике. Основной бизнес — это цифровое кредитование через мобильные приложения и веб-сайты. Компания понимает потребности клиентов и предлагает им доступную альтернативу обычным банкам. Благодаря автоматизации и аналитическому подходу, Finstar Financial Group занимает лидирующие позиции во всех странах присутствия и достигает высоких бизнес-показателей.<\/p><p>Вы будете улучшать качество существующих и новых решений. Вам предстоит проводить ручное тестирование бэкэнда, CRM и мобильных приложений (Flutter). Также нужно будет поддерживать и разрабатывать автотесты, используя стек Java + TestNG + Rest Assured + Allure. Вам нужно будет выполнять регрессионное тестирование (ручное и автоматизированное), участвовать в анализе инцидентов, воспроизводить и документировать ошибки, подготавливать баг-репорты и проводить исследовательское тестирование. Кроме того, вы будете формировать тест-кейсы.<\/p>",
      "company": "FFG",
      "location": "",
      "id": 8106,
      "category": "qa",
      "conditions_details": "<ul><li>Полная удалённая работа<\/li><li>Прозрачная система мотивации: белая заработная плата в валюте + премии по результатам выполнения KPI<\/li><li>Отсутствие бюрократии и высокая степень свободы, быстрые решения<\/li><li>Перспективы карьерного роста, прямое влияние на бизнес и возможность использовать новейшие технологии<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете высшее образование<\/li><li>Имеете опыт работы в QA от 3 лет<\/li><li>Имеете опыт написания автотестов на Java от 1 года (web+API)<\/li><li>Хорошо знаете и понимаете технику тест-дизайна<\/li><li>Хорошо понимаете веб-технологии, мобайл, фронтенд, бэкэнд, браузеры, API и как всё это работает<\/li><li>Имеете опыт работы с микросервисной архитектурой<\/li><li>Имеете опыт ручного тестирования API с использованием Postman или аналогов<\/li><li>Имеете опыт работы с Jira, системами логирования, базами данных MS SQL/Postgres, Kafka<\/li><li>Опыт работы в финтех проектах, стартапах, CRM системах будет плюсом<\/li><\/ul>",
      "views": 87
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125268443",
      "created_at": "Sat, 13 Sep 2025 07:05:23 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon2.webp",
      "salary": "~ от 258 900 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>SSP SOFT — это IT-компания, которая создает уникальные цифровые решения для бизнеса. Команды компании реализовали более 1000 проектов для клиентов из финансового и государственного секторов, а также из сфер ритейла и промышленности. Компания ценит индивидуальный подход к каждому соискателю, учитывает опыт при определении проекта и предлагает долгосрочное сотрудничество.<\/p><p>Вы будете заниматься автоматизацией тестирования, разрабатывать и внедрять стратегии тестирования для достижения целей команды. Вам нужно будет ориентироваться в Java, настраивать процессы сборки с нуля для повышения эффективности работы, а также уверенно работать с Jira, Confluence или TestIt для организации задач и ведения документации. Вам предстоит разбираться в принципах CI/CD, владеть Git для автоматизации процессов релиза и интеграции, а также обладать глубокими знаниями баз данных (SQL или NoSQL) и понимать современные архитектурные подходы, такие как DDD и микросервисы.<\/p>",
      "company": "SSP SOFT",
      "location": "",
      "id": 8054,
      "category": "qa",
      "conditions_details": "<ul><li>Работа с вовлеченным коллективом<\/li><li>Достойная заработная плата, выплачиваемая точно в срок<\/li><li>Гибкий график работы<\/li><li>Полностью удаленная работа (на территории РФ)<\/li><li>Корпоративный ДМС<\/li><li>Социальная поддержка для попавших в тяжелое положение<\/li><li>Возможность роста посредством реализации индивидуальных программ развития<\/li><li>Программа адаптации на проекте<\/li><li>Программа движения по карьерной лестнице с необходимым обучением и практикой<\/li><li>Минимум бюрократии<\/li><li>Программа рекомендаций с бонусами<\/li><li>Программа социальной ответственности: материальная помощь, подарочные сертификаты при рождении детей или на свадьбу<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете не менее 4-х лет опыта в автоматизации тестирования и умеете строить эффективные тестовые сценарии<\/li><li>Способны разрабатывать и внедрять стратегии тестирования, которые помогают команде достигать поставленных целей<\/li><li>Свободно ориентируетесь в Java<\/li><li>Знаете инструменты сборки и умеете настраивать процессы с нуля для повышения эффективности работы<\/li><li>Уверенно работаете с Jira, Confluence или TestIt для организации задач, ведения документации и отслеживания прогресса<\/li><li>Хорошо разбираетесь в принципах CI/CD, владеете Git и можете автоматизировать процессы релиза и интеграции<\/li><li>Обладаете глубокими знаниями баз данных — будь то SQL или NoSQL — понимаете особенности ACID, eventual consistency и другие концепции<\/li><li>Знакомы с современными архитектурными подходами: DDD, микросервисы — понимаете их преимущества и нюансы внедрения<\/li><li>Обладаете вниманием к деталям, инициативностью и постоянно ищете способы разобраться в сложных технических задачах для достижения лучших результатов<\/li><li>Будет преимуществом, если у вас есть опыт работы в банковской сфере, а также английский язык на уровне чтения технической документации<\/li><\/ul>",
      "views": 81
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125269686",
      "created_at": "Sat, 13 Sep 2025 07:04:25 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon2.webp",
      "salary": "от 230 000 ₽",
      "title": "Тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>ITVolna.tech — это быстрорастущая платформа, которая помогает ведущим разработчикам и аналитикам 1С общаться с крупными российскими компаниями. У компании много партнеров, которые ищут тестировщиков Python для работы с современными конфигурациями и сложными задачами по интеграции.<\/p><p>Вы будете заниматься разработкой и поддержкой тестовой документации, создавая детальные тест-кейсы и тест-планы. Вам нужно будет проводить функциональное, нагрузочное и регрессионное тестирование, а также выявлять, регистрировать и сопровождать дефекты, взаимодействуя с командой разработки. Кроме того, вы будете разрабатывать и поддерживать UI и API автотесты на Python, поддерживать фреймворк автотестирования и внедрять новые инструменты. Вам предстоит составлять и корректировать планы тестирования, активно взаимодействовать с другими командами для обеспечения высокого качества продукта.<\/p>",
      "company": "Volna.tech",
      "location": "",
      "id": 8052,
      "category": "qa",
      "conditions_details": "<ul><li>Удалённая работа с первого дня<\/li><li>Прямое сотрудничество с компаниями-партнёрами ITVolna.tech<\/li><li>Оформление по ИП или ООО<\/li><li>Гибкая система вознаграждения<\/li><li>Job offer с учётом ваших финансовых ожиданий<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете высшее техническое образование в области информационных технологий, программирования или смежных дисциплин<\/li><li>Понимаете теорию тестирования и применяете техники тест-дизайна<\/li><li>Имеете опыт разработки тестовой документации: тест-кейсы, чек-листы<\/li><li>Знаете протоколы HTTP/WS и имеете опыт работы с API (REST) и инструментами (Postman, curl)<\/li><li>Имеете опыт работы с брокерами сообщений и инструментами анализа логов (Kibana)<\/li><li>Владеете навыками работы с отладочными прокси-серверами (Fiddler, Charles)<\/li><li>Владеете тестовыми фреймворками и инструментами автоматизации (Selenium WebDriver, Python)<\/li><li>Имеете опыт работы с системами контроля версий (Git) и CI/CD<\/li><li>Умеете выполнять простые запросы к базам данных<\/li><li>Обладаете ответственностью и внимательностью к деталям<\/li><li>Имеете аналитическое мышление и способность к системному подходу<\/li><li>Коммуникабельны и умеете работать в команде<\/li><li>Проявляете инициативность и стремление к постоянному развитию<\/li><li>Имеете опыт работы в тестировании программного обеспечения от 4 лет, в автоматизации<\/li><li>Знаете английский язык на уровне, достаточном для чтения технической документации<\/li><li>Будет плюсом наличие сертификатов в области тестирования ПО (например, ISTQB)<\/li><\/ul>",
      "views": 84
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://career.habr.com/vacancies/1000161678",
      "created_at": "Fri, 12 Sep 2025 21:32:46 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/2_20250322230558.svg",
      "salary": "~ от 243 000 ₽",
      "title": "qa engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>2ГИС.Геопоток — это система, которая помогает бизнесу следить за персоналом и транспортом. Она делает процессы прозрачнее, снижает расходы и улучшает работу сотрудников, которые работают в разъездах. Продукт подходит для разных сфер: промышленности, нефтегазового сектора, банков, курьерских служб и других компаний с распределенными командами.<\/p><p>Вам предстоит тестировать сложный продукт, который имеет большой потенциал и на развитие которого можно влиять. Работа будет проходить в команде с горизонтальной структурой, где нет бюрократии и сложных иерархий. Будет применяться активный подход к решению задач с фокусом на процессы и результат. Вам нужно будет анализировать требования и разрабатывать тест-кейсы, участвовать в тестировании сложного высоконагруженного продукта. Также предстоит автоматизировать тестирование UI и API, писать автотесты и участвовать в развитии тестовой инфраструктуры, интегрировать автотесты в пайплайны CI/CD. Вы будете следить за выпуском новых функций от начала проработки до запуска в эксплуатацию. Вам нужно будет много общаться в удаленном формате, договариваться и согласовывать решения с разными участниками проекта, проявляя эмпатию и лидерские качества, а также внедрять стандарты и лучшие практики тестирования программного обеспечения.<\/p>",
      "company": "2ГИС",
      "location": "",
      "id": 8020,
      "category": "qa",
      "conditions_details": "<ul><li>Работа в аккредитованной IT-компании<\/li><li>Возможность работать удалённо, компания ценит специалиста, а не его локацию<\/li><li>Гибкий график работы, главное — выполнять задачи в срок и быть на связи с коллегами<\/li><li>Полностью белая зарплата, размер обсуждается на собеседовании<\/li><li>Есть ДМС, штатный терапевт, невролог, мед. консультант и другие IT-плюшки<\/li><li>Компания готова помогать с выступлениями на конференциях и статьями для Хабра, если есть желание делиться опытом<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт в автоматизации тестирования на Python от 3 лет<\/li><li>Понимаете основы тестирования и владеете техниками тест-дизайна<\/li><li>Имеете опыт анализа требований и выявления потенциальных проблем на ранних этапах разработки<\/li><li>Умеете структурировано и доступно выражать свои мысли, а также аргументированно отстаивать свою позицию<\/li><li>Будет плюсом, если вы запускали что-то в Docker или интересовались его работой, читали или слышали про микросервисы и хотите разобраться глубже, настраивали CI/CD, интересуетесь DevOps-подходами и TDD, пробовали Go, PostgreSQL, Kafka или RabbitMQ<\/li><\/ul>",
      "views": 80
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://t.me/V_recruiting",
      "created_at": "Fri, 12 Sep 2025 21:16:39 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/NDA_20250908093037.webp",
      "salary": "~ от 202 400 ₽",
      "title": "Тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания занимается созданием продуктов, которые помогают пользователям общаться и делиться информацией. В компании создают удобные и функциональные платформы для широкой аудитории.<\/p><p>Вы будете изучать и анализировать технические характеристики систем. Вам нужно будет сотрудничать с разработчиками для создания планов тестирования. Также предстоит выполнять тест-кейсы вручную или автоматически, анализировать результаты и оценивать код продукта согласно технической документации. Вы будете создавать журналы для документирования этапов тестирования и найденных ошибок, сообщать об ошибках команде разработчиков и помогать в устранении неполадок. Вам предстоит проводить тестирование после релиза или интеграции и работать с разными командами для обеспечения качества на всех этапах разработки.<\/p>",
      "company": "NDA",
      "location": "",
      "id": 7998,
      "category": "qa",
      "conditions_details": "<ul><li>Зарплатная вилка: 2200$-3600$<\/li><li>Удалённая работа<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в качестве тестировщика обеспечения качества или на аналогичной должности<\/li><li>Имеете опыт в методологии обеспечения качества<\/li><li>Имеете опыт тестирования API<\/li><li>Знаете языки программирования Javascript/Typescript и имеете опыт тестирования API/UI<\/li><li>Имеете опыт работы с современными методологиями, инструментами и процессами обеспечения качества программного обеспечения<\/li><li>Имеете опыт работы в процессе разработки Agile/Scrum<\/li><li>Имеете практические навыки работы с базами данных и написания SQL-скриптов<\/li><li>Имеете сильные коммуникативные навыки и навыки сотрудничества<\/li><li>Хорошо знаете английский язык<\/li><\/ul>",
      "views": 85
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125264201",
      "created_at": "Fri, 12 Sep 2025 08:08:49 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/Employcity_20250513050850.webp",
      "salary": "~ от 239 000 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Международная IT-компания занимается разработкой и поддержкой сложных проектов, в основном это развлекательные онлайн-сервисы. Сейчас в команду ищут AQA/SDET Senior.<\/p><p>Вам предстоит увеличивать покрытие автотестами существующего и нового функционала, автоматизировать backend, поддерживать автотесты на C# (Rest API), разрабатывать тестовые заглушки и сервисы на Dotnet, а также конфигурировать сборки на CI-сервере (TeamCity) и тестовые стенды (Linux, Docker)<\/p>",
      "company": "Employcity",
      "location": "",
      "id": 7988,
      "category": "qa",
      "conditions_details": "<ul><li>Достойный уровень заработной платы (обсуждается индивидуально)<\/li><li>Опытный коллектив, возможность перенять ценный опыт<\/li><li>ДМС после 6 месяцев работы<\/li><li>Гибкое начало рабочего дня<\/li><li>Оплачиваемые отпускные и больничные<\/li><li>Минимум бюрократии<\/li><li>Отсутствие дресс-кода<\/li><li>4 выходных дня в год за счёт компании<\/li><li>Частичная компенсация английского языка или психолога (на выбор)<\/li><li>Компенсация спортзала<\/li><li>Годовой бонус по результатам работы<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт написания автотестов на C# от 1 года<\/li><li>Знаете NUnit/xUnit<\/li><li>Умеете разбираться с деплоймент-тулами и понимаете принципы DevOps<\/li><li>Знаете SQL на уровне написания запросов<\/li><li>Понимаете методологии тестирования<\/li><li>Умеете написать чек-лист/тест-кейсы для функционала, который будет покрываться автотестами<\/li><li>Будет плюсом: работа с Dotnet Core, опыт конфигурирования CI-серверов (TeamCity), опыт работы с MySQL, понимание принципов функционирования технологии блокчейн, навыки работы в консоли Linux<\/li><\/ul>",
      "views": 109
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/123467099",
      "created_at": "Thu, 11 Sep 2025 15:27:37 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/Bell_Integrator_20250612114848.webp",
      "salary": "~ от 220 000 ₽",
      "title": "qa тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Bell Integrator — крупный системный интегратор в России. В компании работает более 2500 специалистов, которые занимаются разработкой и сопровождением крупных информационных систем. Bell Integrator реализует проекты по всей России для ведущих финансовых, телеком и ритейл компаний.<\/p><p>Вы будете заниматься автоматизацией процессов тестирования, сбора статистики и составления отчетов. Вам нужно будет настраивать и поддерживать автоматизированные тестовые сценарии для функционального и регрессионного тестирования. Также предстоит разрабатывать, обслуживать и улучшать автоматизированные тестовые скрипты, интегрировать автотесты в процессы CI/CD и анализировать требования для определения тестовых сценариев для автоматизации<\/p>",
      "company": "Bell Integrator",
      "location": "",
      "id": 7955,
      "category": "qa",
      "conditions_details": "<ul><li>Достойный уровень заработной платы (по итогам технического интервью)<\/li><li>Работа в аккредитованной IT компании<\/li><li>Сотрудничество по ТК РФ, ИП, ГПХ<\/li><li>ДМС, расширенные возможности стандартного социального пакета<\/li><li>Корпоративный абонемент на фитнес и курсы английского языка<\/li><li>Командная работа по гибким методологиям<\/li><li>Реферальная система «Приведи друга – получи бонус»<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт тестирования mobile/web приложений от 3 лет<\/li><li>Имеете опыт работы с Rest API<\/li><li>Имеете опыт работы с SQL/NoSQL базами данных на уровне сложных запросов и выгрузок (join, View и т.д.)<\/li><li>Имеете опыт покрытия новой функциональности инструментами автотестирования на Java<\/li><li>Имеете опыт работы с интеграционным тестированием<\/li><li>Имеете опыт работы с CI/CD (Jenkins, GitlabCI)<\/li><li>Имеете опыт работы с брокерами сообщений (Kafka, RabbitMQ или аналоги)<\/li><li>Имеете опыт работы с Мок-сервисами (Wiremock или аналоги)<\/li><li>Имеете опыт работы с инструментами: SOAP UI, Postman, Jira, Confluence, Git, IntelliJ IDEA, Bitbucket<\/li><li>Имеете опыт работы с системами на микросервисной архитектуре (Spring Cloud, Kubernetes, Openshift или аналоги) (Будет плюсом)<\/li><li>Имеете опыт работы с системами Cache (Redis, Hazelcast) (Будет плюсом)<\/li><\/ul>",
      "views": 124
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://t.me/JuliePetrova",
      "created_at": "Thu, 11 Sep 2025 14:46:24 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon1.webp",
      "salary": "~ от 150 000 ₽",
      "title": "Тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания Task является ключевым игроком на финансовом рынке России. Она создает надежную инфраструктуру для торговли, инвестиций и инноваций.<\/p><p>Вам предстоит разрабатывать тест-кейсы и тестпланы, а также выполнять тестирование продукта согласно этим планам. Нужно будет поддерживать актуальность тестовых сценариев, анализировать требования и выявлять дефекты. Вы будете разрабатывать UI и API автотесты на Python, поддерживать и развивать фреймворк автотестирования, составлять планы тестирования и работать с инструментами.<\/p>",
      "company": "Task",
      "location": "",
      "id": 7930,
      "category": "qa",
      "conditions_details": "<ul><li>Работа в динамичной команде, где можно влиять на процессы<\/li><li>Оформление по Трудовому кодексу РФ<\/li><li>Белая зарплата и прозрачная система бонусов<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в тестировании от 3 лет<\/li><li>Понимаете теорию тестирования и техники тест-дизайна<\/li><li>Умеете писать тестовую документацию, такую как тест-кейсы и чек-листы<\/li><li>Имеете опыт тестирования микросервисов с синхронными и асинхронными вызовами<\/li><li>Знаете протоколы HTTP/WS и умеете работать с API (REST, Postman, curl)<\/li><li>Умеете анализировать логи (Kibana) и использовать отладочные прокси (Fiddler, Charles)<\/li><li>Имеете опыт работы с TMS (Allure TestOPS, Test IT) и багтрекерами (Jira, Redmine)<\/li><li>Имеете опыт разработки UI/API тестов на Python и работы с Selenium Webdriver<\/li><li>Имеете базовое понимание CI/CD и опыт работы с Git<\/li><\/ul>",
      "views": 86
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125230475",
      "created_at": "Thu, 11 Sep 2025 12:38:20 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/_20250324120655.webp",
      "salary": "~ от 165 000 ₽",
      "title": "Тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Лаборатория Касперского занимается разработкой высоконагруженных сервисов, которые помогают продавать и распространять продукты компании. Эти сервисы работают с продуктами и пользователями, предлагая персональные маркетинговые предложения и собирая аналитические данные. Компания существует 25 лет и создает безопасный мир, защищая данные более 400 миллионов пользователей по всему миру. В компании работают более 4500 человек в 34 офисах.<\/p><p>Вы будете писать авто-тесты на С#, планировать и проводить различные виды тестирования. Вам нужно будет писать тест-кейсы, готовить и поддерживать тестовые стенды, а также настраивать сервисы в боевой эксплуатации.<\/p>",
      "company": "Касперский",
      "location": "",
      "id": 7922,
      "category": "qa",
      "conditions_details": "<ul><li>Интересная работа<\/li><li>Команда лучших экспертов<\/li><li>Масштабные задачи<\/li><li>Самые современные технологии<\/li><li>Расширение технического кругозора<\/li><li>Социальный пакет<\/li><li>ДМС и страхование жизни (включая детей) с первого месяца<\/li><li>Бесплатное обучение: митапы, конференции, сертификации, 8 иностранных языков<\/li><li>Ежемесячный бонус на питание<\/li><li>Оплата мобильной связи<\/li><li>Комфортные условия: 2 спортзала и сауны в офисе, свой ресторан и бар, врач и массаж в офисе<\/li><li>Программа релокации для кандидатов из регионов<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы от 3 до 6 лет<\/li><li>Разбираетесь в методиках и видах тестирования<\/li><li>Умеете писать авто-тесты на C#<\/li><li>Знаете .NET, Apache Kafka, REST API, MS SQL<\/li><li>Умеете применять различные виды тестирования на практике<\/li><li>Умеете выделять критичные кейсы для тестирования<\/li><li>Имеете опыт администрирования Windows, SQL Server, IIS<\/li><li>Имеете опыт проведения нагрузочного тестирования<\/li><li>Имеете опыт автоматизации развёртывания инфраструктуры<\/li><\/ul>",
      "views": 96
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125225354",
      "created_at": "Thu, 11 Sep 2025 11:04:00 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/KODE_20250813115935.webp",
      "salary": "~ от 272 400 ₽",
      "title": "Тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>KODE занимается разработкой цифровых продуктов, таких как мобильные и веб-приложения, а также IoT-решения. Компания работает с 2013 года и занимает лидирующие позиции в рейтингах по мобильной разработке и дизайну. Также KODE входит в топ лучших работодателей России по версиям Forbes и РБК. В команде компании более 350 специалистов, которые работают над улучшением жизни пользователей, бизнеса и государства.<\/p><p>Вы будете заниматься автоматизированным, интеграционным, E2E и ручным тестированием сервисов. Вам предстоит составлять регрессионную модель и тесты, писать тест-кейсы, чек-листы и баг-репорты. Также вы будете проверять дефекты в продуктовой среде, разрабатывать отчетность по результатам тестов и работать в Agile-процессе, соблюдая релизный цикл.<\/p>",
      "company": "KODE",
      "location": "",
      "id": 7904,
      "category": "qa",
      "conditions_details": "<ul><li>Трудоустройство в аккредитованную IT-компанию, что дает возможность получить IT-ипотеку и отсрочку от армии<\/li><li>Гибкие рабочие процессы и лояльное управление без лишней бюрократии<\/li><li>Гибкое начало рабочего дня<\/li><li>Возможность работать удаленно<\/li><li>Полный пакет ДМС, включая стоматологию и ветеринарию<\/li><li>Прозрачность в коммуникациях и планах развития<\/li><li>Поддержка инициатив и уважение к желаниям специалиста<\/li><li>Возможность влиять на проекты и выделенное время на развитие<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт написания авто-тестов на Python с использованием PyTest и Selenium<\/li><li>Понимаете клиент-серверную архитектуру и знаете HTTP-запросы<\/li><li>Имеете опыт написания сценариев тестирования в Postman/Apidog или SoapUI<\/li><li>Проводите ручное тестирование UI, интеграционное и нагрузочное тестирование<\/li><li>Умеете работать с логами и воспроизводить баги по описанным сценариям<\/li><li>Умеете составлять тест-кейсы, чек-листы, баг-репорты<\/li><li>Имеете опыт работы с шинами данных, брокерами (Apache Kafka)<\/li><li>Имеете опыт работы с кеширующими слоями сервисов<\/li><li>Имеете опыт работы с DevTools, Zephyr, Docker, docker-compose и k8s<\/li><li>Умеете читать и валидировать OpenAPI спецификацию<\/li><li>Умеете анализировать корнер-кейсы при воспроизведении багов<\/li><li>Знаете вопросы безопасности и уязвимостей сервисов (XSS, CSRF)<\/li><li>Понимаете политику CORS<\/li><li>Имеете навыки менторинга и код-ревью авто-тестов<\/li><\/ul>",
      "views": 98
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125217186",
      "created_at": "Thu, 11 Sep 2025 10:11:05 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon2.webp",
      "salary": "~ от 270 600 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>\"Лаборатория Качества\" — это компания, которая уже 16 лет занимается тестированием программного обеспечения. Она работает с крупными клиентами и ценит точность, ясность и честные результаты. В компании создана адекватная рабочая среда, где нет токсичности, есть быстрые решения, понятные процессы и нормальная поддержка. Важно, чтобы сотрудники были включены в работу, хотели расти и готовы вкладываться в неё.<\/p><p>Вы будете разрабатывать и поддерживать автотесты на C# с использованием NUnit, Playwright/Selenium. Вам нужно будет проводить ручное тестирование по методике GIVEN-WHEN-THEN, настраивать интеграцию автотестов в CI/CD и создавать проверки для REST API и UI. Также вы будете участвовать в код-ревью, обмене опытом и работе распределённой команды, а также выстраивать процесс автоматизации с нуля.<\/p>",
      "company": "Лаборатория качества",
      "location": "",
      "id": 7899,
      "category": "qa",
      "conditions_details": "<ul><li>Работа в аккредитованной ИТ-компании<\/li><li>Удаленный формат на постоянной основе<\/li><li>Пятидневная рабочая неделя<\/li><li>Оплачиваются больничные в 100% размере среднедневного заработка<\/li><li>Предоставляются отпуска<\/li><li>Заработная плата переводится на карту дважды в месяц<\/li><li>Бесплатное обучение на профильных курсах, доступ к внутренним учебным центрам и библиотеке<\/li><li>Демократичная внутренняя культура и креативный подход к корпоративной жизни на удаленке<\/li><li>Проводятся сезонные онлайн-ивенты<\/li><li>Сотрудники поздравляются с Днем Рождения<\/li><li>У каждого сотрудника есть личный \"менеджер счастья\"<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт 3–5 лет в автоматизации тестирования на C#<\/li><li>Знаете C#, NUnit, FakeItEasy, RestSharp, Playwright/Selenium<\/li><li>Имеете навыки работы с MS SQL 2022 и понимаете REST API<\/li><li>Знаете принципы модульного и интеграционного тестирования<\/li><li>Имеете опыт внедрения автотестов в CI/CD<\/li><li>Проявляете самостоятельность, внимательность и инициативность<\/li><li>Умеете объяснять решения и показывать примеры кода (будет плюсом, если есть открытые репозитории)<\/li><li>Готовы работать в часовых поясах мск +4/+5/+6/+7<\/li><li>Будет плюсом опыт работы с ERP или финтех-системами<\/li><li>Будет плюсом опыт наставничества и передачи знаний<\/li><\/ul>",
      "views": 100
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125215530",
      "created_at": "Thu, 11 Sep 2025 09:45:58 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon3.webp",
      "salary": "от 200 000 ₽",
      "title": "QA тестировщик (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Компания IPChain объединяет ведущих участников рынка интеллектуальной собственности, создавая единое цифровое пространство доверия. Один из продуктов компании – FonMix, b2b плеер для озвучки коммерческих площадей, который используется более чем в 30 000 объектов. Технологический стек включает Python (FastAPI), PostgreSQL, JavaScript (Vue.js), Docker и другие.<\/p><p>Вам предстоит заниматься разработкой и поддержкой автоматизированных тестов для нового и существующего функционала.<\/p>",
      "company": "IPChain",
      "location": "",
      "id": 7887,
      "category": "qa",
      "conditions_details": "<ul><li>Работа в аккредитованной IT-компании, резиденте Сколково<\/li><li>Соблюдение ТК РФ: официальное трудоустройство, полностью белая заработная плата<\/li><li>Гибкий старт рабочего дня<\/li><li>Формат работы на выбор: удаленка, гибрид, офис (м. Савеловская)<\/li><li>Адекватная нагрузка и сроки, отсутствие тайм-трекинга<\/li><li>Возможность развиваться: оплачивается покупка книг, курсов, участие в конференциях<\/li><li>Возможность влиять на продукт: прислушиваются к мнению каждого члена команды, ценят обмен знаниями и опытом<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете коммерческий опыт работы от 3 лет<\/li><li>Глубоко понимаете теорию тестирования и имеете опыт создания автоматизированных тестов с нуля<\/li><li>Имеете опыт работы с Python<\/li><li>Имеете практический опыт использования Pytest для автоматизации тестирования backend<\/li><li>Знаете и имеете опыт работы с PostgreSQL<\/li><li>Имеете опыт использования TestRail или аналогичных систем управления тестированием<\/li><li>Владеете навыками работы с Postman для тестирования API<\/li><li>Уверенно владеете Git<\/li><li>Умеете самостоятельно организовывать работу и принимать решения<\/li><li>Будет плюсом опыт работы с Selenium, знание Allure или аналогичных систем для отчетности, опыт настройки CI/CD процессов<\/li><\/ul>",
      "views": 105
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/125198972",
      "created_at": "Thu, 11 Sep 2025 07:29:45 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon4.webp",
      "salary": "~ от 182 300 ₽",
      "title": "QA Engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>IT-FINANCE — это продуктовая команда, которая создает программное обеспечение для компаний, занимающихся лидогенерацией и финтехом. Сейчас команда ищет QA автоматизатора для одного из своих интересных проектов.<\/p><p>Вы будете разрабатывать и поддерживать автоматизированные тесты на Python для API, UI и интеграций. Вам нужно будет поддерживать CI/CD, проводить код-ревью для QA Auto с других проектов, а также создавать и поддерживать тестовую документацию, такую как чек-листы, тест-кейсы и матрицы проверок. Вам предстоит искать, описывать и приоритизировать баги, оптимизировать регрессионное тестирование через автоматизацию, взаимодействовать с разработчиками, QA и Devops для обеспечения качества продукта, анализировать и оптимизировать процессы тестирования, а также анализировать данные в ELK.<\/p>",
      "company": "Ит-Финанс",
      "location": "",
      "id": 7842,
      "category": "qa",
      "conditions_details": "<ul><li>Прозрачная система бонусов за хорошую работу и регулярная индексация зарплаты<\/li><li>Оформление по Трудовому кодексу РФ<\/li><li>Льготы как у IT-аккредитованной компании<\/li><li>Полностью удаленная работа<\/li><li>Гибкий график, учитывающий разные режимы работы, стандартная пятидневная рабочая неделя<\/li><li>Предоставление корпоративного оборудования<\/li><li>ДМС со стоматологией, телемедициной и профессиональной психологической поддержкой<\/li><li>Компенсация внешнего обучения за счет компании<\/li><li>Работа в команде опытных специалистов в сфере IT и FinTech с дружелюбной атмосферой<\/li><li>Корпоративные мероприятия два раза в год<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы от 2 лет в QA, из них более 1 года на автоматизации<\/li><li>Уверенно знаете Python и библиотеку PyTest<\/li><li>Имеете опыт работы с Allure<\/li><li>Владеете инструментами автоматизации тестирования, такими как Selenium и Playwright<\/li><li>Понимаете принципы ООП, разработки и паттерны проектирования<\/li><li>Понимаете принципы работы CI/CD<\/li><li>Знаете SQL на уровне написания запросов с использованием JOIN и группировок, будет плюсом опыт работы с PostgreSQL/ClickHouse<\/li><li>Имеете опыт работы с инструментами управления задачами и баг-трекинга<\/li><li>Знаете Linux/Bash на уровне пользователя<\/li><li>Будет плюсом опыт работы с Docker/Kubernetes, TestOps, SQLAlchemy/Django<\/li><\/ul>",
      "views": 117
    },
    {
      "requirements": "",
      "level": "middle",
      "format": "удалённо",
      "link": "https://t.me/Valeria_Increment",
      "created_at": "Wed, 20 Aug 2025 09:46:22 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/img/fon4.webp",
      "salary": "~ от 180 000 ₽",
      "title": "qa engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>Инкремент ищет AQA Engineer для работы в команде. Компания занимается разработкой и внедрением новых решений.<\/p><p>Предстоит заниматься автоматизацией тестирования, разрабатывать и поддерживать тестовые сценарии, а также анализировать результаты тестирования.<\/p>",
      "company": "Инкремент",
      "location": "",
      "id": 5643,
      "category": "qa",
      "conditions_details": "<ul><li>Формат работы: Удалённо<\/li><li>Тип работы: Fulltime<\/li><li>Страна: Россия<\/li><li>Требуемые технологии: .net, test automation, json, jenkins, xml, csharp, ci cd, selenium, aqa, appium, azure devops, xpath, tfs, nunit, mstest<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете опыт работы в автоматизации тестирования от 3 лет<\/li><li>Имеете опыт работы с C# от 3 лет<\/li><li>Имеете опыт работы с Appium от 1 года<\/li><li>Знаете английский на уровне понимания документации<\/li><li>Знаете тестовые артефакты (кейсы, наборы, планы)<\/li><li>Умеете анализировать тестовые артефакты<\/li><li>Имеете опыт работы с C# .NET Framework<\/li><li>Знаете тестовые фреймворки (MSTest, NUnit)<\/li><li>Имеете опыт работы с Appium C# (Android, iOS)<\/li><li>Знаете системы CI/CD (Jenkins, TFS, AzureDevOps)<\/li><li>Будет плюсом: Имеете опыт работы с Selenium, знаете XPath, знаете XML/JSON<\/li><\/ul>",
      "views": 567
    },
    {
      "requirements": "",
      "level": "senior",
      "format": "удалённо",
      "link": "https://hh.ru/vacancy/123919152",
      "created_at": "Tue, 12 Aug 2025 12:49:08 GMT",
      "description": "",
      "important_info_text": "",
      "company_icon": "/static/uploads/IT_SCOUT_20250716165027.webp",
      "salary": "~ от 200 000 ₽",
      "title": "qa engineer (auto)",
      "deleted_at": null,
      "is_deleted": false,
      "description_details": "<p>IT SCOUT - IT / Development — это компания, которая является лидером в сфере разработки инновационного программного обеспечения. За годы работы компания создала множество масштабируемых решений, которые помогают бизнесу развиваться и достигать новых высот. Сейчас компания ищет AQA Engineer для усиления направления автотестирования.<\/p><p>Ваши зоны ответственности будут включать автоматизацию UI, API и snapshot тестов, поддержание и развитие тестового фреймворка, а также поддержку существующих автотестов. Вам предстоит участвовать в code review автотестов, проводить ручное тестирование UI и API, писать тестовую документацию, анализировать и тестировать требования, а также тесно сотрудничать с разработчиками, DevOps, аналитиками и продукт-менеджерами.<\/p>",
      "company": "IT SCOUT",
      "location": "",
      "id": 5019,
      "category": "qa",
      "conditions_details": "<ul><li>Рабочее место на ваш выбор: уютный офис в бизнес-центре класса «А» или возможность работать удаленно<\/li><li>Зарплата: вы можете получать зарплату в рублях или в евро<\/li><li>ДМС с покрытием всех основных услуг<\/li><li>Гибкий график работы: начинайте день, когда вам удобно — до 11:00 по МСК. Рабочий день — 9 часов, включая 1 час на обед<\/li><li>Завтраки в офисе<\/li><li>Частичная компенсация занятий в фитнес-зале и курсов английского<\/li><li>Доступ к корпоративной библиотеке с актуальными книгами<\/li><li>Консультации с психологом<\/li><li>Тимбилдинг: мастер-классы, выездные мероприятия на природу, корпоративы<\/li><li>Поддержка при релокации для сотрудников из других городов или стран после успешного прохождения испытательного срока<\/li><\/ul>",
      "important_info_enabled": false,
      "requirements_details": "<ul><li>Имеете 3+ года опыта в тестировании ПО, из которых не менее 2 лет опыта автоматизации тестирования с использованием Playwright<\/li><li>Обладаете глубокими знаниями и опытом работы с Playwright<\/li><li>Имеете хорошее знание TypeScript и опыт написания тестов на этом языке<\/li><li>Умеете писать чистый, понятный и поддерживаемый код<\/li><li>Имеете опыт работы с системами контроля версий, например, Git<\/li><li>Имеете понимание Agile и Scrum методологий<\/li><li>Обладаете опытом создания и поддержания тестовой документации<\/li><li>Умеете работать с CI/CD инструментами, например, Jenkins, GitLab CI<\/li><li>Имеете опыт работы с системами управления тестированием, например, TestRail, Xray<\/li><li>Имеете знание и опыт работы с инструментами для отслеживания багов<\/li><li>Имеете опыт работы с REST API тестированием<\/li><li>Обладаете базовыми знаниями HTML, CSS<\/li><li>Будет плюсом: опыт работы с другими фреймворками для автоматизации тестирования, например, Selenium, Cypress; знание других языков программирования, используемых для автоматизации, например, Python, Java; понимание и опыт работы с контейнеризацией, например, Docker; базовые знания инфраструктуры и облачных сервисов, например, AWS, Azure; опыт работы с инструментами для тестирования производительности, например, Locust, k6; знания в области тестирования безопасности<\/li><\/ul>",
      "views": 575
    }
  ],
  "timestamp": "2025-09-28T13:25:34.249762994"
}