{
  "total": 16,
  "jobs": [
    {
      "requirements": "<ul><li>Имеете опыт работы в тестировании iOS, Android, Web, Backend от 2 лет<\/li><li>Имеете опыт в автоматизации тестирования от 1 года с использованием Java, Selenide, RestAssured<\/li><li>Имеете опыт тестирования систем на микросервисной архитектуре<\/li><li>Имеете опыт работы с базами данных<\/li><li>Практически применяете практики тест-дизайна<\/li><li>Умеете проектировать тест-кейсы и подготавливать тестовые данные<\/li><li>Имеете опыт тестирования REST API (ручное и автоматизированное)<\/li><li>Имеете опыт работы с системой версионного контроля GIT (бранчи, пулл-реквесты и т.д.)<\/li><li>Имеете опыт работы с системами CI<\/li><li>Умеете использовать тестовые инструменты (Swagger, Postman, Fiddler/Charles, DevTools)<\/li><li>Умеете читать и анализировать логи<\/li><li>Имеете опыт тестирования аналитики (Appsflyer, Amplitude, Firebase, AppMetrica)<\/li><li>Будет плюсом: имеете практический опыт нагрузочного тестирования, практический опыт автоматизации с Appium, опыт написания эмуляторов, заглушек, опыт написания генераторов тестовых данных, опыт внедрения автотестов в CI/CD, опыт работы с ИИ<\/li><li>Умеете работать в команде, коммуникабельны<\/li><li>Проявляете проактивный подход к рабочим обязанностям<\/li><li>Обладаете развитыми аналитическими способностями, хорошей памятью, стрессоустойчивостью, ответственностью<\/li><li>Умеете управлять временем (способны эффективно планировать своё время и приоритизировать задачи для соблюдения сроков)<\/li><li>Владеете английским уровня intermediate и выше<\/li><\/ul>",
      "level": "senior",
      "format": "удалённо",
      "description": "<p>Компания DevTeamGroup ищет опытного специалиста для работы над проектом Gem Space. Gem Space – это приложение, где можно решать любые задачи: читать, смотреть, общаться и зарабатывать, открывая неограниченные возможности для развлечений, бизнеса и повседневных дел.<\/p><p>Вы будете проводить ручное и автоматизированное тестирование мобильных и веб-приложений. Вам предстоит заниматься автоматизацией тестирования с использованием Java, Selenide, RestAssured, Appium, а также тестировать API и микросервисы. Кроме того, вы будете проводить функциональное и нефункциональное тестирование, включая анализ и тестирование требований, писать тестовую документацию и тестовые сценарии. Вам нужно будет разрабатывать фреймворк для тестирования, выявлять и приоритизировать ошибки, участвовать в командных митингах и сопровождать фичи на всех этапах разработки. Также вы будете проводить регрессионное и интеграционное тестирование, а также отчитываться о качестве продукта и предоставлять статус тестирования.<\/p>",
      "company": "ДэвТим-Групп",
      "id": "9453",
      "title": "QA тестировщик (auto)",
      "salary": "~ от 230 000 ₽",
      "url": "https://hh.ru/vacancy/125851462"
    },
    {
      "requirements": "<ul><li>Имеете опыт работы mobile QA (iOS и/или Android) от 2 лет<\/li><li>Имеете практический опыт тестирования на реальных устройствах и эмуляторах<\/li><li>Владеете инструментами автоматизации мобильного тестирования, такими как Appium, Espresso, XCUITest или аналогичными<\/li><li>Понимаете регрессионное, исследовательское, UI/UX и функциональное тестирование<\/li><li>Знакомы с жизненным циклом мобильных приложений, контролем версий и процессами выпуска<\/li><li>Умеете создавать и поддерживать тестовые случаи и отчёты об ошибках<\/li><li>Хорошо знаете SQL или похожий язык для проверки данных<\/li><li>Имеете опыт работы в Agile/Scrum-средах<\/li><li>Умеете выполнять тесты с использованием облачной мобильной платформы<\/li><li>Имеете базовое понимание Jetpack Compose, SwiftUI<\/li><li>Хорошо владеете английским языком, как письменно, так и устно<\/li><li>Будет плюсом: опыт работы с инструментами автоматизации мобильного тестирования (Appium, Espresso, XCUITest и аналогичными), хорошее знание SQL или аналогичного языка для базовой валидации данных, опыт работы в Agile/Scrum-средах, выполнение тестов с использованием облачной мобильной платформы, базовое понимание Jetpack Compose, SwiftUI, хорошее владение английским языком (письменным и устным)<\/li><\/ul>",
      "level": "senior",
      "format": "удалённо",
      "description": "<p>Компания занимается разработкой собственной архитектуры для поддержки проектов европейских брендов. Вы будете планировать и проводить ручные и автоматизированные тесты для мобильных приложений на iOS и Android. Вам нужно будет писать и поддерживать скрипты автоматизации, а также взаимодействовать с командами разработки и продуктов, чтобы находить проблемы на ранних этапах. Перед каждым релизом вы будете проводить регрессионное тестирование, документировать результаты и отслеживать ошибки. Также вам предстоит участвовать в разработке стратегии QA для мобильных проектов и следить за новыми тенденциями в области мобильного QA.<\/p>",
      "company": "NDA",
      "id": "9356",
      "title": "QA Engineer (auto)",
      "salary": "~ от 173 800 ₽",
      "url": "https://t.me/V_recruiting"
    },
    {
      "requirements": "<ul><li>Имеете опыт работы в QA от 3 лет<\/li><li>Имеете опыт тестирования приложений на Android и iOS<\/li><li>Имеете опыт написания автотестов на Android или iOS<\/li><li>Знаете, как работать со снифферами трафика Charles/Proxyman<\/li><li>Имеете опыт работы с REST API, Swagger, HTTP/HTTPS, JSON<\/li><li>Имеете опыт работы с Gitlab CI<\/li><li>Имеете базовые знания Git<\/li><li>Умеете работать с требованиями и технической документацией<\/li><li>Знаете методики тестирования<\/li><li>Способны выявлять уязвимые места систем и находить дефекты<\/li><li>Понимаете, как работают клиент-серверные приложения<\/li><\/ul>",
      "level": "senior",
      "format": "удалённо",
      "description": "<p>Команда Магнит OMNI занимается развитием пользовательского опыта покупок в Магнит Маркете. Она отвечает за весь путь клиента, начиная от добавления товара в корзину и заканчивая оформлением заказа.<\/p><p>Вы будете документировать и отслеживать ошибки, создавать чек-листы и подробные тестовые сценарии. Вам нужно будет проводить регрессионное, функциональное и интеграционное тестирование. Также предстоит писать автотесты под Android, а при желании — и под iOS.<\/p>",
      "company": "Магнит",
      "id": "9321",
      "title": "qa engineer (auto)",
      "salary": "~ от 218 500 ₽",
      "url": "https://magnit.tech/vacancies/2327"
    },
    {
      "requirements": "<ul><li>Имеете опыт работы от 3 лет в аналогичной роли<\/li><li>Имеете хорошие навыки программирования, понимаете принципы SOLID и паттерны проектирования<\/li><li>Имеете опыт создания фреймворка тестовой автоматизации с нуля — это будет плюсом<\/li><li>Имеете опыт ручного и автоматизированного API-тестирования с использованием Java/Kotlin и Postman<\/li><li>Имеете опыт тестирования приложений для финансовых организаций с микросервисной архитектурой<\/li><li>Умеете чётко и кратко описывать сложные баги и ситуации<\/li><li>Имеете отличные коммуникативные и коллаборационные навыки<\/li><\/ul>",
      "level": "senior",
      "format": "удалённо",
      "description": "<p>Компания Salmon занимается разработкой продуктов для финансовой сферы. Работает с клиентами из банковской, брокерской и биржевой индустрии.<\/p><p>Вы будете заниматься разработкой и поддержкой тест-кейсов, анализировать результаты тестирования. Вам нужно будет работать с разработчиками и DevOps-командой, чтобы улучшать инструменты для автоматизации тестирования. Также предстоит следовать процессам QA, предлагать улучшения, создавать и развивать стратегию тестирования с фокусом на автоматизацию. Вы будете выполнять тест-планы, в основном автоматизированные, но иногда и ручные. Вам нужно будет отвечать за создание и поддержку набора автоматизированных тестов в своей зоне ответственности и отчитываться по их состоянию. Вы будете давать оценки старшим QA Automation инженерам и поднимать риски при возникновении сложностей с выполнением задач.<\/p>",
      "company": "Salmon",
      "id": "9254",
      "title": "QA Engineer (auto)",
      "salary": "~ от 280 000 ₽",
      "url": "https://t.me/evgeniyaponomaryova"
    },
    {
      "requirements": "<ul><li>Имеете более 4 лет опыта ручного QA мобильных или веб-продуктов<\/li><li>Умеете работать с API (Postman, cURL)<\/li><li>Имеете опыт работы с баг-трекингом (Jira)<\/li><li>Владеете навыками анализа логов и работы с сетевыми прокси (Fiddler, Charles)<\/li><li>Умеете быстро адаптироваться в стартапе и самостоятельно находить риски<\/li><li>Будет плюсом опыт UI-автоматизации (Playwright, Appium, Detox)<\/li><li>Будет плюсом знание performance/load/security-тестирования<\/li><li>Будет плюсом опыт работы с AI-продуктами или мессенджерами<\/li><\/ul>",
      "level": "senior",
      "format": "удалённо",
      "description": "<p>Компания DevHunt — это стартап, который меняет то, как люди общаются с искусственным интеллектом. В приложении есть много AI-персонажей, с которыми можно общаться текстом, фото и видео. У компании уже более 250 тысяч активных пользователей в месяц, и каждую неделю добавляется по 2-3 новые функции.<\/p><p>Вам нужно будет тестировать iOS, Android, Web и backend API. Также предстоит проверять бизнес-логику, включая платежи, deep links, A/B-тесты и монетизацию. Вы будете проводить smoke и регрессионное тестирование перед релизами, расставлять приоритеты, анализировать баги через логи, мониторинг и трафик. Кроме того, вам нужно будет сотрудничать с командой продукта и разработки, а также менторить небольшую QA-команду.<\/p>",
      "company": "DevHunt",
      "id": "9114",
      "title": "QA Engineer (auto)",
      "salary": "от 158 000 ₽",
      "url": "https://t.me/nadzeya_recruiter"
    },
    {
      "requirements": "<ul><li>Имеете высшее образование, желательно техническое или математическое<\/li><li>Имеете опыт работы в тестировании ПО более 5 лет (iOS, Android, Web, Backend)<\/li><li>Имеете опыт в автоматизации тестирования от 3 лет<\/li><li>Имеете опыт мануального тестирования на одном из последних проектов<\/li><li>Имеете опыт в автоматизации тестирования с использованием Python или Java, Selenide, Selenium, RestAssured, Appium и т. д.<\/li><li>Имеете опыт тестирования систем на микросервисной архитектуре от 3 лет<\/li><li>Имеете опыт работы с базами данных от 3 лет<\/li><li>Имеете практический опыт применения практик тест-дизайна<\/li><li>Умеете проектировать тест-кейсы и подготавливать тестовые данные<\/li><li>Имеете опыт тестирования REST API (ручное и автоматизированное)<\/li><li>Имеете опыт работы с системой версионного контроля GIT (бранчи, пулл-реквесты и т.д.)<\/li><li>Имеете опыт работы с системами CI<\/li><li>Умеете использовать тестовые инструменты (Swagger, Postman, Fiddler/Charles, DevTools)<\/li><li>Умеете читать и анализировать логи<\/li><li>Очень желателен опыт в нагрузочном тестировании<\/li><\/ul>",
      "level": "senior",
      "format": "удалённо",
      "description": "<p>Компания Трайв Технолоджис занимается разработкой активно развивающихся проектов. Вы будете заниматься тестированием программного обеспечения на различных платформах, включая iOS, Android, Web и Backend. Вам предстоит проводить мануальное тестирование, а также автоматизировать его с использованием Python или Java, Selenide, Selenium, RestAssured, Appium и других инструментов. Вам нужно будет тестировать системы на микросервисной архитектуре, работать с базами данных и использовать систему версионного контроля GIT.<\/p>",
      "company": "Трайв Технолоджис",
      "id": "9033",
      "title": "QA Engineer (auto)",
      "salary": "от 200 000 ₽",
      "url": "https://hh.ru/vacancy/125658288"
    },
    {
      "requirements": "<ul><li>Имеете опыт работы на позиции QA от 3 лет<\/li><li>Знаете теорию тестирования<\/li><li>Умеете составлять тестовую документацию<\/li><li>Умеете анализировать бизнес и функциональные требования<\/li><li>Имеете опыт ручного тестирования WEB и нативных мобильных приложений под iOS &amp; Android от 2 лет<\/li><li>Имеете опыт тестирования backend (API, логи, БД)<\/li><li>Имеете опыт работы с непрерывным деплоем задач (CI/CD)<\/li><li>Имеете опыт и желание развиваться в направлении автоматизированного тестирования<\/li><li>Имеете опыт работы с API (REST) - Postman, Swagger - от 1 года, знаете основные CRUD операции, умеете писать скрипты для облегчения запросов<\/li><li>Имеете опыт работы с системами таск-менеджмента (Jira) и тест-менеджмента (TestIT)<\/li><li>Имеете навыки работы с базами данных и составления SQL-запросов (PostgreSQL) - от 1 года, умеете обновлять данные, писать комплексные запросы<\/li><li>Понимаете жизненный цикл ПО<\/li><li>Имеете опыт работы по Agile-методологиям (Scrum, Kanban)<\/li><li>Имеете навыки чтения логов и нахождения причины ошибок (Redash, Kibana) - от 1 года, понимаете уровни логирования<\/li><li>Имеете опыт работы с Jenkins<\/li><li>Умеете расставлять приоритеты и эффективно планировать рабочее время<\/li><li>Умеете грамотно излагать свои мысли, задавать вопросы и отстаивать свое мнение<\/li><li>Умеете работать в команде<\/li><li>Будет огромным плюсом: имеете базовые знания Java (или сильное желание быстро изучить)<\/li><li>Будет огромным плюсом: имеете опыт или знакомство с фреймворками для автоматизации тестирования: Selenide / Selenium WebDriver для UI-тестов и RestAssured для API-тестов<\/li><li>Будет огромным плюсом: знаете и понимаете принципы работы JUnit 5, TestNG<\/li><li>Будет огромным плюсом: имеете опыт работы со сборщиком проектов Maven / Gradle<\/li><li>Будет огромным плюсом: понимаете принципы Page Object Model (POM) и других паттернов проектирования в автотестах<\/li><li>Будет огромным плюсом: умеете работать с системой контроля версий Git (GitLab)<\/li><li>Будет огромным плюсом: имеете опыт работы с IDE (IntelliJ IDEA)<\/li><li>Будет огромным плюсом: имеете базовое понимание архитектуры автоматизированных тестов и CI/CD процесса для их интеграции<\/li><li>Также плюсом будет: понимание фондового рынка (проявление интереса)<\/li><li>Также плюсом будет: имеете практический опыт инвестирования на фондовом рынке<\/li><li>Также плюсом будет: знаете системы QORT и QUIK<\/li><li>Также плюсом будет: имеете опыт работы без документации<\/li><\/ul>",
      "level": "middle",
      "format": "удалённо",
      "description": "<p>ООО «Ньютон Технологии» – это продуктовая IT-компания, которая создает приложение «Газпромбанк Инвестиции». Компания помогает людям с разным уровнем дохода начать инвестировать в ценные бумаги, которые торгуются на Московской и СПБ Биржах. Платформа компании – это распределенная система с высокими требованиями к надежности и производительности, работающая в условиях больших нагрузок. В компании используется микросервисная архитектура без устаревшего кода, применяются современные решения в разработке.<\/p><p>Вам предстоит тестировать мобильное и веб-приложение, а также API, используя ручное тестирование. Нужно будет разрабатывать, поддерживать и запускать автотесты для UI и API, а также тестировать интеграционную шину. Вам нужно будет проводить регулярное регресс- и смоук-тестирование релизов, в том числе с помощью автоматизированных сценариев. Также вы будете участвовать в проектах, проводить ревью технических заданий на этапе анализа, оценивать задачи на тестирование и автоматизацию. Вам нужно будет участвовать в настройке тестовых данных и стендов для тестирования, писать тестовую документацию (чек-листы, тест-кейсы, тест-планы) и анализировать результаты прогонов автотестов.<\/p>",
      "company": "Ньютон Технологии",
      "id": "8870",
      "title": "QA тестировщик (auto)",
      "salary": "~ от 193 400 ₽",
      "url": "https://hh.ru/vacancy/125605612"
    },
    {
      "requirements": "<ul><li>Имеете от 3 лет коммерческого опыта в SDET<\/li><li>Имеете коммерческий опыт работы с фреймворками для тестирования<\/li><li>Умеете настраивать CI/CD<\/li><li>Умеете писать мок-сервисы<\/li><li>Умеете делать ревью автотестов<\/li><li>Владеете основным языком программирования Java/Kotlin<\/li><li>Знаете редкие языки программирования Python, C#/.NET, JavaScript<\/li><li>Имеете опыт работы в качестве автоматизатора тестирования/SDET от 3 лет<\/li><li>Имеете опыт автоматизации с использованием фреймворка TestNG или JUnit<\/li><li>Умеете работать с REST API, SOAP API, HTTP/HTTPS, gRPC, Avro<\/li><li>Знаете SQL: DML-, DDL-запросы, JOIN, группировки и агрегирующие функции<\/li><li>Имеете опыт использования систем сборки: Maven, Gradle и других<\/li><li>Имеете опыт настройки CI/CD с помощью TeamCity, Jenkins или GitLab<\/li><\/ul>",
      "level": "senior",
      "format": "удалённо",
      "description": "<p>Компания занимается ускорением доставки продукта, автоматизируя процессы обеспечения качества.<\/p><p>Вы будете автоматизировать процессы тестирования и разработки, а также автоматизировать сбор статистики и составление отчетов по результатам запуска автотестов. Вам предстоит разрабатывать QA-инструменты для команды тестирования и поддерживать окружение для запуска автотестов, например, Gitlab и K8s. Также вы будете привлекать функциональных тестировщиков к автоматизации регрессионных сценариев и участвовать в code review.<\/p>",
      "company": "Tiqum",
      "id": "8814",
      "title": "QA тестировщик (auto)",
      "salary": "до 350 000 ₽",
      "url": "https://t.me/BubenTatiana"
    },
    {
      "requirements": "<ul><li>Имеете опыт разработки автоматизированных тестов<\/li><li>Владеете одним из языков программирования и SQL на уровне написания запросов<\/li><li>Готовы осваивать новые технологии (в проекте используется в основном TypeScript/JS, немного Go, Swift, Kotlin)<\/li><li>Имеете опыт тестирования мобильных приложений, веб-приложений и API<\/li><li>Обладаете практическими знаниями в области тестирования (тест-дизайн, виды тестирования, пирамида тестирования и т.д.)<\/li><li>Имеете опыт построения тестовых моделей<\/li><li>Понимаете методы оптимизации процесса обеспечения качества<\/li><li>Умеете выстраивать конструктивную коммуникацию, как внутри команды, так и со смежными командами<\/li><li>Ответственны и организованны<\/li><li>Умеете работать в условиях большой неопределенности<\/li><\/ul>",
      "level": "senior",
      "format": "удалённо",
      "description": "<p>Компания Авито — самая посещаемая онлайн-платформа объявлений в мире. Через Авито люди размещают объявления о товарах, авто, работе, услугах и недвижимости. В сервисе есть Авито Доставка, которая помогает безопасно совершать сделки по всей России. Авито связывает частных лиц, малый и средний бизнес, а также крупные компании. Ежемесячная аудитория Авито — более 72 миллионов пользователей, а количество активных объявлений превышает 230 миллионов.<\/p><p>Вам предстоит обеспечивать качество доработок продукта, повышать стандарты качества в команде, участвовать в проработке новых функций. Вам нужно будет поддерживать и дополнять тестовую модель продукта, формировать правильную пирамиду тестирования, а также обеспечивать мониторинг работы критических бизнес-сценариев. Вам также предстоит вести задачи, связанные с обеспечением качества, и разрабатывать e2e и интеграционные тесты.<\/p>",
      "company": "Авито",
      "id": "8359",
      "title": "QA тестировщик (auto)",
      "salary": "~ от 322 400 ₽",
      "url": "https://career.avito.com/vacancies/razrabotka/17352/"
    },
    {
      "requirements": "<ul><li>Имеете опыт работы в автоматизации тестирования от 3 лет<\/li><li>Имеете опыт автоматизации web и API<\/li><li>Умеете разрабатывать автотесты на Java/Kotlin, Selenium/Selenide, TestNG/JUnit, Maven/Gradle или на Python, Pytest, Selenium, Request<\/li><li>Имеете опыт работы с системами контроля версий<\/li><li>Имеете опыт работы с системами CI/CD (Jenkins/Teamcity)<\/li><li>Имеете опыт работы с DevOps: Selenoid, Selenium Grid, Docker приложения<\/li><li>Будет плюсом опыт параллельного запуска автотестов<\/li><li>Будет плюсом опыт работы с Appium, Cucumber<\/li><li>Будет плюсом опыт работы с одной из систем логирования: Splunk, Graylog, Kibana<\/li><\/ul>",
      "level": "senior",
      "format": "удалённо",
      "description": "<p>Компания QUALITICA — аккредитованная IT-компания, которая занимается разработкой чат-ботов, онлайн-сервисов, сложных интернет-магазинов, CRM и ERP. Компания выполняет множество интеграций с различными системами, такими как 1С, соцсети, платежные системы и СДЭК. Проекты разнообразные и сложные, что дает возможность приложить свои силы. Работа ведется с крупными компаниями-заказчиками и агентствами, что позволяет быть причастным к нетривиальным историям и видеть все изнутри.<\/p><p>Вы будете создавать и актуализировать автотесты для web и API. Вам нужно будет исследовать проблемы падения автотестов и исправлять их. Также предстоит поддерживать и развивать фреймворк автоматизации тестирования и обеспечивать запуск автотестов и инструментов составления отчетности.<\/p>",
      "company": "QUALITICA",
      "id": "8351",
      "title": "QA тестировщик (auto)",
      "salary": "~ от 231 900 ₽",
      "url": "https://hh.ru/vacancy/125396441"
    },
    {
      "requirements": "<ul><li>Имеете опыт работы в тестировании от 5 лет<\/li><li>Имеете минимальный опыт написания автотестов<\/li><li>Имеете опыт работы с технологиями API (REST | SOAP | GraphQlL | gRPC | WebSocket)<\/li><li>Имеете опыт работы с мобильными приложениями (iOS и Android), понимаете их специфику<\/li><li>Знаете теорию тестирования и техники тест-дизайна<\/li><li>Умеете сниффить трафик и подменять запросы<\/li><li>Умеете читать логи (Kibana/Mesos)<\/li><li>Умеете собирать логи на Android и iOS<\/li><li>Знаете инструменты: Postman, Charles<\/li><li>Имеете высшее образование<\/li><\/ul>",
      "level": "senior",
      "format": "удалённо",
      "description": "<p>Centicore – это компания, которая занимается разработкой мобильных приложений для пользователей по всему миру. Продукты компании помогают людям решать повседневные задачи и делают их жизнь удобнее.<\/p><p>Вы будете проверять, соответствует ли мобильное приложение на Android и iOS документации. Вам нужно будет анализировать требования и готовить тестовую документацию и данные. Также предстоит тестировать документацию и дизайн макетов по методу Shift-Left, проводить функциональное, регрессионное и интеграционное тестирование. Вы будете тестировать UI и API, находить, локализовать и фиксировать дефекты, а также формировать отчёты об ошибках в Jira. Вам нужно будет разрабатывать тестовые сценарии автотестов на Swift/Kotlin/Java и участвовать в тестировании интеграционной функциональности совместно с другими отделами.<\/p>",
      "company": "Centicore",
      "id": "8298",
      "title": "QA тестировщик (auto)",
      "salary": "~ от 275 000 ₽",
      "url": "https://t.me/chloe_cay"
    },
    {
      "requirements": "<ul><li>Имеете опыт в тестировании от 1 года<\/li><li>Имеете минимальный опыт в автоматизации web приложений, API на Java (курсы, свои проекты)<\/li><li>Понимаете процессы тестирования<\/li><li>Умеете строить план и приоритизировать тестирование<\/li><li>Знаете SQL, CI, GIT, log4J, HTTP, консоль браузера<\/li><li>И будет здорово, если имеете знания JAVA/Kotlin, Selenium, Allure, docker<\/li><li>Умеете взаимодействовать в команде<\/li><\/ul>",
      "level": "middle",
      "format": "удалённо",
      "description": "<p>Крупная медиакомпания с более чем 25-летней историей и миллиардной выручкой создает полезные сервисы и продукты для 15 профессиональных аудиторий. Это журналы, справочные системы, интернет-сервисы и дистанционное обучение.<\/p><p>Вы будете заниматься тестированием новых доработок и автоматизировать его. Вам нужно будет сокращать время прогона автотестов, присваивать приоритеты дефектам, ориентируясь на ценность для пользователя, писать тестовую документацию и локализовать дефекты. Также потребуется обновлять тестовое покрытие, проверять корректность выполнения задач разработчиком в спринте и работать в команде, сообща решая все проблемы.<\/p>",
      "company": "Актион-Технологии",
      "id": "8295",
      "title": "QA тестировщик (auto)",
      "salary": "от 100 000 ₽",
      "url": "https://telegra.ph/QA-Tester-09-14"
    },
    {
      "requirements": "<ul><li>Имеете опыт работы от 3 лет с опытом выстраивания процессов тестирования<\/li><li>Понимаете, как устроено тестирование мобильных приложений<\/li><li>Владеете инструментами тестирования: TestFlight, Firebase Test Lab, Charles Proxy, Postman/Insomnia для API<\/li><li>Имеете опыт работы с системами трекинга багов (Jira, Linear, YouTrack или аналоги)<\/li><li>Знакомы с мониторингом ошибок (Sentry или аналоги)<\/li><li>Умеете мыслить критически и докапываться до сути<\/li><li>Внимательны к деталям, но при этом умеете видеть картину в целом<\/li><li>Горите идеей делать продукт мирового уровня и готовы строить процессы с чистого листа<\/li><li>Будет плюсом опыт автоматизации тестирования (Appium, Detox, или аналоги)<\/li><li>Будет плюсом знание Python и понимание архитектуры FastAPI<\/li><li>Будет плюсом опыт работы в стартапах или быстрорастущих продуктах<\/li><li>Будет плюсом интерес к AI-продуктам<\/li><li>Будет плюсом опыт настройки CI/CD для автоматического тестирования<\/li><\/ul>",
      "level": "senior",
      "format": "удалённо",
      "description": "<p>Компания создает Windi Messenger — новый мессенджер с искусственным интеллектом и встроенной системой задач. Это не просто чат, а инструмент для жизни и бизнеса, который должен быть максимально надежным.<\/p><p>Вы будете тестировать мобильные приложения (iOS, Android), а в будущем и веб-версию. Вам нужно будет выстраивать процессы тестирования с нуля, создавать тест-планы, чек-листы и регламенты. Также предстоит находить баги и оформлять их так, чтобы программисты точно поняли проблему, работать с системой мониторинга Sentry для анализа ошибок в продакшене, настраивать и использовать инструменты тестирования для мобильных платформ. Вам нужно будет проверять, что задачи закрыты правильно и ничего не сломано, давать обратную связь по юзабилити и логике, а также работать вместе с разработчиками (бэкенд на FastAPI Python) и продакт-менеджером над улучшением продукта.<\/p>",
      "company": "MANGO FZCO",
      "id": "8292",
      "title": "QA Engineer (auto)",
      "salary": "от 200 000 ₽",
      "url": "https://hh.ru/vacancy/125391076"
    },
    {
      "requirements": "<ul><li>Имеете опыт работы от 3 до 6 лет<\/li><li>Знаете Kotlin, Kaspresso и Espresso<\/li><li>Понимаете основные принципы тестирования мобильных приложений<\/li><li>Имеете опыт работы с TestRail или AllureTestOps<\/li><\/ul>",
      "level": "senior",
      "format": "удалённо",
      "description": "<p>Компания занимается разработкой и поддержкой сложных IT-проектов для крупных международных компаний, в основном это B2B решения для игровой и спортивной индустрии. Сейчас ищет специалиста для работы над мобильным приложением.<\/p><p>Вы будете тестировать функционал для Android, писать новые автотесты на Kotlin с использованием Kaspresso. Вам нужно будет организовывать и улучшать процессы тестирования вместе с командой QA и инженерами, а также развивать инфраструктуру для тестирования приложений.<\/p>",
      "company": "STARTRIBE",
      "id": "8180",
      "title": "Тестировщик (auto)",
      "salary": "~ от 243 000 ₽",
      "url": "https://hh.ru/vacancy/125345973"
    },
    {
      "requirements": "<ul><li>Имеете опыт автоматизации тестирования от 4 лет на JVM платформе (Java Kotlin)<\/li><li>Умеете строить стратегии тестирования и автоматизации продуктов<\/li><li>Знаете функциональное, интеграционное и регрессионное тестирование<\/li><li>Имеете опыт составления плана тестирования и тест-анализа<\/li><li>Имеете опыт работы с REST API и брокером сообщений Kafka<\/li><li>Имеете опыт работы с PostgreSQL, Allure TestOps<\/li><li>Имеете опыт работы с CI/CD инструментами и построения пайплайнов<\/li><\/ul>",
      "level": "senior",
      "format": "удалённо",
      "description": "<p>Компания Top Selection занимается разработкой продуктов для бизнеса. Вы будете писать и поддерживать автотесты, следить за стабильностью тестовой среды. Вам нужно будет оценивать, сколько времени займут задачи по тестированию, готовить сценарии для проверок и разрабатывать фреймворк для тестирования. Также вы будете определять, какие проверки лучше автоматизировать, а какие оставить для ручного выполнения.<\/p>",
      "company": "Top Selection",
      "id": "8143",
      "title": "QA Engineer (auto)",
      "salary": "от 250 000 ₽",
      "url": "https://t.me/ansharkunova"
    },
    {
      "requirements": "<ul><li>Имеете опыт работы в автоматизации тестирования от 3 лет<\/li><li>Имеете опыт работы с C# от 3 лет<\/li><li>Имеете опыт работы с Appium от 1 года<\/li><li>Знаете английский на уровне понимания документации<\/li><li>Знаете тестовые артефакты (кейсы, наборы, планы)<\/li><li>Умеете анализировать тестовые артефакты<\/li><li>Имеете опыт работы с C# .NET Framework<\/li><li>Знаете тестовые фреймворки (MSTest, NUnit)<\/li><li>Имеете опыт работы с Appium C# (Android, iOS)<\/li><li>Знаете системы CI/CD (Jenkins, TFS, AzureDevOps)<\/li><li>Будет плюсом: Имеете опыт работы с Selenium, знаете XPath, знаете XML/JSON<\/li><\/ul>",
      "level": "middle",
      "format": "удалённо",
      "description": "<p>Инкремент ищет AQA Engineer для работы в команде. Компания занимается разработкой и внедрением новых решений.<\/p><p>Предстоит заниматься автоматизацией тестирования, разрабатывать и поддерживать тестовые сценарии, а также анализировать результаты тестирования.<\/p>",
      "company": "Инкремент",
      "id": "5643",
      "title": "qa engineer (auto)",
      "salary": "~ от 180 000 ₽",
      "url": "https://t.me/Valeria_Increment"
    }
  ],
  "timestamp": "2025-09-28T15:10:02.473005145",
  "statistics": {
    "lastUpdated": "2025-09-28T15:10:02.473005145",
    "filteredJobs": 16,
    "keywords": [
      "Kotlin",
      "Android"
    ],
    "totalJobs": 105
  }
}